[NoCoverage] StringLiteral
src/lib/auth.ts:14:75
   SPECTATOR: 1,
 };
 
-const VALID_ROLES = new Set<Role>(['ADMIN', 'GESTOR', 'COACH', 'ATHLETE', 'SPECTATOR']);
+const VALID_ROLES = new Set<Role>(['ADMIN', 'GESTOR', 'COACH', 'ATHLETE', ""]);
 
 function isRole(value: string): value is Role {

[NoCoverage] BlockStatement
src/lib/auth.ts:16:47
 
 const VALID_ROLES = new Set<Role>(['ADMIN', 'GESTOR', 'COACH', 'ATHLETE', 'SPECTATOR']);
 
-function isRole(value: string): value is Role {
-  return VALID_ROLES.has(value as Role);
-}
+function isRole(value: string): value is Role {}
 
 async function extractUserFromHeaders(request: NextRequest): Promise<RLSUser | null> {

[NoCoverage] BlockStatement
src/lib/auth.ts:20:86
   return VALID_ROLES.has(value as Role);
 }
 
-async function extractUserFromHeaders(request: NextRequest): Promise<RLSUser | null> {
-  const id = request.headers.get('x-user-id');
-  const rawRole = request.headers.get('x-user-role');
-  if (!id || !rawRole || !isRole(rawRole)) return null;
-  return { id, role: rawRole };
-}
+async function extractUserFromHeaders(request: NextRequest): Promise<RLSUser | null> {}
 
 async function extractUserFromJwt(request: NextRequest): Promise<RLSUser | null> {

[NoCoverage] BooleanLiteral
src/lib/auth.ts:23:26
 async function extractUserFromHeaders(request: NextRequest): Promise<RLSUser | null> {
   const id = request.headers.get('x-user-id');
   const rawRole = request.headers.get('x-user-role');
-  if (!id || !rawRole || !isRole(rawRole)) return null;
+  if (!id || !rawRole || isRole(rawRole)) return null;
   return { id, role: rawRole };
 }

[NoCoverage] ConditionalExpression
src/lib/auth.ts:23:7
 async function extractUserFromHeaders(request: NextRequest): Promise<RLSUser | null> {
   const id = request.headers.get('x-user-id');
   const rawRole = request.headers.get('x-user-role');
-  if (!id || !rawRole || !isRole(rawRole)) return null;
+  if (false) return null;
   return { id, role: rawRole };
 }

[NoCoverage] BlockStatement
src/lib/auth.ts:27:82
   return { id, role: rawRole };
 }
 
-async function extractUserFromJwt(request: NextRequest): Promise<RLSUser | null> {
-  const authHeader = request.headers.get('authorization');
-  const token = authHeader?.startsWith('Bearer ') ? authHeader.slice(7) : null;
-  if (!token) return null;
-  const payload = await decodeJwtPayload(token);
-  if (!payload) return null;
-  if (!isRole(payload.role)) return null;
-  return { id: payload.sub, role: payload.role };
-}
+async function extractUserFromJwt(request: NextRequest): Promise<RLSUser | null> {}
 
 export async function getUserFromRequestScoped(

[NoCoverage] StringLiteral
src/lib/auth.ts:28:42
 }
 
 async function extractUserFromJwt(request: NextRequest): Promise<RLSUser | null> {
-  const authHeader = request.headers.get('authorization');
+  const authHeader = request.headers.get("");
   const token = authHeader?.startsWith('Bearer ') ? authHeader.slice(7) : null;
   if (!token) return null;

[NoCoverage] OptionalChaining
src/lib/auth.ts:29:17
 
 async function extractUserFromJwt(request: NextRequest): Promise<RLSUser | null> {
   const authHeader = request.headers.get('authorization');
-  const token = authHeader?.startsWith('Bearer ') ? authHeader.slice(7) : null;
+  const token = authHeader.startsWith('Bearer ') ? authHeader.slice(7) : null;
   if (!token) return null;
   const payload = await decodeJwtPayload(token);

[NoCoverage] MethodExpression
src/lib/auth.ts:29:53
 
 async function extractUserFromJwt(request: NextRequest): Promise<RLSUser | null> {
   const authHeader = request.headers.get('authorization');
-  const token = authHeader?.startsWith('Bearer ') ? authHeader.slice(7) : null;
+  const token = authHeader?.startsWith('Bearer ') ? authHeader : null;
   if (!token) return null;
   const payload = await decodeJwtPayload(token);

[NoCoverage] ConditionalExpression
src/lib/auth.ts:30:7
 async function extractUserFromJwt(request: NextRequest): Promise<RLSUser | null> {
   const authHeader = request.headers.get('authorization');
   const token = authHeader?.startsWith('Bearer ') ? authHeader.slice(7) : null;
-  if (!token) return null;
+  if (true) return null;
   const payload = await decodeJwtPayload(token);
   if (!payload) return null;

[NoCoverage] ConditionalExpression
src/lib/auth.ts:30:7
 async function extractUserFromJwt(request: NextRequest): Promise<RLSUser | null> {
   const authHeader = request.headers.get('authorization');
   const token = authHeader?.startsWith('Bearer ') ? authHeader.slice(7) : null;
-  if (!token) return null;
+  if (false) return null;
   const payload = await decodeJwtPayload(token);
   if (!payload) return null;

[NoCoverage] BooleanLiteral
src/lib/auth.ts:32:7
   const token = authHeader?.startsWith('Bearer ') ? authHeader.slice(7) : null;
   if (!token) return null;
   const payload = await decodeJwtPayload(token);
-  if (!payload) return null;
+  if (payload) return null;
   if (!isRole(payload.role)) return null;
   return { id: payload.sub, role: payload.role };

[NoCoverage] ConditionalExpression
src/lib/auth.ts:32:7
   const token = authHeader?.startsWith('Bearer ') ? authHeader.slice(7) : null;
   if (!token) return null;
   const payload = await decodeJwtPayload(token);
-  if (!payload) return null;
+  if (true) return null;
   if (!isRole(payload.role)) return null;
   return { id: payload.sub, role: payload.role };

[NoCoverage] ConditionalExpression
src/lib/auth.ts:33:7
   if (!token) return null;
   const payload = await decodeJwtPayload(token);
   if (!payload) return null;
-  if (!isRole(payload.role)) return null;
+  if (true) return null;
   return { id: payload.sub, role: payload.role };
 }

[NoCoverage] BooleanLiteral
src/lib/auth.ts:33:7
   if (!token) return null;
   const payload = await decodeJwtPayload(token);
   if (!payload) return null;
-  if (!isRole(payload.role)) return null;
+  if (isRole(payload.role)) return null;
   return { id: payload.sub, role: payload.role };
 }

[NoCoverage] ObjectLiteral
src/lib/auth.ts:34:10
   const payload = await decodeJwtPayload(token);
   if (!payload) return null;
   if (!isRole(payload.role)) return null;
-  return { id: payload.sub, role: payload.role };
+  return {};
 }
 

[NoCoverage] BlockStatement
src/lib/auth.ts:39:28
 
 export async function getUserFromRequestScoped(
   request: NextRequest,
-): Promise<RLSUser | null> {
-  const fromHeaders = await extractUserFromHeaders(request);
-  if (fromHeaders) return fromHeaders;
-  return extractUserFromJwt(request);
-}
+): Promise<RLSUser | null> {}
 
 export async function getUserFromRequest(request: NextRequest): Promise<RLSUser | null> {

[NoCoverage] ConditionalExpression
src/lib/auth.ts:41:7
   request: NextRequest,
 ): Promise<RLSUser | null> {
   const fromHeaders = await extractUserFromHeaders(request);
-  if (fromHeaders) return fromHeaders;
+  if (false) return fromHeaders;
   return extractUserFromJwt(request);
 }

[NoCoverage] ConditionalExpression
src/lib/auth.ts:41:7
   request: NextRequest,
 ): Promise<RLSUser | null> {
   const fromHeaders = await extractUserFromHeaders(request);
-  if (fromHeaders) return fromHeaders;
+  if (true) return fromHeaders;
   return extractUserFromJwt(request);
 }

[NoCoverage] BlockStatement
src/lib/auth.ts:45:89
   return extractUserFromJwt(request);
 }
 
-export async function getUserFromRequest(request: NextRequest): Promise<RLSUser | null> {
-  return getUserFromRequestScoped(request);
-}
+export async function getUserFromRequest(request: NextRequest): Promise<RLSUser | null> {}
 
 export async function requireRole(request: NextRequest, minRole: Role): Promise<NextResponse | null> {

[NoCoverage] BlockStatement
src/lib/auth.ts:49:102
   return getUserFromRequestScoped(request);
 }
 
-export async function requireRole(request: NextRequest, minRole: Role): Promise<NextResponse | null> {
-  const user = await getUserFromRequestScoped(request);
-  if (!user) {
-    return NextResponse.json(
-      { error: 'FORBIDDEN', message: 'Token de acesso requerido' },
-      { status: 401 },
-    );
-  }
-
-  if (!isRole(user.role) || ROLE_HIERARCHY[user.role] < ROLE_HIERARCHY[minRole]) {
-    return NextResponse.json(
-      {
-        error: 'FORBIDDEN',
-        message: `Requer role ${minRole} ou superior. Role atual: ${user.role}`,
-      },
-      { status: 403 },
-    );
-  }
-
-  return null;
-}
+export async function requireRole(request: NextRequest, minRole: Role): Promise<NextResponse | null> {}
 
 export async function withRLSHandler<T extends Response = NextResponse>(

[NoCoverage] ConditionalExpression
src/lib/auth.ts:51:7
 
 export async function requireRole(request: NextRequest, minRole: Role): Promise<NextResponse | null> {
   const user = await getUserFromRequestScoped(request);
-  if (!user) {
+  if (true) {
     return NextResponse.json(
       { error: 'FORBIDDEN', message: 'Token de acesso requerido' },

[NoCoverage] ConditionalExpression
src/lib/auth.ts:51:7
 
 export async function requireRole(request: NextRequest, minRole: Role): Promise<NextResponse | null> {
   const user = await getUserFromRequestScoped(request);
-  if (!user) {
+  if (false) {
     return NextResponse.json(
       { error: 'FORBIDDEN', message: 'Token de acesso requerido' },

[NoCoverage] ObjectLiteral
src/lib/auth.ts:53:7
   const user = await getUserFromRequestScoped(request);
   if (!user) {
     return NextResponse.json(
-      { error: 'FORBIDDEN', message: 'Token de acesso requerido' },
+      {},
       { status: 401 },
     );

[NoCoverage] ObjectLiteral
src/lib/auth.ts:54:7
   if (!user) {
     return NextResponse.json(
       { error: 'FORBIDDEN', message: 'Token de acesso requerido' },
-      { status: 401 },
+      {},
     );
   }

[NoCoverage] ConditionalExpression
src/lib/auth.ts:58:7
     );
   }
 
-  if (!isRole(user.role) || ROLE_HIERARCHY[user.role] < ROLE_HIERARCHY[minRole]) {
+  if (true) {
     return NextResponse.json(
       {

[NoCoverage] ConditionalExpression
src/lib/auth.ts:58:29
     );
   }
 
-  if (!isRole(user.role) || ROLE_HIERARCHY[user.role] < ROLE_HIERARCHY[minRole]) {
+  if (!isRole(user.role) || false) {
     return NextResponse.json(
       {

[NoCoverage] BlockStatement
src/lib/auth.ts:75:26
   request: NextRequest,
   minRole: Role,
   handler: () => Promise<T>,
-): Promise<Response | T> {
-  const roleCheck = await requireRole(request, minRole);
-  if (roleCheck) return roleCheck;
-
-  const user = (await getUserFromRequestScoped(request))!;
-  return runWithRLS(user, handler);
-}
+): Promise<Response | T> {}
 
 export { getRLSUser };

[NoCoverage] ConditionalExpression
src/lib/auth.ts:77:7
   handler: () => Promise<T>,
 ): Promise<Response | T> {
   const roleCheck = await requireRole(request, minRole);
-  if (roleCheck) return roleCheck;
+  if (false) return roleCheck;
 
   const user = (await getUserFromRequestScoped(request))!;

[NoCoverage] ConditionalExpression
src/lib/auth.ts:77:7
   handler: () => Promise<T>,
 ): Promise<Response | T> {
   const roleCheck = await requireRole(request, minRole);
-  if (roleCheck) return roleCheck;
+  if (true) return roleCheck;
 
   const user = (await getUserFromRequestScoped(request))!;
