[Killed] StringLiteral
src/core/scoring/scoring-logic.ts:3:27
 import type { ScoringState, HistoryEntry, TimelinePoint } from './types';
 
-const GAME_POINTS = ['0', '15', '30', '40'];
+const GAME_POINTS = ['0', "", '30', '40'];
 
 export function getGameScoreLabel(
killedBy: timeline-utils getGameScoreLabelForPoint deve formatar score regular
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "15x0"
Received: "x0"

[Survived] StringLiteral
src/core/scoring/scoring-logic.ts:3:33
 import type { ScoringState, HistoryEntry, TimelinePoint } from './types';
 
-const GAME_POINTS = ['0', '15', '30', '40'];
+const GAME_POINTS = ['0', '15', "", '40'];
 
 export function getGameScoreLabel(

[Killed] BlockStatement
src/core/scoring/scoring-logic.ts:8:11
 export function getGameScoreLabel(
   p1: number, p2: number,
   isDeuce?: boolean, advantage?: string | null, isTiebreak?: boolean,
-): string {
-  if (isTiebreak) return `${p1}x${p2}`;
-  if (isDeuce) {
-    if (advantage === 'player1') return 'ADx40';
-    if (advantage === 'player2') return '40xAD';
-    return '40x40';
-  }
-  return `${GAME_POINTS[p1] ?? p1}x${GAME_POINTS[p2] ?? p2}`;
-}
+): string {}
 
 export function isBreakPoint(state: ScoringState): boolean {
killedBy: timeline-utils getGameScoreLabelForPoint deve formatar score regular
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "15x0"
Received: undefined

[Killed] ConditionalExpression
src/core/scoring/scoring-logic.ts:9:7
   p1: number, p2: number,
   isDeuce?: boolean, advantage?: string | null, isTiebreak?: boolean,
 ): string {
-  if (isTiebreak) return `${p1}x${p2}`;
+  if (true) return `${p1}x${p2}`;
   if (isDeuce) {
     if (advantage === 'player1') return 'ADx40';
killedBy: timeline-utils getGameScoreLabelForPoint deve formatar score regular
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "15x0"
Received: "1x0"

[Killed] ConditionalExpression
src/core/scoring/scoring-logic.ts:9:7
   p1: number, p2: number,
   isDeuce?: boolean, advantage?: string | null, isTiebreak?: boolean,
 ): string {
-  if (isTiebreak) return `${p1}x${p2}`;
+  if (false) return `${p1}x${p2}`;
   if (isDeuce) {
     if (advantage === 'player1') return 'ADx40';
killedBy: timeline-utils getGameScoreLabelForPoint deve formatar tiebreak
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "5x3"
Received: "5x40"

[Killed] BlockStatement
src/core/scoring/scoring-logic.ts:10:16
   isDeuce?: boolean, advantage?: string | null, isTiebreak?: boolean,
 ): string {
   if (isTiebreak) return `${p1}x${p2}`;
-  if (isDeuce) {
-    if (advantage === 'player1') return 'ADx40';
-    if (advantage === 'player2') return '40xAD';
-    return '40x40';
-  }
+  if (isDeuce) {}
   return `${GAME_POINTS[p1] ?? p1}x${GAME_POINTS[p2] ?? p2}`;
 }
killedBy: timeline-utils getGameScoreLabelForPoint deve formatar AD para player1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ADx40"
Received: "40x40"

[Killed] ConditionalExpression
src/core/scoring/scoring-logic.ts:10:7
   isDeuce?: boolean, advantage?: string | null, isTiebreak?: boolean,
 ): string {
   if (isTiebreak) return `${p1}x${p2}`;
-  if (isDeuce) {
+  if (false) {
     if (advantage === 'player1') return 'ADx40';
     if (advantage === 'player2') return '40xAD';
killedBy: timeline-utils getGameScoreLabelForPoint deve formatar AD para player1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ADx40"
Received: "40x40"

[Killed] ConditionalExpression
src/core/scoring/scoring-logic.ts:11:9
 ): string {
   if (isTiebreak) return `${p1}x${p2}`;
   if (isDeuce) {
-    if (advantage === 'player1') return 'ADx40';
+    if (true) return 'ADx40';
     if (advantage === 'player2') return '40xAD';
     return '40x40';
killedBy: timeline-utils getGameScoreLabelForPoint deve formatar 40x40 em deuce
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "40x40"
Received: "ADx40"

[Killed] EqualityOperator
src/core/scoring/scoring-logic.ts:12:9
   if (isTiebreak) return `${p1}x${p2}`;
   if (isDeuce) {
     if (advantage === 'player1') return 'ADx40';
-    if (advantage === 'player2') return '40xAD';
+    if (advantage !== 'player2') return '40xAD';
     return '40x40';
   }
killedBy: timeline-utils getGameScoreLabelForPoint deve formatar 40x40 em deuce
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "40x40"
Received: "40xAD"

[Killed] BlockStatement
src/core/scoring/scoring-logic.ts:18:60
   return `${GAME_POINTS[p1] ?? p1}x${GAME_POINTS[p2] ?? p2}`;
 }
 
-export function isBreakPoint(state: ScoringState): boolean {
-  if (state.isFinished) return false;
-  const set = state.sets[state.sets.length - 1];
-  if (!set) return false;
-  const server = state.server;
-  const receiverGames = server === 'player1' ? set.player2 : set.player1;
-  const serverGames = server === 'player1' ? set.player1 : set.player2;
-  return receiverGames >= serverGames;
-}
+export function isBreakPoint(state: ScoringState): boolean {}
 
 export function isGameBall(state: ScoringState): boolean {
killedBy: timeline-utils enrichPointsFromHistory deve detectar break point quando receptor tem games iguais ou mais
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] BooleanLiteral
src/core/scoring/scoring-logic.ts:21:7
 export function isBreakPoint(state: ScoringState): boolean {
   if (state.isFinished) return false;
   const set = state.sets[state.sets.length - 1];
-  if (!set) return false;
+  if (set) return false;
   const server = state.server;
   const receiverGames = server === 'player1' ? set.player2 : set.player1;
killedBy: timeline-utils enrichPointsFromHistory deve calcular setNumber corretamente
statusReason: TypeError: Cannot read properties of undefined (reading 'player2')

[Killed] ConditionalExpression
src/core/scoring/scoring-logic.ts:21:7
 export function isBreakPoint(state: ScoringState): boolean {
   if (state.isFinished) return false;
   const set = state.sets[state.sets.length - 1];
-  if (!set) return false;
+  if (true) return false;
   const server = state.server;
   const receiverGames = server === 'player1' ? set.player2 : set.player1;
killedBy: timeline-utils enrichPointsFromHistory deve detectar break point quando receptor tem games iguais ou mais
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/core/scoring/scoring-logic.ts:23:25
   const set = state.sets[state.sets.length - 1];
   if (!set) return false;
   const server = state.server;
-  const receiverGames = server === 'player1' ? set.player2 : set.player1;
+  const receiverGames = server !== 'player1' ? set.player2 : set.player1;
   const serverGames = server === 'player1' ? set.player1 : set.player2;
   return receiverGames >= serverGames;
killedBy: timeline-utils enrichPointsFromHistory não deve marcar break point se servidor está vencendo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/core/scoring/scoring-logic.ts:23:25
   const set = state.sets[state.sets.length - 1];
   if (!set) return false;
   const server = state.server;
-  const receiverGames = server === 'player1' ? set.player2 : set.player1;
+  const receiverGames = false ? set.player2 : set.player1;
   const serverGames = server === 'player1' ? set.player1 : set.player2;
   return receiverGames >= serverGames;
killedBy: timeline-utils enrichPointsFromHistory não deve marcar break point se servidor está vencendo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/core/scoring/scoring-logic.ts:24:23
   if (!set) return false;
   const server = state.server;
   const receiverGames = server === 'player1' ? set.player2 : set.player1;
-  const serverGames = server === 'player1' ? set.player1 : set.player2;
+  const serverGames = server !== 'player1' ? set.player1 : set.player2;
   return receiverGames >= serverGames;
 }
killedBy: timeline-utils enrichPointsFromHistory não deve marcar break point se servidor está vencendo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/core/scoring/scoring-logic.ts:24:23
   if (!set) return false;
   const server = state.server;
   const receiverGames = server === 'player1' ? set.player2 : set.player1;
-  const serverGames = server === 'player1' ? set.player1 : set.player2;
+  const serverGames = false ? set.player1 : set.player2;
   return receiverGames >= serverGames;
 }
killedBy: timeline-utils enrichPointsFromHistory não deve marcar break point se servidor está vencendo
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/core/scoring/scoring-logic.ts:25:10
   const server = state.server;
   const receiverGames = server === 'player1' ? set.player2 : set.player1;
   const serverGames = server === 'player1' ? set.player1 : set.player2;
-  return receiverGames >= serverGames;
+  return receiverGames < serverGames;
 }
 
killedBy: timeline-utils enrichPointsFromHistory deve detectar break point quando receptor tem games iguais ou mais
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/core/scoring/scoring-logic.ts:25:10
   const server = state.server;
   const receiverGames = server === 'player1' ? set.player2 : set.player1;
   const serverGames = server === 'player1' ? set.player1 : set.player2;
-  return receiverGames >= serverGames;
+  return false;
 }
 
killedBy: timeline-utils enrichPointsFromHistory deve detectar break point quando receptor tem games iguais ou mais
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
src/core/scoring/scoring-logic.ts:31:7
 export function isGameBall(state: ScoringState): boolean {
   const game = state.currentGame;
   const set = state.sets[state.sets.length - 1];
-  if (set?.isTiebreak && set.tiebreakScore) {
+  if (set?.isTiebreak || set.tiebreakScore) {
     const p1 = set.tiebreakScore.player1;
     const p2 = set.tiebreakScore.player2;
killedBy: timeline-utils enrichPointsFromHistory deve calcular setNumber corretamente
statusReason: TypeError: Cannot read properties of undefined (reading 'tiebreakScore')

[Survived] EqualityOperator
src/core/scoring/scoring-logic.ts:34:43
   if (set?.isTiebreak && set.tiebreakScore) {
     const p1 = set.tiebreakScore.player1;
     const p2 = set.tiebreakScore.player2;
-    return (p1 >= 9 && p1 - p2 === 1) || (p2 >= 9 && p2 - p1 === 1);
+    return (p1 >= 9 && p1 - p2 === 1) || (p2 < 9 && p2 - p1 === 1);
   }
   if (game.isDeuce) return false;

[Survived] LogicalOperator
src/core/scoring/scoring-logic.ts:34:13
   if (set?.isTiebreak && set.tiebreakScore) {
     const p1 = set.tiebreakScore.player1;
     const p2 = set.tiebreakScore.player2;
-    return (p1 >= 9 && p1 - p2 === 1) || (p2 >= 9 && p2 - p1 === 1);
+    return (p1 >= 9 || p1 - p2 === 1) || (p2 >= 9 && p2 - p1 === 1);
   }
   if (game.isDeuce) return false;

[Survived] LogicalOperator
src/core/scoring/scoring-logic.ts:37:55
     return (p1 >= 9 && p1 - p2 === 1) || (p2 >= 9 && p2 - p1 === 1);
   }
   if (game.isDeuce) return false;
-  return (game.player1 >= 3 && game.player2 <= 2) || (game.player2 >= 3 && game.player1 <= 2);
+  return (game.player1 >= 3 && game.player2 <= 2) || (game.player2 >= 3 || game.player1 <= 2);
 }
 

[Killed] BooleanLiteral
src/core/scoring/scoring-logic.ts:42:7
 
 export function isSetBall(state: ScoringState, setNumber: number): boolean {
   const set = state.sets[setNumber - 1];
-  if (!set) return false;
+  if (set) return false;
   return (set.player1 >= 5 && set.player2 <= 4) || (set.player2 >= 5 && set.player1 <= 4);
 }
killedBy: timeline-utils enrichPointsFromHistory deve calcular setNumber corretamente
statusReason: TypeError: Cannot read properties of undefined (reading 'player1')

[Killed] ConditionalExpression
src/core/scoring/scoring-logic.ts:42:7
 
 export function isSetBall(state: ScoringState, setNumber: number): boolean {
   const set = state.sets[setNumber - 1];
-  if (!set) return false;
+  if (false) return false;
   return (set.player1 >= 5 && set.player2 <= 4) || (set.player2 >= 5 && set.player1 <= 4);
 }
killedBy: timeline-utils enrichPointsFromHistory deve calcular setNumber corretamente
statusReason: TypeError: Cannot read properties of undefined (reading 'player1')

[Survived] EqualityOperator
src/core/scoring/scoring-logic.ts:43:31
 export function isSetBall(state: ScoringState, setNumber: number): boolean {
   const set = state.sets[setNumber - 1];
   if (!set) return false;
-  return (set.player1 >= 5 && set.player2 <= 4) || (set.player2 >= 5 && set.player1 <= 4);
+  return (set.player1 >= 5 && set.player2 > 4) || (set.player2 >= 5 && set.player1 <= 4);
 }
 

[Survived] ConditionalExpression
src/core/scoring/scoring-logic.ts:43:11
 export function isSetBall(state: ScoringState, setNumber: number): boolean {
   const set = state.sets[setNumber - 1];
   if (!set) return false;
-  return (set.player1 >= 5 && set.player2 <= 4) || (set.player2 >= 5 && set.player1 <= 4);
+  return (true && set.player2 <= 4) || (set.player2 >= 5 && set.player1 <= 4);
 }
 

[Killed] UpdateOperator
src/core/scoring/scoring-logic.ts:53:39
 ): TimelinePoint[] {
   const points: TimelinePoint[] = [];
 
-  for (let i = 0; i < history.length; i++) {
+  for (let i = 0; i < history.length; i--) {
     const entry = history[i];
     const stateBefore = entry.stateBefore;
killedBy: timeline-utils enrichPointsFromHistory deve enriquecer pontos com informações de estado
statusReason: TypeError: Cannot read properties of undefined (reading 'stateBefore')

[Killed] ConditionalExpression
src/core/scoring/scoring-logic.ts:59:7
     const pt = entry.point;
 
     const winner: 'PLAYER_1' | 'PLAYER_2' =
-      pt.winnerId === player1Id ? 'PLAYER_1' : 'PLAYER_2';
+      true ? 'PLAYER_1' : 'PLAYER_2';
 
     const setNumber = stateBefore.sets.length > 0 ? stateBefore.sets.length : 1;
killedBy: timeline-utils enrichPointsFromHistory deve identificar corretamente PLAYER_2 como winner
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "PLAYER_2"
Received: "PLAYER_1"

[Killed] EqualityOperator
src/core/scoring/scoring-logic.ts:61:23
     const winner: 'PLAYER_1' | 'PLAYER_2' =
       pt.winnerId === player1Id ? 'PLAYER_1' : 'PLAYER_2';
 
-    const setNumber = stateBefore.sets.length > 0 ? stateBefore.sets.length : 1;
+    const setNumber = stateBefore.sets.length >= 0 ? stateBefore.sets.length : 1;
     const currentSet = stateBefore.sets[stateBefore.sets.length - 1];
     const gamesScore = {
killedBy: timeline-utils enrichPointsFromHistory deve calcular setNumber corretamente
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] LogicalOperator
src/core/scoring/scoring-logic.ts:77:27
     const gb = isGameBall(stateBefore);
     const sb = isSetBall(stateBefore, setNumber);
 
-    const isServeFinish = pt.type === 'ACE' || pt.type === 'DOUBLE_FAULT';
+    const isServeFinish = pt.type === 'ACE' && pt.type === 'DOUBLE_FAULT';
     const rallyLength = pt.rallyLength ?? (isServeFinish ? 1 : 0);
     const isTiebreak = currentSet?.isTiebreak ?? false;
killedBy: timeline-utils enrichPointsFromHistory deve definir rallyLength para 1 em ACE ou DOUBLE_FAULT
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] LogicalOperator
src/core/scoring/scoring-logic.ts:78:25
     const sb = isSetBall(stateBefore, setNumber);
 
     const isServeFinish = pt.type === 'ACE' || pt.type === 'DOUBLE_FAULT';
-    const rallyLength = pt.rallyLength ?? (isServeFinish ? 1 : 0);
+    const rallyLength = pt.rallyLength && (isServeFinish ? 1 : 0);
     const isTiebreak = currentSet?.isTiebreak ?? false;
 
killedBy: timeline-utils enrichPointsFromHistory deve definir rallyLength para 1 em ACE ou DOUBLE_FAULT
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] LogicalOperator
src/core/scoring/scoring-logic.ts:79:24
 
     const isServeFinish = pt.type === 'ACE' || pt.type === 'DOUBLE_FAULT';
     const rallyLength = pt.rallyLength ?? (isServeFinish ? 1 : 0);
-    const isTiebreak = currentSet?.isTiebreak ?? false;
+    const isTiebreak = currentSet?.isTiebreak && false;
 
     const firstFault = pt.type === 'DOUBLE_FAULT' && pt.firstFaultDetail
killedBy: timeline-utils enrichPointsFromHistory deve marcar isTiebreak corretamente
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] OptionalChaining
src/core/scoring/scoring-logic.ts:79:24
 
     const isServeFinish = pt.type === 'ACE' || pt.type === 'DOUBLE_FAULT';
     const rallyLength = pt.rallyLength ?? (isServeFinish ? 1 : 0);
-    const isTiebreak = currentSet?.isTiebreak ?? false;
+    const isTiebreak = currentSet.isTiebreak ?? false;
 
     const firstFault = pt.type === 'DOUBLE_FAULT' && pt.firstFaultDetail
killedBy: timeline-utils enrichPointsFromHistory deve calcular setNumber corretamente
statusReason: TypeError: Cannot read properties of undefined (reading 'isTiebreak')

[Killed] ConditionalExpression
src/core/scoring/scoring-logic.ts:81:24
     const rallyLength = pt.rallyLength ?? (isServeFinish ? 1 : 0);
     const isTiebreak = currentSet?.isTiebreak ?? false;
 
-    const firstFault = pt.type === 'DOUBLE_FAULT' && pt.firstFaultDetail
+    const firstFault = false
       ? pt.firstFaultDetail
       : undefined;
killedBy: timeline-utils enrichPointsFromHistory deve propagar firstFaultDetail em DOUBLE_FAULT
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"direction": "CRUZADO", "errorType": "REDE", "serveEffect": "FATIO"}
Received: undefined

[Killed] EqualityOperator
src/core/scoring/scoring-logic.ts:81:24
     const rallyLength = pt.rallyLength ?? (isServeFinish ? 1 : 0);
     const isTiebreak = currentSet?.isTiebreak ?? false;
 
-    const firstFault = pt.type === 'DOUBLE_FAULT' && pt.firstFaultDetail
+    const firstFault = pt.type !== 'DOUBLE_FAULT' && pt.firstFaultDetail
       ? pt.firstFaultDetail
       : undefined;
killedBy: timeline-utils enrichPointsFromHistory deve propagar firstFaultDetail em DOUBLE_FAULT
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"direction": "CRUZADO", "errorType": "REDE", "serveEffect": "FATIO"}
Received: undefined
