[Killed] ConditionalExpression
src/core/scoring/engine.ts:31:26
       throw new Error('MATCH_ALREADY_FINISHED');
     }
 
-    const isFaultFirst = flow.type === 'FAULT_FIRST' || flow.firstFault;
+    const isFaultFirst = false;
 
     const winner: 'player1' | 'player2' | null =
killedBy: ScoringEngine — Characterization Tests applyPoint — validation accepts FAULT_FIRST without winner validation
statusReason: Error: INVALID_WINNER

[Killed] ConditionalExpression
src/core/scoring/engine.ts:61:9
       firstFaultDetail: flow.firstFaultDetail ?? null,
     };
 
-    if (flow.type === 'DOUBLE_FAULT') {
+    if (true) {
       const newState = this.handleDoubleFault(winner!, details);
       this.state = newState;
killedBy: ScoringEngine — Characterization Tests applyPoint — validation accepts FAULT_FIRST without winner validation
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/core/scoring/engine.ts:167:9
     let state: ScoringState;
     let history: HistoryEntry[] = [];
     const parsed = JSON.parse(serialized);
-    if (parsed.state && Array.isArray(parsed.history)) {
+    if (true) {
       state = parsed.state as ScoringState;
       history = parsed.history as HistoryEntry[];
killedBy: ScoringEngine — Characterization Tests fromSerialized handles old format without history array
statusReason: TypeError: Cannot read properties of undefined (reading 'length')
