[NoCoverage] ArrayDeclaration
src/core/scoring/engine.ts:15:37
 export class ScoringEngine {
   private state: ScoringState;
   private config: ScoringEngineConfig;
-  private history: HistoryEntry[] = [];
+  private history: HistoryEntry[] = ["Stryker was here"];
 
   constructor(config: ScoringEngineConfig, initialState?: ScoringState) {

[NoCoverage] BlockStatement
src/core/scoring/engine.ts:17:73
   private config: ScoringEngineConfig;
   private history: HistoryEntry[] = [];
 
-  constructor(config: ScoringEngineConfig, initialState?: ScoringState) {
-    this.config = config;
-    this.state = initialState ?? createInitialState(config);
-  }
+  constructor(config: ScoringEngineConfig, initialState?: ScoringState) {}
 
   setStartedAt(time: number): void {

[NoCoverage] LogicalOperator
src/core/scoring/engine.ts:19:18
 
   constructor(config: ScoringEngineConfig, initialState?: ScoringState) {
     this.config = config;
-    this.state = initialState ?? createInitialState(config);
+    this.state = initialState && createInitialState(config);
   }
 

[NoCoverage] BlockStatement
src/core/scoring/engine.ts:22:36
     this.state = initialState ?? createInitialState(config);
   }
 
-  setStartedAt(time: number): void {
-    this.state.startedAt = time;
-  }
+  setStartedAt(time: number): void {}
 
   applyPoint(flow: PointFlow): ScoringState {

[NoCoverage] ConditionalExpression
src/core/scoring/engine.ts:27:9
   }
 
   applyPoint(flow: PointFlow): ScoringState {
-    if (this.state.isFinished) {
+    if (true) {
       throw new Error('MATCH_ALREADY_FINISHED');
     }

[NoCoverage] ConditionalExpression
src/core/scoring/engine.ts:27:9
   }
 
   applyPoint(flow: PointFlow): ScoringState {
-    if (this.state.isFinished) {
+    if (false) {
       throw new Error('MATCH_ALREADY_FINISHED');
     }

[NoCoverage] LogicalOperator
src/core/scoring/engine.ts:31:26
       throw new Error('MATCH_ALREADY_FINISHED');
     }
 
-    const isFaultFirst = flow.type === 'FAULT_FIRST' || flow.firstFault;
+    const isFaultFirst = flow.type === 'FAULT_FIRST' && flow.firstFault;
 
     const winner: 'player1' | 'player2' | null =

[NoCoverage] ConditionalExpression
src/core/scoring/engine.ts:31:26
       throw new Error('MATCH_ALREADY_FINISHED');
     }
 
-    const isFaultFirst = flow.type === 'FAULT_FIRST' || flow.firstFault;
+    const isFaultFirst = true;
 
     const winner: 'player1' | 'player2' | null =

[NoCoverage] EqualityOperator
src/core/scoring/engine.ts:35:8
 
     const winner: 'player1' | 'player2' | null =
       isFaultFirst ? null :
-      (flow.winnerId === this.config.player1Id ? 'player1' :
+      (flow.winnerId !== this.config.player1Id ? 'player1' :
        flow.winnerId === this.config.player2Id ? 'player2' : null);
 

[NoCoverage] ConditionalExpression
src/core/scoring/engine.ts:35:8
 
     const winner: 'player1' | 'player2' | null =
       isFaultFirst ? null :
-      (flow.winnerId === this.config.player1Id ? 'player1' :
+      (true ? 'player1' :
        flow.winnerId === this.config.player2Id ? 'player2' : null);
 

[NoCoverage] EqualityOperator
src/core/scoring/engine.ts:36:8
     const winner: 'player1' | 'player2' | null =
       isFaultFirst ? null :
       (flow.winnerId === this.config.player1Id ? 'player1' :
-       flow.winnerId === this.config.player2Id ? 'player2' : null);
+       flow.winnerId !== this.config.player2Id ? 'player2' : null);
 
     if (!isFaultFirst && winner === null) {

[NoCoverage] ConditionalExpression
src/core/scoring/engine.ts:36:8
     const winner: 'player1' | 'player2' | null =
       isFaultFirst ? null :
       (flow.winnerId === this.config.player1Id ? 'player1' :
-       flow.winnerId === this.config.player2Id ? 'player2' : null);
+       false ? 'player2' : null);
 
     if (!isFaultFirst && winner === null) {

[NoCoverage] BlockStatement
src/core/scoring/engine.ts:38:43
       (flow.winnerId === this.config.player1Id ? 'player1' :
        flow.winnerId === this.config.player2Id ? 'player2' : null);
 
-    if (!isFaultFirst && winner === null) {
-      logger.error('[ScoringEngine] applyPoint: invalid winnerId', {
-        winnerId: flow.winnerId,
-        player1Id: this.config.player1Id,
-        player2Id: this.config.player2Id,
-        type: flow.type,
-      });
-      throw new Error('INVALID_WINNER');
-    }
+    if (!isFaultFirst && winner === null) {}
 
     const details: PointDetails = {

[NoCoverage] ConditionalExpression
src/core/scoring/engine.ts:38:9
       (flow.winnerId === this.config.player1Id ? 'player1' :
        flow.winnerId === this.config.player2Id ? 'player2' : null);
 
-    if (!isFaultFirst && winner === null) {
+    if (false) {
       logger.error('[ScoringEngine] applyPoint: invalid winnerId', {
         winnerId: flow.winnerId,

[NoCoverage] ObjectLiteral
src/core/scoring/engine.ts:39:68
        flow.winnerId === this.config.player2Id ? 'player2' : null);
 
     if (!isFaultFirst && winner === null) {
-      logger.error('[ScoringEngine] applyPoint: invalid winnerId', {
-        winnerId: flow.winnerId,
-        player1Id: this.config.player1Id,
-        player2Id: this.config.player2Id,
-        type: flow.type,
-      });
+      logger.error('[ScoringEngine] applyPoint: invalid winnerId', {});
       throw new Error('INVALID_WINNER');
     }

[NoCoverage] ObjectLiteral
src/core/scoring/engine.ts:48:35
       throw new Error('INVALID_WINNER');
     }
 
-    const details: PointDetails = {
-      winnerId: flow.winnerId,
-      type: (flow.type as PointDetails['type']) || 'WINNER',
-      isFirstServe: flow.isFirstServe ?? true,
-      isSecondServe: flow.isSecondServe ?? false,
-      isLet: false,
-      serverId: flow.serverId,
-      timestamp: flow.timestamp ?? Date.now(),
-      rallyDetails: flow.rallyDetails ?? null,
-      rallyLength: flow.rallyLength ?? 0,
-      firstFaultDetail: flow.firstFaultDetail ?? null,
-    };
+    const details: PointDetails = {};
 
     if (flow.type === 'DOUBLE_FAULT') {

[NoCoverage] ConditionalExpression
src/core/scoring/engine.ts:50:13
 
     const details: PointDetails = {
       winnerId: flow.winnerId,
-      type: (flow.type as PointDetails['type']) || 'WINNER',
+      type: false,
       isFirstServe: flow.isFirstServe ?? true,
       isSecondServe: flow.isSecondServe ?? false,

[NoCoverage] ConditionalExpression
src/core/scoring/engine.ts:50:13
 
     const details: PointDetails = {
       winnerId: flow.winnerId,
-      type: (flow.type as PointDetails['type']) || 'WINNER',
+      type: true,
       isFirstServe: flow.isFirstServe ?? true,
       isSecondServe: flow.isSecondServe ?? false,

[NoCoverage] LogicalOperator
src/core/scoring/engine.ts:51:21
     const details: PointDetails = {
       winnerId: flow.winnerId,
       type: (flow.type as PointDetails['type']) || 'WINNER',
-      isFirstServe: flow.isFirstServe ?? true,
+      isFirstServe: flow.isFirstServe && true,
       isSecondServe: flow.isSecondServe ?? false,
       isLet: false,

[NoCoverage] BooleanLiteral
src/core/scoring/engine.ts:51:42
     const details: PointDetails = {
       winnerId: flow.winnerId,
       type: (flow.type as PointDetails['type']) || 'WINNER',
-      isFirstServe: flow.isFirstServe ?? true,
+      isFirstServe: flow.isFirstServe ?? false,
       isSecondServe: flow.isSecondServe ?? false,
       isLet: false,

[NoCoverage] BooleanLiteral
src/core/scoring/engine.ts:52:44
       winnerId: flow.winnerId,
       type: (flow.type as PointDetails['type']) || 'WINNER',
       isFirstServe: flow.isFirstServe ?? true,
-      isSecondServe: flow.isSecondServe ?? false,
+      isSecondServe: flow.isSecondServe ?? true,
       isLet: false,
       serverId: flow.serverId,

[NoCoverage] LogicalOperator
src/core/scoring/engine.ts:52:22
       winnerId: flow.winnerId,
       type: (flow.type as PointDetails['type']) || 'WINNER',
       isFirstServe: flow.isFirstServe ?? true,
-      isSecondServe: flow.isSecondServe ?? false,
+      isSecondServe: flow.isSecondServe && false,
       isLet: false,
       serverId: flow.serverId,

[NoCoverage] BooleanLiteral
src/core/scoring/engine.ts:53:14
       type: (flow.type as PointDetails['type']) || 'WINNER',
       isFirstServe: flow.isFirstServe ?? true,
       isSecondServe: flow.isSecondServe ?? false,
-      isLet: false,
+      isLet: true,
       serverId: flow.serverId,
       timestamp: flow.timestamp ?? Date.now(),

[NoCoverage] LogicalOperator
src/core/scoring/engine.ts:55:18
       isSecondServe: flow.isSecondServe ?? false,
       isLet: false,
       serverId: flow.serverId,
-      timestamp: flow.timestamp ?? Date.now(),
+      timestamp: flow.timestamp && Date.now(),
       rallyDetails: flow.rallyDetails ?? null,
       rallyLength: flow.rallyLength ?? 0,

[NoCoverage] LogicalOperator
src/core/scoring/engine.ts:56:21
       isLet: false,
       serverId: flow.serverId,
       timestamp: flow.timestamp ?? Date.now(),
-      rallyDetails: flow.rallyDetails ?? null,
+      rallyDetails: flow.rallyDetails && null,
       rallyLength: flow.rallyLength ?? 0,
       firstFaultDetail: flow.firstFaultDetail ?? null,

[NoCoverage] LogicalOperator
src/core/scoring/engine.ts:57:20
       serverId: flow.serverId,
       timestamp: flow.timestamp ?? Date.now(),
       rallyDetails: flow.rallyDetails ?? null,
-      rallyLength: flow.rallyLength ?? 0,
+      rallyLength: flow.rallyLength && 0,
       firstFaultDetail: flow.firstFaultDetail ?? null,
     };

[NoCoverage] LogicalOperator
src/core/scoring/engine.ts:58:25
       timestamp: flow.timestamp ?? Date.now(),
       rallyDetails: flow.rallyDetails ?? null,
       rallyLength: flow.rallyLength ?? 0,
-      firstFaultDetail: flow.firstFaultDetail ?? null,
+      firstFaultDetail: flow.firstFaultDetail && null,
     };
 

[NoCoverage] ConditionalExpression
src/core/scoring/engine.ts:61:9
       firstFaultDetail: flow.firstFaultDetail ?? null,
     };
 
-    if (flow.type === 'DOUBLE_FAULT') {
+    if (false) {
       const newState = this.handleDoubleFault(winner!, details);
       this.state = newState;

[NoCoverage] EqualityOperator
src/core/scoring/engine.ts:61:9
       firstFaultDetail: flow.firstFaultDetail ?? null,
     };
 
-    if (flow.type === 'DOUBLE_FAULT') {
+    if (flow.type !== 'DOUBLE_FAULT') {
       const newState = this.handleDoubleFault(winner!, details);
       this.state = newState;

[NoCoverage] BlockStatement
src/core/scoring/engine.ts:67:23
       return getState(this.state);
     }
 
-    if (isFaultFirst) {
-      return this.handleFirstServeFault(winner ?? this.state.server, details);
-    }
+    if (isFaultFirst) {}
 
     saveToHistory(this.history, this.state, details);

[NoCoverage] ConditionalExpression
src/core/scoring/engine.ts:67:9
       return getState(this.state);
     }
 
-    if (isFaultFirst) {
+    if (true) {
       return this.handleFirstServeFault(winner ?? this.state.server, details);
     }

[NoCoverage] LogicalOperator
src/core/scoring/engine.ts:68:41
     }
 
     if (isFaultFirst) {
-      return this.handleFirstServeFault(winner ?? this.state.server, details);
+      return this.handleFirstServeFault(winner && this.state.server, details);
     }
 

[NoCoverage] BlockStatement
src/core/scoring/engine.ts:78:102
     return getState(this.state);
   }
 
-  private handleFirstServeFault(_winner: 'player1' | 'player2', details: PointDetails): ScoringState {
-    saveToHistory(this.history, this.state, details);
-    this.state.currentGame.secondServe = true;
-    this.state.secondServe = true;
-    return getState(this.state);
-  }
+  private handleFirstServeFault(_winner: 'player1' | 'player2', details: PointDetails): ScoringState {}
 
   private handleDoubleFault(winner: 'player1' | 'player2', details: PointDetails): ScoringState {

[NoCoverage] BooleanLiteral
src/core/scoring/engine.ts:80:42
 
   private handleFirstServeFault(_winner: 'player1' | 'player2', details: PointDetails): ScoringState {
     saveToHistory(this.history, this.state, details);
-    this.state.currentGame.secondServe = true;
+    this.state.currentGame.secondServe = false;
     this.state.secondServe = true;
     return getState(this.state);

[NoCoverage] BooleanLiteral
src/core/scoring/engine.ts:81:30
   private handleFirstServeFault(_winner: 'player1' | 'player2', details: PointDetails): ScoringState {
     saveToHistory(this.history, this.state, details);
     this.state.currentGame.secondServe = true;
-    this.state.secondServe = true;
+    this.state.secondServe = false;
     return getState(this.state);
   }

[NoCoverage] BlockStatement
src/core/scoring/engine.ts:85:97
     return getState(this.state);
   }
 
-  private handleDoubleFault(winner: 'player1' | 'player2', details: PointDetails): ScoringState {
-    saveToHistory(this.history, this.state, details);
-    this.state.secondServe = false;
-    this.state.currentGame.secondServe = false;
-    return this.processPoint(winner);
-  }
+  private handleDoubleFault(winner: 'player1' | 'player2', details: PointDetails): ScoringState {}
 
   private processPoint(winner: 'player1' | 'player2'): ScoringState {

[NoCoverage] BooleanLiteral
src/core/scoring/engine.ts:87:30
 
   private handleDoubleFault(winner: 'player1' | 'player2', details: PointDetails): ScoringState {
     saveToHistory(this.history, this.state, details);
-    this.state.secondServe = false;
+    this.state.secondServe = true;
     this.state.currentGame.secondServe = false;
     return this.processPoint(winner);

[NoCoverage] BooleanLiteral
src/core/scoring/engine.ts:88:42
   private handleDoubleFault(winner: 'player1' | 'player2', details: PointDetails): ScoringState {
     saveToHistory(this.history, this.state, details);
     this.state.secondServe = false;
-    this.state.currentGame.secondServe = false;
+    this.state.currentGame.secondServe = true;
     return this.processPoint(winner);
   }

[NoCoverage] BlockStatement
src/core/scoring/engine.ts:92:69
     return this.processPoint(winner);
   }
 
-  private processPoint(winner: 'player1' | 'player2'): ScoringState {
-    this.state.secondServe = false;
-    this.state.currentGame.secondServe = false;
-
-    if (isMatchTiebreakActive(this.state, this.config)) {
-      return processMatchTiebreakFlow(winner, this.state);
-    }
-
-    const currentSet = this.state.sets[this.state.sets.length - 1];
-    if (currentSet?.isTiebreak) {
-      return processTiebreakPointHandler(this.state, winner, this.config);
-    }
-
-    return processRegularPointFlow(winner, this.state, this.config);
-  }
+  private processPoint(winner: 'player1' | 'player2'): ScoringState {}
 
   undoLastPoint(): PointDetails | null {

[NoCoverage] BooleanLiteral
src/core/scoring/engine.ts:93:30
   }
 
   private processPoint(winner: 'player1' | 'player2'): ScoringState {
-    this.state.secondServe = false;
+    this.state.secondServe = true;
     this.state.currentGame.secondServe = false;
 

[NoCoverage] ConditionalExpression
src/core/scoring/engine.ts:96:9
     this.state.secondServe = false;
     this.state.currentGame.secondServe = false;
 
-    if (isMatchTiebreakActive(this.state, this.config)) {
+    if (true) {
       return processMatchTiebreakFlow(winner, this.state);
     }

[NoCoverage] BlockStatement
src/core/scoring/engine.ts:96:57
     this.state.secondServe = false;
     this.state.currentGame.secondServe = false;
 
-    if (isMatchTiebreakActive(this.state, this.config)) {
-      return processMatchTiebreakFlow(winner, this.state);
-    }
+    if (isMatchTiebreakActive(this.state, this.config)) {}
 
     const currentSet = this.state.sets[this.state.sets.length - 1];

[NoCoverage] ArithmeticOperator
src/core/scoring/engine.ts:100:40
       return processMatchTiebreakFlow(winner, this.state);
     }
 
-    const currentSet = this.state.sets[this.state.sets.length - 1];
+    const currentSet = this.state.sets[this.state.sets.length + 1];
     if (currentSet?.isTiebreak) {
       return processTiebreakPointHandler(this.state, winner, this.config);

[NoCoverage] OptionalChaining
src/core/scoring/engine.ts:101:9
     }
 
     const currentSet = this.state.sets[this.state.sets.length - 1];
-    if (currentSet?.isTiebreak) {
+    if (currentSet.isTiebreak) {
       return processTiebreakPointHandler(this.state, winner, this.config);
     }

[NoCoverage] BlockStatement
src/core/scoring/engine.ts:101:33
     }
 
     const currentSet = this.state.sets[this.state.sets.length - 1];
-    if (currentSet?.isTiebreak) {
-      return processTiebreakPointHandler(this.state, winner, this.config);
-    }
+    if (currentSet?.isTiebreak) {}
 
     return processRegularPointFlow(winner, this.state, this.config);

[NoCoverage] BlockStatement
src/core/scoring/engine.ts:108:40
     return processRegularPointFlow(winner, this.state, this.config);
   }
 
-  undoLastPoint(): PointDetails | null {
-    return undoHistory(this.history, (newState) => { this.state = newState; });
-  }
+  undoLastPoint(): PointDetails | null {}
 
   replayCurrentPoint(): void {

[NoCoverage] BlockStatement
src/core/scoring/engine.ts:109:52
   }
 
   undoLastPoint(): PointDetails | null {
-    return undoHistory(this.history, (newState) => { this.state = newState; });
+    return undoHistory(this.history, (newState) => {});
   }
 

[NoCoverage] BlockStatement
src/core/scoring/engine.ts:112:30
     return undoHistory(this.history, (newState) => { this.state = newState; });
   }
 
-  replayCurrentPoint(): void {
-    replayHistory(this.history, (newState) => { this.state = newState; });
-  }
+  replayCurrentPoint(): void {}
 
   getHistoryLength(): number {

[NoCoverage] BlockStatement
src/core/scoring/engine.ts:113:47
   }
 
   replayCurrentPoint(): void {
-    replayHistory(this.history, (newState) => { this.state = newState; });
+    replayHistory(this.history, (newState) => {});
   }
 

[NoCoverage] BlockStatement
src/core/scoring/engine.ts:116:30
     replayHistory(this.history, (newState) => { this.state = newState; });
   }
 
-  getHistoryLength(): number {
-    return getHistoryLength(this.history);
-  }
+  getHistoryLength(): number {}
 
   getState(): Readonly<ScoringState> {

[NoCoverage] BlockStatement
src/core/scoring/engine.ts:120:38
     return getHistoryLength(this.history);
   }
 
-  getState(): Readonly<ScoringState> {
-    return getState(this.state);
-  }
+  getState(): Readonly<ScoringState> {}
 
   isFinished(): boolean {

[NoCoverage] BlockStatement
src/core/scoring/engine.ts:124:25
     return getState(this.state);
   }
 
-  isFinished(): boolean {
-    return this.state.isFinished;
-  }
+  isFinished(): boolean {}
 
   getWinner(): 'player1' | 'player2' | null {

[NoCoverage] BlockStatement
src/core/scoring/engine.ts:128:45
     return this.state.isFinished;
   }
 
-  getWinner(): 'player1' | 'player2' | null {
-    return this.state.winner;
-  }
+  getWinner(): 'player1' | 'player2' | null {}
 
   getServer(): 'player1' | 'player2' {

[NoCoverage] BlockStatement
src/core/scoring/engine.ts:132:38
     return this.state.winner;
   }
 
-  getServer(): 'player1' | 'player2' {
-    return this.state.server;
-  }
+  getServer(): 'player1' | 'player2' {}
 
   getPointHistory(): HistoryEntry[] {

[NoCoverage] BlockStatement
src/core/scoring/engine.ts:136:37
     return this.state.server;
   }
 
-  getPointHistory(): HistoryEntry[] {
-    return getPointHistory(this.history);
-  }
+  getPointHistory(): HistoryEntry[] {}
 
   restorePointHistory(history: HistoryEntry[]): void {

[NoCoverage] BlockStatement
src/core/scoring/engine.ts:140:54
     return getPointHistory(this.history);
   }
 
-  restorePointHistory(history: HistoryEntry[]): void {
-    restorePointHistory(this.history, history);
-  }
+  restorePointHistory(history: HistoryEntry[]): void {}
 
   reconcileWithCanonicalState(canonicalState: ScoringState, canonicalVersion: number): void {

[NoCoverage] BlockStatement
src/core/scoring/engine.ts:144:93
     restorePointHistory(this.history, history);
   }
 
-  reconcileWithCanonicalState(canonicalState: ScoringState, canonicalVersion: number): void {
-    const result = reconcileWithCanonicalState(this.state, this.history, canonicalState, canonicalVersion);
-    this.state = result.state;
-    this.history = result.history;
-  }
+  reconcileWithCanonicalState(canonicalState: ScoringState, canonicalVersion: number): void {}
 
   loadState(newState: ScoringState): void {

[NoCoverage] BlockStatement
src/core/scoring/engine.ts:150:43
     this.history = result.history;
   }
 
-  loadState(newState: ScoringState): void {
-    this.state = JSON.parse(JSON.stringify(newState));
-    this.history = [];
-  }
+  loadState(newState: ScoringState): void {}
 
   clearHistory(): void {

[NoCoverage] ArrayDeclaration
src/core/scoring/engine.ts:152:20
 
   loadState(newState: ScoringState): void {
     this.state = JSON.parse(JSON.stringify(newState));
-    this.history = [];
+    this.history = ["Stryker was here"];
   }
 

[NoCoverage] BlockStatement
src/core/scoring/engine.ts:155:24
     this.history = [];
   }
 
-  clearHistory(): void {
-    clearHistory(this.history);
-  }
+  clearHistory(): void {}
 
   serialize(): string {

[NoCoverage] BlockStatement
src/core/scoring/engine.ts:159:23
     clearHistory(this.history);
   }
 
-  serialize(): string {
-    return serialize(this.state, this.history);
-  }
+  serialize(): string {}
 
   static fromSerialized(config: ScoringEngineConfig, serialized: string): ScoringEngine {

[NoCoverage] BlockStatement
src/core/scoring/engine.ts:163:89
     return serialize(this.state, this.history);
   }
 
-  static fromSerialized(config: ScoringEngineConfig, serialized: string): ScoringEngine {
-    let state: ScoringState;
-    let history: HistoryEntry[] = [];
-    const parsed = JSON.parse(serialized);
-    if (parsed.state && Array.isArray(parsed.history)) {
-      state = parsed.state as ScoringState;
-      history = parsed.history as HistoryEntry[];
-    } else {
-      state = parsed as ScoringState;
-    }
-    const engine = new ScoringEngine(config, state);
-    if (history.length > 0) {
-      engine.restorePointHistory(history);
-    }
-    return engine;
-  }
+  static fromSerialized(config: ScoringEngineConfig, serialized: string): ScoringEngine {}
 }

[NoCoverage] ConditionalExpression
src/core/scoring/engine.ts:167:9
     let state: ScoringState;
     let history: HistoryEntry[] = [];
     const parsed = JSON.parse(serialized);
-    if (parsed.state && Array.isArray(parsed.history)) {
+    if (false) {
       state = parsed.state as ScoringState;
       history = parsed.history as HistoryEntry[];

[NoCoverage] LogicalOperator
src/core/scoring/engine.ts:167:9
     let state: ScoringState;
     let history: HistoryEntry[] = [];
     const parsed = JSON.parse(serialized);
-    if (parsed.state && Array.isArray(parsed.history)) {
+    if (parsed.state || Array.isArray(parsed.history)) {
       state = parsed.state as ScoringState;
       history = parsed.history as HistoryEntry[];

[NoCoverage] BlockStatement
src/core/scoring/engine.ts:170:12
     if (parsed.state && Array.isArray(parsed.history)) {
       state = parsed.state as ScoringState;
       history = parsed.history as HistoryEntry[];
-    } else {
-      state = parsed as ScoringState;
-    }
+    } else {}
     const engine = new ScoringEngine(config, state);
     if (history.length > 0) {

[NoCoverage] ConditionalExpression
src/core/scoring/engine.ts:174:9
       state = parsed as ScoringState;
     }
     const engine = new ScoringEngine(config, state);
-    if (history.length > 0) {
+    if (false) {
       engine.restorePointHistory(history);
     }

[NoCoverage] EqualityOperator
src/core/scoring/engine.ts:174:9
       state = parsed as ScoringState;
     }
     const engine = new ScoringEngine(config, state);
-    if (history.length > 0) {
+    if (history.length <= 0) {
       engine.restorePointHistory(history);
     }
