[Killed] BlockStatement
src/core/scoring/scoring-logic.ts:7:11
 export function getGameScoreLabel(
   p1: number, p2: number,
   isDeuce?: boolean, advantage?: string | null, isTiebreak?: boolean,
-): string {
-  if (isTiebreak || p1 >= 4 || p2 >= 4) return `${p1}x${p2}`;
-  if (isDeuce) {
-    if (advantage === 'player1') return 'ADx40';
-    if (advantage === 'player2') return '40xAD';
-    return '40x40';
-  }
-  return `${GAME_POINTS[p1] ?? p1}x${GAME_POINTS[p2] ?? p2}`;
-}
+): string {}
 
 export function isBreakPoint(state: ScoringState): boolean {
killedBy: scoring-logic — Characterization Tests getGameScoreLabel returns ADx40 when advantage is player1 at deuce
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ADx40"
Received: undefined

[Killed] LogicalOperator
src/core/scoring/scoring-logic.ts:8:7
   p1: number, p2: number,
   isDeuce?: boolean, advantage?: string | null, isTiebreak?: boolean,
 ): string {
-  if (isTiebreak || p1 >= 4 || p2 >= 4) return `${p1}x${p2}`;
+  if ((isTiebreak || p1 >= 4) && p2 >= 4) return `${p1}x${p2}`;
   if (isDeuce) {
     if (advantage === 'player1') return 'ADx40';
killedBy: scoring-logic — Characterization Tests getGameScoreLabel returns numeric score when points >= 4 (non-deuce)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "4x0"
Received: "ADx0"

[Killed] LogicalOperator
src/core/scoring/scoring-logic.ts:8:7
   p1: number, p2: number,
   isDeuce?: boolean, advantage?: string | null, isTiebreak?: boolean,
 ): string {
-  if (isTiebreak || p1 >= 4 || p2 >= 4) return `${p1}x${p2}`;
+  if (isTiebreak && p1 >= 4 || p2 >= 4) return `${p1}x${p2}`;
   if (isDeuce) {
     if (advantage === 'player1') return 'ADx40';
killedBy: scoring-logic — Characterization Tests getGameScoreLabel returns numeric score when points >= 4 (non-deuce)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "4x0"
Received: "ADx0"

[Killed] BlockStatement
src/core/scoring/scoring-logic.ts:9:16
   isDeuce?: boolean, advantage?: string | null, isTiebreak?: boolean,
 ): string {
   if (isTiebreak || p1 >= 4 || p2 >= 4) return `${p1}x${p2}`;
-  if (isDeuce) {
-    if (advantage === 'player1') return 'ADx40';
-    if (advantage === 'player2') return '40xAD';
-    return '40x40';
-  }
+  if (isDeuce) {}
   return `${GAME_POINTS[p1] ?? p1}x${GAME_POINTS[p2] ?? p2}`;
 }
killedBy: scoring-logic — Characterization Tests getGameScoreLabel returns ADx40 when advantage is player1 at deuce
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ADx40"
Received: "40x40"

[Killed] ConditionalExpression
src/core/scoring/scoring-logic.ts:9:7
   isDeuce?: boolean, advantage?: string | null, isTiebreak?: boolean,
 ): string {
   if (isTiebreak || p1 >= 4 || p2 >= 4) return `${p1}x${p2}`;
-  if (isDeuce) {
+  if (true) {
     if (advantage === 'player1') return 'ADx40';
     if (advantage === 'player2') return '40xAD';
killedBy: scoring-logic — Characterization Tests getGameScoreLabel uses GAME_POINTS mapping for regular points < 4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "0x0"
Received: "40x40"

[Killed] ConditionalExpression
src/core/scoring/scoring-logic.ts:10:9
 ): string {
   if (isTiebreak || p1 >= 4 || p2 >= 4) return `${p1}x${p2}`;
   if (isDeuce) {
-    if (advantage === 'player1') return 'ADx40';
+    if (false) return 'ADx40';
     if (advantage === 'player2') return '40xAD';
     return '40x40';
killedBy: scoring-logic — Characterization Tests getGameScoreLabel returns ADx40 when advantage is player1 at deuce
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ADx40"
Received: "40x40"

[Killed] EqualityOperator
src/core/scoring/scoring-logic.ts:10:9
 ): string {
   if (isTiebreak || p1 >= 4 || p2 >= 4) return `${p1}x${p2}`;
   if (isDeuce) {
-    if (advantage === 'player1') return 'ADx40';
+    if (advantage !== 'player1') return 'ADx40';
     if (advantage === 'player2') return '40xAD';
     return '40x40';
killedBy: scoring-logic — Characterization Tests getGameScoreLabel returns ADx40 when advantage is player1 at deuce
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ADx40"
Received: "40x40"

[Killed] ConditionalExpression
src/core/scoring/scoring-logic.ts:11:9
   if (isTiebreak || p1 >= 4 || p2 >= 4) return `${p1}x${p2}`;
   if (isDeuce) {
     if (advantage === 'player1') return 'ADx40';
-    if (advantage === 'player2') return '40xAD';
+    if (false) return '40xAD';
     return '40x40';
   }
killedBy: scoring-logic — Characterization Tests getGameScoreLabel returns 40xAD when advantage is player2 at deuce
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "40xAD"
Received: "40x40"

[Killed] ConditionalExpression
src/core/scoring/scoring-logic.ts:11:9
   if (isTiebreak || p1 >= 4 || p2 >= 4) return `${p1}x${p2}`;
   if (isDeuce) {
     if (advantage === 'player1') return 'ADx40';
-    if (advantage === 'player2') return '40xAD';
+    if (true) return '40xAD';
     return '40x40';
   }
killedBy: scoring-logic — Characterization Tests getGameScoreLabel returns 40x40 at deuce with no advantage
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "40x40"
Received: "40xAD"

[Killed] LogicalOperator
src/core/scoring/scoring-logic.ts:14:13
     if (advantage === 'player2') return '40xAD';
     return '40x40';
   }
-  return `${GAME_POINTS[p1] ?? p1}x${GAME_POINTS[p2] ?? p2}`;
+  return `${GAME_POINTS[p1] && p1}x${GAME_POINTS[p2] ?? p2}`;
 }
 
killedBy: scoring-logic — Characterization Tests getGameScoreLabel uses GAME_POINTS mapping for regular points < 4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "15x0"
Received: "1x0"

[Killed] LogicalOperator
src/core/scoring/scoring-logic.ts:14:38
     if (advantage === 'player2') return '40xAD';
     return '40x40';
   }
-  return `${GAME_POINTS[p1] ?? p1}x${GAME_POINTS[p2] ?? p2}`;
+  return `${GAME_POINTS[p1] ?? p1}x${GAME_POINTS[p2] && p2}`;
 }
 
killedBy: scoring-logic — Characterization Tests getGameScoreLabel uses GAME_POINTS mapping for regular points < 4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "0x15"
Received: "0x1"

[Killed] BlockStatement
src/core/scoring/scoring-logic.ts:17:60
   return `${GAME_POINTS[p1] ?? p1}x${GAME_POINTS[p2] ?? p2}`;
 }
 
-export function isBreakPoint(state: ScoringState): boolean {
-  if (state.isFinished) return false;
-  const set = state.sets[state.sets.length - 1];
-  // Tiebreak não tem "quebra de saque" no sentido clássico de game — cada
-  // ponto do tiebreak é servido alternadamente, então o conceito de break
-  // point não se aplica.
-  if (set?.isTiebreak) return false;
-
-  const game = state.currentGame;
-  const server = state.server;
-  const receiver = server === 'player1' ? 'player2' : 'player1';
-
-  // Break point é sobre o placar de PONTOS dentro do game atual — não
-  // sobre quantos games já foram vencidos no set. Usar o placar de games
-  // (como a versão anterior fazia) resulta em falso-positivo constante:
-  // no início de qualquer set/game, ambos têm 0 games, e "receiverGames
-  // >= serverGames" (0 >= 0) é sempre verdadeiro.
-  if (game.isDeuce) {
-    return game.advantage === receiver;
-  }
-
-  const receiverPoints = receiver === 'player1' ? game.player1 : game.player2;
-  const serverPoints = server === 'player1' ? game.player1 : game.player2;
-  return receiverPoints >= 3 && serverPoints <= 2;
-}
+export function isBreakPoint(state: ScoringState): boolean {}
 
 export function isGameBall(state: ScoringState): boolean {
killedBy: scoring-logic — Characterization Tests isBreakPoint returns false when match is finished
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] BooleanLiteral
src/core/scoring/scoring-logic.ts:18:32
 }
 
 export function isBreakPoint(state: ScoringState): boolean {
-  if (state.isFinished) return false;
+  if (state.isFinished) return true;
   const set = state.sets[state.sets.length - 1];
   // Tiebreak não tem "quebra de saque" no sentido clássico de game — cada
killedBy: scoring-logic — Characterization Tests isBreakPoint returns false when match is finished
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/core/scoring/scoring-logic.ts:18:7
 }
 
 export function isBreakPoint(state: ScoringState): boolean {
-  if (state.isFinished) return false;
+  if (true) return false;
   const set = state.sets[state.sets.length - 1];
   // Tiebreak não tem "quebra de saque" no sentido clássico de game — cada
killedBy: scoring-logic — Characterization Tests isBreakPoint returns true when receiver has advantage at deuce
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] ArithmeticOperator
src/core/scoring/scoring-logic.ts:19:26
 
 export function isBreakPoint(state: ScoringState): boolean {
   if (state.isFinished) return false;
-  const set = state.sets[state.sets.length - 1];
+  const set = state.sets[state.sets.length + 1];
   // Tiebreak não tem "quebra de saque" no sentido clássico de game — cada
   // ponto do tiebreak é servido alternadamente, então o conceito de break

[Killed] BooleanLiteral
src/core/scoring/scoring-logic.ts:23:31
   // Tiebreak não tem "quebra de saque" no sentido clássico de game — cada
   // ponto do tiebreak é servido alternadamente, então o conceito de break
   // point não se aplica.
-  if (set?.isTiebreak) return false;
+  if (set?.isTiebreak) return true;
 
   const game = state.currentGame;
killedBy: scoring-logic — Characterization Tests isBreakPoint returns false when current set is tiebreak
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] OptionalChaining
src/core/scoring/scoring-logic.ts:23:7
   // Tiebreak não tem "quebra de saque" no sentido clássico de game — cada
   // ponto do tiebreak é servido alternadamente, então o conceito de break
   // point não se aplica.
-  if (set?.isTiebreak) return false;
+  if (set.isTiebreak) return false;
 
   const game = state.currentGame;
killedBy: scoring-logic — Characterization Tests isBreakPoint returns false when no sets exist
statusReason: TypeError: Cannot read properties of undefined (reading 'isTiebreak')

[Killed] ConditionalExpression
src/core/scoring/scoring-logic.ts:27:20
 
   const game = state.currentGame;
   const server = state.server;
-  const receiver = server === 'player1' ? 'player2' : 'player1';
+  const receiver = true ? 'player2' : 'player1';
 
   // Break point é sobre o placar de PONTOS dentro do game atual — não
killedBy: scoring-logic — Characterization Tests isBreakPoint correctly identifies break point for player2 as server
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/core/scoring/scoring-logic.ts:27:20
 
   const game = state.currentGame;
   const server = state.server;
-  const receiver = server === 'player1' ? 'player2' : 'player1';
+  const receiver = server !== 'player1' ? 'player2' : 'player1';
 
   // Break point é sobre o placar de PONTOS dentro do game atual — não
killedBy: scoring-logic — Characterization Tests isBreakPoint returns true when receiver has advantage at deuce
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/core/scoring/scoring-logic.ts:34:7
   // (como a versão anterior fazia) resulta em falso-positivo constante:
   // no início de qualquer set/game, ambos têm 0 games, e "receiverGames
   // >= serverGames" (0 >= 0) é sempre verdadeiro.
-  if (game.isDeuce) {
+  if (false) {
     return game.advantage === receiver;
   }
killedBy: scoring-logic — Characterization Tests isBreakPoint returns true when receiver has advantage at deuce
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/core/scoring/scoring-logic.ts:34:7
   // (como a versão anterior fazia) resulta em falso-positivo constante:
   // no início de qualquer set/game, ambos têm 0 games, e "receiverGames
   // >= serverGames" (0 >= 0) é sempre verdadeiro.
-  if (game.isDeuce) {
+  if (true) {
     return game.advantage === receiver;
   }
killedBy: scoring-logic — Characterization Tests isBreakPoint returns true when receiverPoints >= 3 and serverPoints <= 2 (no deuce)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/core/scoring/scoring-logic.ts:35:12
   // no início de qualquer set/game, ambos têm 0 games, e "receiverGames
   // >= serverGames" (0 >= 0) é sempre verdadeiro.
   if (game.isDeuce) {
-    return game.advantage === receiver;
+    return true;
   }
 
killedBy: scoring-logic — Characterization Tests isBreakPoint returns false when server has advantage at deuce
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/core/scoring/scoring-logic.ts:35:12
   // no início de qualquer set/game, ambos têm 0 games, e "receiverGames
   // >= serverGames" (0 >= 0) é sempre verdadeiro.
   if (game.isDeuce) {
-    return game.advantage === receiver;
+    return game.advantage !== receiver;
   }
 
killedBy: scoring-logic — Characterization Tests isBreakPoint returns true when receiver has advantage at deuce
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/core/scoring/scoring-logic.ts:38:26
     return game.advantage === receiver;
   }
 
-  const receiverPoints = receiver === 'player1' ? game.player1 : game.player2;
+  const receiverPoints = true ? game.player1 : game.player2;
   const serverPoints = server === 'player1' ? game.player1 : game.player2;
   return receiverPoints >= 3 && serverPoints <= 2;
killedBy: scoring-logic — Characterization Tests isBreakPoint returns true when receiverPoints >= 3 and serverPoints <= 2 (no deuce)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/core/scoring/scoring-logic.ts:38:26
     return game.advantage === receiver;
   }
 
-  const receiverPoints = receiver === 'player1' ? game.player1 : game.player2;
+  const receiverPoints = receiver !== 'player1' ? game.player1 : game.player2;
   const serverPoints = server === 'player1' ? game.player1 : game.player2;
   return receiverPoints >= 3 && serverPoints <= 2;
killedBy: scoring-logic — Characterization Tests isBreakPoint returns true when receiverPoints >= 3 and serverPoints <= 2 (no deuce)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/core/scoring/scoring-logic.ts:39:24
   }
 
   const receiverPoints = receiver === 'player1' ? game.player1 : game.player2;
-  const serverPoints = server === 'player1' ? game.player1 : game.player2;
+  const serverPoints = false ? game.player1 : game.player2;
   return receiverPoints >= 3 && serverPoints <= 2;
 }
killedBy: scoring-logic — Characterization Tests isBreakPoint returns true when receiverPoints >= 3 and serverPoints <= 2 (no deuce)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/core/scoring/scoring-logic.ts:39:24
   }
 
   const receiverPoints = receiver === 'player1' ? game.player1 : game.player2;
-  const serverPoints = server === 'player1' ? game.player1 : game.player2;
+  const serverPoints = true ? game.player1 : game.player2;
   return receiverPoints >= 3 && serverPoints <= 2;
 }
killedBy: scoring-logic — Characterization Tests isBreakPoint correctly identifies break point for player2 as server
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
src/core/scoring/scoring-logic.ts:40:10
 
   const receiverPoints = receiver === 'player1' ? game.player1 : game.player2;
   const serverPoints = server === 'player1' ? game.player1 : game.player2;
-  return receiverPoints >= 3 && serverPoints <= 2;
+  return receiverPoints >= 3 || serverPoints <= 2;
 }
 
killedBy: scoring-logic — Characterization Tests isBreakPoint returns false when no sets exist
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/core/scoring/scoring-logic.ts:40:10
 
   const receiverPoints = receiver === 'player1' ? game.player1 : game.player2;
   const serverPoints = server === 'player1' ? game.player1 : game.player2;
-  return receiverPoints >= 3 && serverPoints <= 2;
+  return receiverPoints < 3 && serverPoints <= 2;
 }
 
killedBy: scoring-logic — Characterization Tests isBreakPoint returns false when no sets exist
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/core/scoring/scoring-logic.ts:43:58
   return receiverPoints >= 3 && serverPoints <= 2;
 }
 
-export function isGameBall(state: ScoringState): boolean {
-  const game = state.currentGame;
-  const set = state.sets[state.sets.length - 1];
-  if (set?.isTiebreak && set.tiebreakScore) {
-    const p1 = set.tiebreakScore.player1;
-    const p2 = set.tiebreakScore.player2;
-    return (p1 >= 9 && p1 - p2 === 1) || (p2 >= 9 && p2 - p1 === 1);
-  }
-  if (game.isDeuce) return false;
-  return (game.player1 >= 3 && game.player2 <= 2) || (game.player2 >= 3 && game.player1 <= 2);
-}
+export function isGameBall(state: ScoringState): boolean {}
 
 export function isSetBall(state: ScoringState, setNumber: number): boolean {
killedBy: scoring-logic — Characterization Tests isGameBall returns false at deuce
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] ArithmeticOperator
src/core/scoring/scoring-logic.ts:45:26
 
 export function isGameBall(state: ScoringState): boolean {
   const game = state.currentGame;
-  const set = state.sets[state.sets.length - 1];
+  const set = state.sets[state.sets.length + 1];
   if (set?.isTiebreak && set.tiebreakScore) {
     const p1 = set.tiebreakScore.player1;
killedBy: scoring-logic — Characterization Tests isGameBall returns true for tiebreak at 9-8 (player1)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/core/scoring/scoring-logic.ts:46:7
 export function isGameBall(state: ScoringState): boolean {
   const game = state.currentGame;
   const set = state.sets[state.sets.length - 1];
-  if (set?.isTiebreak && set.tiebreakScore) {
+  if (true) {
     const p1 = set.tiebreakScore.player1;
     const p2 = set.tiebreakScore.player2;
killedBy: scoring-logic — Characterization Tests isGameBall returns false at deuce
statusReason: TypeError: Cannot read properties of null (reading 'player1')

[Killed] OptionalChaining
src/core/scoring/scoring-logic.ts:46:7
 export function isGameBall(state: ScoringState): boolean {
   const game = state.currentGame;
   const set = state.sets[state.sets.length - 1];
-  if (set?.isTiebreak && set.tiebreakScore) {
+  if (set.isTiebreak && set.tiebreakScore) {
     const p1 = set.tiebreakScore.player1;
     const p2 = set.tiebreakScore.player2;
killedBy: scoring-logic — Characterization Tests enrichPointsFromHistory sets isTiebreak false when no sets exist
statusReason: TypeError: Cannot read properties of undefined (reading 'isTiebreak')

[Killed] ArithmeticOperator
src/core/scoring/scoring-logic.ts:49:54
   if (set?.isTiebreak && set.tiebreakScore) {
     const p1 = set.tiebreakScore.player1;
     const p2 = set.tiebreakScore.player2;
-    return (p1 >= 9 && p1 - p2 === 1) || (p2 >= 9 && p2 - p1 === 1);
+    return (p1 >= 9 && p1 - p2 === 1) || (p2 >= 9 && p2 + p1 === 1);
   }
   if (game.isDeuce) return false;
killedBy: scoring-logic — Characterization Tests isGameBall returns true for tiebreak at 8-9 (player2)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/core/scoring/scoring-logic.ts:49:43
   if (set?.isTiebreak && set.tiebreakScore) {
     const p1 = set.tiebreakScore.player1;
     const p2 = set.tiebreakScore.player2;
-    return (p1 >= 9 && p1 - p2 === 1) || (p2 >= 9 && p2 - p1 === 1);
+    return (p1 >= 9 && p1 - p2 === 1) || (p2 > 9 && p2 - p1 === 1);
   }
   if (game.isDeuce) return false;
killedBy: scoring-logic — Characterization Tests isGameBall returns true for tiebreak at 8-9 (player2)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/core/scoring/scoring-logic.ts:51:7
     const p2 = set.tiebreakScore.player2;
     return (p1 >= 9 && p1 - p2 === 1) || (p2 >= 9 && p2 - p1 === 1);
   }
-  if (game.isDeuce) return false;
+  if (true) return false;
   return (game.player1 >= 3 && game.player2 <= 2) || (game.player2 >= 3 && game.player1 <= 2);
 }
killedBy: scoring-logic — Characterization Tests isGameBall returns true at 40-0 (3-0) for player1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/core/scoring/scoring-logic.ts:51:28
     const p2 = set.tiebreakScore.player2;
     return (p1 >= 9 && p1 - p2 === 1) || (p2 >= 9 && p2 - p1 === 1);
   }
-  if (game.isDeuce) return false;
+  if (game.isDeuce) return true;
   return (game.player1 >= 3 && game.player2 <= 2) || (game.player2 >= 3 && game.player1 <= 2);
 }
killedBy: scoring-logic — Characterization Tests isGameBall returns false at deuce
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/core/scoring/scoring-logic.ts:52:10
     return (p1 >= 9 && p1 - p2 === 1) || (p2 >= 9 && p2 - p1 === 1);
   }
   if (game.isDeuce) return false;
-  return (game.player1 >= 3 && game.player2 <= 2) || (game.player2 >= 3 && game.player1 <= 2);
+  return true;
 }
 
killedBy: scoring-logic — Characterization Tests isGameBall returns false at 30-30 (2-2)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/core/scoring/scoring-logic.ts:52:55
     return (p1 >= 9 && p1 - p2 === 1) || (p2 >= 9 && p2 - p1 === 1);
   }
   if (game.isDeuce) return false;
-  return (game.player1 >= 3 && game.player2 <= 2) || (game.player2 >= 3 && game.player1 <= 2);
+  return (game.player1 >= 3 && game.player2 <= 2) || (true && game.player1 <= 2);
 }
 
killedBy: scoring-logic — Characterization Tests isGameBall returns false at 30-30 (2-2)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/core/scoring/scoring-logic.ts:55:76
   return (game.player1 >= 3 && game.player2 <= 2) || (game.player2 >= 3 && game.player1 <= 2);
 }
 
-export function isSetBall(state: ScoringState, setNumber: number): boolean {
-  const set = state.sets[setNumber - 1];
-  if (!set) return false;
-  return (set.player1 >= 5 && set.player2 <= 4) || (set.player2 >= 5 && set.player1 <= 4);
-}
+export function isSetBall(state: ScoringState, setNumber: number): boolean {}
 
 export function enrichPointsFromHistory(
killedBy: scoring-logic — Characterization Tests isSetBall returns false when set does not exist
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] ArithmeticOperator
src/core/scoring/scoring-logic.ts:56:26
 }
 
 export function isSetBall(state: ScoringState, setNumber: number): boolean {
-  const set = state.sets[setNumber - 1];
+  const set = state.sets[setNumber + 1];
   if (!set) return false;
   return (set.player1 >= 5 && set.player2 <= 4) || (set.player2 >= 5 && set.player1 <= 4);
killedBy: scoring-logic — Characterization Tests isSetBall returns true for player1 at 5-4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/core/scoring/scoring-logic.ts:57:20
 
 export function isSetBall(state: ScoringState, setNumber: number): boolean {
   const set = state.sets[setNumber - 1];
-  if (!set) return false;
+  if (!set) return true;
   return (set.player1 >= 5 && set.player2 <= 4) || (set.player2 >= 5 && set.player1 <= 4);
 }
killedBy: scoring-logic — Characterization Tests isSetBall returns false when set does not exist
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/core/scoring/scoring-logic.ts:57:7
 
 export function isSetBall(state: ScoringState, setNumber: number): boolean {
   const set = state.sets[setNumber - 1];
-  if (!set) return false;
+  if (true) return false;
   return (set.player1 >= 5 && set.player2 <= 4) || (set.player2 >= 5 && set.player1 <= 4);
 }
killedBy: scoring-logic — Characterization Tests isSetBall returns true for player1 at 5-4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
src/core/scoring/scoring-logic.ts:58:11
 export function isSetBall(state: ScoringState, setNumber: number): boolean {
   const set = state.sets[setNumber - 1];
   if (!set) return false;
-  return (set.player1 >= 5 && set.player2 <= 4) || (set.player2 >= 5 && set.player1 <= 4);
+  return (set.player1 >= 5 || set.player2 <= 4) || (set.player2 >= 5 && set.player1 <= 4);
 }
 
killedBy: scoring-logic — Characterization Tests isSetBall returns false at 5-5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/core/scoring/scoring-logic.ts:58:10
 export function isSetBall(state: ScoringState, setNumber: number): boolean {
   const set = state.sets[setNumber - 1];
   if (!set) return false;
-  return (set.player1 >= 5 && set.player2 <= 4) || (set.player2 >= 5 && set.player1 <= 4);
+  return false;
 }
 
killedBy: scoring-logic — Characterization Tests isSetBall returns true for player1 at 5-4
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/core/scoring/scoring-logic.ts:68:19
 ): TimelinePoint[] {
   const points: TimelinePoint[] = [];
 
-  for (let i = 0; i < history.length; i++) {
+  for (let i = 0; i >= history.length; i++) {
     const entry = history[i];
     const stateBefore = entry.stateBefore;
killedBy: scoring-logic — Characterization Tests enrichPointsFromHistory returns empty array for empty history
statusReason: TypeError: Cannot read properties of undefined (reading 'stateBefore')

[Killed] EqualityOperator
src/core/scoring/scoring-logic.ts:68:19
 ): TimelinePoint[] {
   const points: TimelinePoint[] = [];
 
-  for (let i = 0; i < history.length; i++) {
+  for (let i = 0; i <= history.length; i++) {
     const entry = history[i];
     const stateBefore = entry.stateBefore;
killedBy: scoring-logic — Characterization Tests enrichPointsFromHistory returns empty array for empty history
statusReason: TypeError: Cannot read properties of undefined (reading 'stateBefore')

[Killed] ConditionalExpression
src/core/scoring/scoring-logic.ts:74:7
     const pt = entry.point;
 
     const winner: 'PLAYER_1' | 'PLAYER_2' =
-      pt.winnerId === player1Id ? 'PLAYER_1' : 'PLAYER_2';
+      false ? 'PLAYER_1' : 'PLAYER_2';
 
     const setNumber = stateBefore.sets.length > 0 ? stateBefore.sets.length : 1;
killedBy: scoring-logic — Characterization Tests enrichPointsFromHistory enriches single point with basic info
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 1
+ Received  + 1

@@ -17,7 +17,7 @@
    },
    "rallyLength": 4,

[Killed] EqualityOperator
src/core/scoring/scoring-logic.ts:74:7
     const pt = entry.point;
 
     const winner: 'PLAYER_1' | 'PLAYER_2' =
-      pt.winnerId === player1Id ? 'PLAYER_1' : 'PLAYER_2';
+      pt.winnerId !== player1Id ? 'PLAYER_1' : 'PLAYER_2';
 
     const setNumber = stateBefore.sets.length > 0 ? stateBefore.sets.length : 1;
killedBy: scoring-logic — Characterization Tests enrichPointsFromHistory enriches single point with basic info
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 1
+ Received  + 1

@@ -17,7 +17,7 @@
    },
    "rallyLength": 4,

[Killed] EqualityOperator
src/core/scoring/scoring-logic.ts:76:23
     const winner: 'PLAYER_1' | 'PLAYER_2' =
       pt.winnerId === player1Id ? 'PLAYER_1' : 'PLAYER_2';
 
-    const setNumber = stateBefore.sets.length > 0 ? stateBefore.sets.length : 1;
+    const setNumber = stateBefore.sets.length <= 0 ? stateBefore.sets.length : 1;
     const currentSet = stateBefore.sets[stateBefore.sets.length - 1];
     const gamesScore = {
killedBy: scoring-logic — Characterization Tests enrichPointsFromHistory calculates correct setNumber from stateBefore.sets.length
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1
