[Killed] ConditionalExpression
src/core/scoring/scoring-logic.ts:76:23
     const winner: 'PLAYER_1' | 'PLAYER_2' =
       pt.winnerId === player1Id ? 'PLAYER_1' : 'PLAYER_2';
 
-    const setNumber = stateBefore.sets.length > 0 ? stateBefore.sets.length : 1;
+    const setNumber = false ? stateBefore.sets.length : 1;
     const currentSet = stateBefore.sets[stateBefore.sets.length - 1];
     const gamesScore = {
killedBy: scoring-logic — Characterization Tests enrichPointsFromHistory calculates correct setNumber from stateBefore.sets.length
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] ArithmeticOperator
src/core/scoring/scoring-logic.ts:77:41
       pt.winnerId === player1Id ? 'PLAYER_1' : 'PLAYER_2';
 
     const setNumber = stateBefore.sets.length > 0 ? stateBefore.sets.length : 1;
-    const currentSet = stateBefore.sets[stateBefore.sets.length - 1];
+    const currentSet = stateBefore.sets[stateBefore.sets.length + 1];
     const gamesScore = {
       player1: currentSet?.player1 ?? 0,
killedBy: scoring-logic — Characterization Tests enrichPointsFromHistory sets isTiebreak true when current set is tiebreak
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] OptionalChaining
src/core/scoring/scoring-logic.ts:79:16
     const setNumber = stateBefore.sets.length > 0 ? stateBefore.sets.length : 1;
     const currentSet = stateBefore.sets[stateBefore.sets.length - 1];
     const gamesScore = {
-      player1: currentSet?.player1 ?? 0,
+      player1: currentSet.player1 ?? 0,
       player2: currentSet?.player2 ?? 0,
     };
killedBy: scoring-logic — Characterization Tests enrichPointsFromHistory sets isTiebreak false when no sets exist
statusReason: TypeError: Cannot read properties of undefined (reading 'player1')

[Killed] LogicalOperator
src/core/scoring/scoring-logic.ts:79:16
     const setNumber = stateBefore.sets.length > 0 ? stateBefore.sets.length : 1;
     const currentSet = stateBefore.sets[stateBefore.sets.length - 1];
     const gamesScore = {
-      player1: currentSet?.player1 ?? 0,
+      player1: currentSet?.player1 && 0,
       player2: currentSet?.player2 ?? 0,
     };
killedBy: scoring-logic — Characterization Tests enrichPointsFromHistory sets gamesScore from currentSet games
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "player1": 4,
+   "player1": 0,

[Killed] OptionalChaining
src/core/scoring/scoring-logic.ts:80:16
     const currentSet = stateBefore.sets[stateBefore.sets.length - 1];
     const gamesScore = {
       player1: currentSet?.player1 ?? 0,
-      player2: currentSet?.player2 ?? 0,
+      player2: currentSet.player2 ?? 0,
     };
 
killedBy: scoring-logic — Characterization Tests enrichPointsFromHistory sets isTiebreak false when no sets exist
statusReason: TypeError: Cannot read properties of undefined (reading 'player2')

[Killed] LogicalOperator
src/core/scoring/scoring-logic.ts:80:16
     const currentSet = stateBefore.sets[stateBefore.sets.length - 1];
     const gamesScore = {
       player1: currentSet?.player1 ?? 0,
-      player2: currentSet?.player2 ?? 0,
+      player2: currentSet?.player2 && 0,
     };
 
killedBy: scoring-logic — Characterization Tests enrichPointsFromHistory sets gamesScore from currentSet games
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "player1": 4,
-   "player2": 3,

[Killed] ObjectLiteral
src/core/scoring/scoring-logic.ts:83:23
       player2: currentSet?.player2 ?? 0,
     };
 
-    const gameScore = {
-      player1: stateBefore.currentGame.player1,
-      player2: stateBefore.currentGame.player2,
-    };
+    const gameScore = {};
 
     const bp = isBreakPoint(stateBefore);
killedBy: scoring-logic — Characterization Tests enrichPointsFromHistory sets gameScore from currentGame points
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Object {
-   "player1": 2,
-   "player2": 1,

[Killed] EqualityOperator
src/core/scoring/scoring-logic.ts:92:48
     const gb = isGameBall(stateBefore);
     const sb = isSetBall(stateBefore, setNumber);
 
-    const isServeFinish = pt.type === 'ACE' || pt.type === 'DOUBLE_FAULT';
+    const isServeFinish = pt.type === 'ACE' || pt.type !== 'DOUBLE_FAULT';
     const isDevolucao = pt.rallyDetails?.situacao === 'devolucao';
     const rallyLength = pt.rallyLength ?? (isServeFinish ? 1 : isDevolucao ? 2 : 0);
killedBy: scoring-logic — Characterization Tests enrichPointsFromHistory calculates rallyLength as 2 for devolucao when not provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] EqualityOperator
src/core/scoring/scoring-logic.ts:92:27
     const gb = isGameBall(stateBefore);
     const sb = isSetBall(stateBefore, setNumber);
 
-    const isServeFinish = pt.type === 'ACE' || pt.type === 'DOUBLE_FAULT';
+    const isServeFinish = pt.type !== 'ACE' || pt.type === 'DOUBLE_FAULT';
     const isDevolucao = pt.rallyDetails?.situacao === 'devolucao';
     const rallyLength = pt.rallyLength ?? (isServeFinish ? 1 : isDevolucao ? 2 : 0);
killedBy: scoring-logic — Characterization Tests enrichPointsFromHistory calculates rallyLength as 1 for serve finish when not provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
src/core/scoring/scoring-logic.ts:93:25
     const sb = isSetBall(stateBefore, setNumber);
 
     const isServeFinish = pt.type === 'ACE' || pt.type === 'DOUBLE_FAULT';
-    const isDevolucao = pt.rallyDetails?.situacao === 'devolucao';
+    const isDevolucao = true;
     const rallyLength = pt.rallyLength ?? (isServeFinish ? 1 : isDevolucao ? 2 : 0);
     const isTiebreak = currentSet?.isTiebreak ?? false;
killedBy: scoring-logic — Characterization Tests enrichPointsFromHistory calculates rallyLength as 0 for regular rally when not provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 2

[Killed] ConditionalExpression
src/core/scoring/scoring-logic.ts:93:25
     const sb = isSetBall(stateBefore, setNumber);
 
     const isServeFinish = pt.type === 'ACE' || pt.type === 'DOUBLE_FAULT';
-    const isDevolucao = pt.rallyDetails?.situacao === 'devolucao';
+    const isDevolucao = false;
     const rallyLength = pt.rallyLength ?? (isServeFinish ? 1 : isDevolucao ? 2 : 0);
     const isTiebreak = currentSet?.isTiebreak ?? false;
killedBy: scoring-logic — Characterization Tests enrichPointsFromHistory calculates rallyLength as 2 for devolucao when not provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0

[Killed] LogicalOperator
src/core/scoring/scoring-logic.ts:94:25
 
     const isServeFinish = pt.type === 'ACE' || pt.type === 'DOUBLE_FAULT';
     const isDevolucao = pt.rallyDetails?.situacao === 'devolucao';
-    const rallyLength = pt.rallyLength ?? (isServeFinish ? 1 : isDevolucao ? 2 : 0);
+    const rallyLength = pt.rallyLength && (isServeFinish ? 1 : isDevolucao ? 2 : 0);
     const isTiebreak = currentSet?.isTiebreak ?? false;
 
killedBy: scoring-logic — Characterization Tests enrichPointsFromHistory enriches single point with basic info
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 1
+ Received  + 1

@@ -13,11 +13,11 @@
    "rallyDetails": Object {
      "situacao": "rally",

[Killed] OptionalChaining
src/core/scoring/scoring-logic.ts:95:24
     const isServeFinish = pt.type === 'ACE' || pt.type === 'DOUBLE_FAULT';
     const isDevolucao = pt.rallyDetails?.situacao === 'devolucao';
     const rallyLength = pt.rallyLength ?? (isServeFinish ? 1 : isDevolucao ? 2 : 0);
-    const isTiebreak = currentSet?.isTiebreak ?? false;
+    const isTiebreak = currentSet.isTiebreak ?? false;
 
     const firstFault = pt.type === 'DOUBLE_FAULT' && pt.firstFaultDetail
killedBy: scoring-logic — Characterization Tests enrichPointsFromHistory sets isTiebreak false when no sets exist
statusReason: TypeError: Cannot read properties of undefined (reading 'isTiebreak')

[Killed] LogicalOperator
src/core/scoring/scoring-logic.ts:95:24
     const isServeFinish = pt.type === 'ACE' || pt.type === 'DOUBLE_FAULT';
     const isDevolucao = pt.rallyDetails?.situacao === 'devolucao';
     const rallyLength = pt.rallyLength ?? (isServeFinish ? 1 : isDevolucao ? 2 : 0);
-    const isTiebreak = currentSet?.isTiebreak ?? false;
+    const isTiebreak = currentSet?.isTiebreak && false;
 
     const firstFault = pt.type === 'DOUBLE_FAULT' && pt.firstFaultDetail
killedBy: scoring-logic — Characterization Tests enrichPointsFromHistory sets isTiebreak true when current set is tiebreak
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
src/core/scoring/scoring-logic.ts:97:24
     const rallyLength = pt.rallyLength ?? (isServeFinish ? 1 : isDevolucao ? 2 : 0);
     const isTiebreak = currentSet?.isTiebreak ?? false;
 
-    const firstFault = pt.type === 'DOUBLE_FAULT' && pt.firstFaultDetail
+    const firstFault = pt.type === 'DOUBLE_FAULT' || pt.firstFaultDetail
       ? pt.firstFaultDetail
       : undefined;
killedBy: scoring-logic — Characterization Tests enrichPointsFromHistory sets firstFault undefined for non-DOUBLE_FAULT
statusReason: Error: expect(received).toBeUndefined()

Received: "WIDE"

[Killed] ConditionalExpression
src/core/scoring/scoring-logic.ts:97:24
     const rallyLength = pt.rallyLength ?? (isServeFinish ? 1 : isDevolucao ? 2 : 0);
     const isTiebreak = currentSet?.isTiebreak ?? false;
 
-    const firstFault = pt.type === 'DOUBLE_FAULT' && pt.firstFaultDetail
+    const firstFault = true
       ? pt.firstFaultDetail
       : undefined;
killedBy: scoring-logic — Characterization Tests enrichPointsFromHistory enriches single point with basic info
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 1
+ Received  + 1

@@ -1,7 +1,7 @@
  Object {
-   "firstFault": undefined,

[Killed] ArithmeticOperator
src/core/scoring/scoring-logic.ts:102:20
       : undefined;
 
     points.push({
-      pointNumber: i + 1,
+      pointNumber: i - 1,
       winner,
       type: pt.type,
killedBy: scoring-logic — Characterization Tests enrichPointsFromHistory enriches single point with basic info
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 1
+ Received  + 1

@@ -7,11 +7,11 @@
    "isGameBall": false,
    "isSecondServe": false,

[Killed] LogicalOperator
src/core/scoring/scoring-logic.ts:115:21
       isGameBall: gb,
       isSetBall: sb,
       rallyLength,
-      rallyDetails: pt.rallyDetails ?? null,
+      rallyDetails: pt.rallyDetails && null,
       note: pt.rallyDetails?.note,
       pointDetails: pt,
killedBy: scoring-logic — Characterization Tests enrichPointsFromHistory enriches single point with basic info
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 5
+ Received  + 1

@@ -8,15 +8,11 @@
    "isSecondServe": false,
    "isSetBall": false,

[Killed] OptionalChaining
src/core/scoring/scoring-logic.ts:116:13
       isSetBall: sb,
       rallyLength,
       rallyDetails: pt.rallyDetails ?? null,
-      note: pt.rallyDetails?.note,
+      note: pt.rallyDetails.note,
       pointDetails: pt,
       isTiebreak,
killedBy: scoring-logic — Characterization Tests enrichPointsFromHistory sets rallyDetails to null when undefined
statusReason: TypeError: Cannot read properties of undefined (reading 'note')
