[NoCoverage] BlockStatement
src/components/scoring/timeline-utils.ts:25:20
     winnersOnly?: boolean;
     errorsOnly?: boolean;
   },
-): TimelinePoint[] {
-  return points.filter(p => {
-    if (filters.playerWinner && p.winner !== filters.playerWinner) return false;
-    if (filters.breakPointsOnly && !p.isBreakPoint) return false;
-    if (filters.winnersOnly && p.type !== 'WINNER' && p.type !== 'ACE') return false;
-    if (filters.errorsOnly && p.type !== 'UNFORCED_ERROR' && p.type !== 'FORCED_ERROR' && p.type !== 'DOUBLE_FAULT') return false;
-    return true;
-  });
-}
+): TimelinePoint[] {}
 
 export function countByFilter(points: TimelinePoint[], filter: (p: TimelinePoint) => boolean): number {

[NoCoverage] BlockStatement
src/components/scoring/timeline-utils.ts:26:29
     errorsOnly?: boolean;
   },
 ): TimelinePoint[] {
-  return points.filter(p => {
-    if (filters.playerWinner && p.winner !== filters.playerWinner) return false;
-    if (filters.breakPointsOnly && !p.isBreakPoint) return false;
-    if (filters.winnersOnly && p.type !== 'WINNER' && p.type !== 'ACE') return false;
-    if (filters.errorsOnly && p.type !== 'UNFORCED_ERROR' && p.type !== 'FORCED_ERROR' && p.type !== 'DOUBLE_FAULT') return false;
-    return true;
-  });
+  return points.filter(p => {});
 }
 

[NoCoverage] MethodExpression
src/components/scoring/timeline-utils.ts:26:10
     errorsOnly?: boolean;
   },
 ): TimelinePoint[] {
-  return points.filter(p => {
-    if (filters.playerWinner && p.winner !== filters.playerWinner) return false;
-    if (filters.breakPointsOnly && !p.isBreakPoint) return false;
-    if (filters.winnersOnly && p.type !== 'WINNER' && p.type !== 'ACE') return false;
-    if (filters.errorsOnly && p.type !== 'UNFORCED_ERROR' && p.type !== 'FORCED_ERROR' && p.type !== 'DOUBLE_FAULT') return false;
-    return true;
-  });
+  return points;
 }
 

[NoCoverage] BooleanLiteral
src/components/scoring/timeline-utils.ts:27:75
   },
 ): TimelinePoint[] {
   return points.filter(p => {
-    if (filters.playerWinner && p.winner !== filters.playerWinner) return false;
+    if (filters.playerWinner && p.winner !== filters.playerWinner) return true;
     if (filters.breakPointsOnly && !p.isBreakPoint) return false;
     if (filters.winnersOnly && p.type !== 'WINNER' && p.type !== 'ACE') return false;

[NoCoverage] LogicalOperator
src/components/scoring/timeline-utils.ts:27:9
   },
 ): TimelinePoint[] {
   return points.filter(p => {
-    if (filters.playerWinner && p.winner !== filters.playerWinner) return false;
+    if (filters.playerWinner || p.winner !== filters.playerWinner) return false;
     if (filters.breakPointsOnly && !p.isBreakPoint) return false;
     if (filters.winnersOnly && p.type !== 'WINNER' && p.type !== 'ACE') return false;

[NoCoverage] LogicalOperator
src/components/scoring/timeline-utils.ts:28:9
 ): TimelinePoint[] {
   return points.filter(p => {
     if (filters.playerWinner && p.winner !== filters.playerWinner) return false;
-    if (filters.breakPointsOnly && !p.isBreakPoint) return false;
+    if (filters.breakPointsOnly || !p.isBreakPoint) return false;
     if (filters.winnersOnly && p.type !== 'WINNER' && p.type !== 'ACE') return false;
     if (filters.errorsOnly && p.type !== 'UNFORCED_ERROR' && p.type !== 'FORCED_ERROR' && p.type !== 'DOUBLE_FAULT') return false;

[NoCoverage] ConditionalExpression
src/components/scoring/timeline-utils.ts:28:9
 ): TimelinePoint[] {
   return points.filter(p => {
     if (filters.playerWinner && p.winner !== filters.playerWinner) return false;
-    if (filters.breakPointsOnly && !p.isBreakPoint) return false;
+    if (true) return false;
     if (filters.winnersOnly && p.type !== 'WINNER' && p.type !== 'ACE') return false;
     if (filters.errorsOnly && p.type !== 'UNFORCED_ERROR' && p.type !== 'FORCED_ERROR' && p.type !== 'DOUBLE_FAULT') return false;

[NoCoverage] ConditionalExpression
src/components/scoring/timeline-utils.ts:29:9
   return points.filter(p => {
     if (filters.playerWinner && p.winner !== filters.playerWinner) return false;
     if (filters.breakPointsOnly && !p.isBreakPoint) return false;
-    if (filters.winnersOnly && p.type !== 'WINNER' && p.type !== 'ACE') return false;
+    if (false) return false;
     if (filters.errorsOnly && p.type !== 'UNFORCED_ERROR' && p.type !== 'FORCED_ERROR' && p.type !== 'DOUBLE_FAULT') return false;
     return true;

[NoCoverage] ConditionalExpression
src/components/scoring/timeline-utils.ts:29:55
   return points.filter(p => {
     if (filters.playerWinner && p.winner !== filters.playerWinner) return false;
     if (filters.breakPointsOnly && !p.isBreakPoint) return false;
-    if (filters.winnersOnly && p.type !== 'WINNER' && p.type !== 'ACE') return false;
+    if (filters.winnersOnly && p.type !== 'WINNER' && true) return false;
     if (filters.errorsOnly && p.type !== 'UNFORCED_ERROR' && p.type !== 'FORCED_ERROR' && p.type !== 'DOUBLE_FAULT') return false;
     return true;

[NoCoverage] LogicalOperator
src/components/scoring/timeline-utils.ts:30:9
     if (filters.playerWinner && p.winner !== filters.playerWinner) return false;
     if (filters.breakPointsOnly && !p.isBreakPoint) return false;
     if (filters.winnersOnly && p.type !== 'WINNER' && p.type !== 'ACE') return false;
-    if (filters.errorsOnly && p.type !== 'UNFORCED_ERROR' && p.type !== 'FORCED_ERROR' && p.type !== 'DOUBLE_FAULT') return false;
+    if (filters.errorsOnly || p.type !== 'UNFORCED_ERROR' && p.type !== 'FORCED_ERROR' && p.type !== 'DOUBLE_FAULT') return false;
     return true;
   });

[NoCoverage] ConditionalExpression
src/components/scoring/timeline-utils.ts:30:91
     if (filters.playerWinner && p.winner !== filters.playerWinner) return false;
     if (filters.breakPointsOnly && !p.isBreakPoint) return false;
     if (filters.winnersOnly && p.type !== 'WINNER' && p.type !== 'ACE') return false;
-    if (filters.errorsOnly && p.type !== 'UNFORCED_ERROR' && p.type !== 'FORCED_ERROR' && p.type !== 'DOUBLE_FAULT') return false;
+    if (filters.errorsOnly && p.type !== 'UNFORCED_ERROR' && p.type !== 'FORCED_ERROR' && true) return false;
     return true;
   });

[NoCoverage] BooleanLiteral
src/components/scoring/timeline-utils.ts:31:12
     if (filters.breakPointsOnly && !p.isBreakPoint) return false;
     if (filters.winnersOnly && p.type !== 'WINNER' && p.type !== 'ACE') return false;
     if (filters.errorsOnly && p.type !== 'UNFORCED_ERROR' && p.type !== 'FORCED_ERROR' && p.type !== 'DOUBLE_FAULT') return false;
-    return true;
+    return false;
   });
 }

[NoCoverage] BlockStatement
src/components/scoring/timeline-utils.ts:35:103
   });
 }
 
-export function countByFilter(points: TimelinePoint[], filter: (p: TimelinePoint) => boolean): number {
-  return points.filter(filter).length;
-}
+export function countByFilter(points: TimelinePoint[], filter: (p: TimelinePoint) => boolean): number {}
 
 export function getGameScoreLabelForPoint(p: TimelinePoint): string {

[NoCoverage] MethodExpression
src/components/scoring/timeline-utils.ts:36:10
 }
 
 export function countByFilter(points: TimelinePoint[], filter: (p: TimelinePoint) => boolean): number {
-  return points.filter(filter).length;
+  return points.length;
 }
 

[NoCoverage] BlockStatement
src/components/scoring/timeline-utils.ts:39:69
   return points.filter(filter).length;
 }
 
-export function getGameScoreLabelForPoint(p: TimelinePoint): string {
-  const gs = p.gameScore;
-  return getGameScoreLabel(gs.player1, gs.player2, p.gameIsDeuce, p.gameAdvantage, p.isTiebreak);
-}
+export function getGameScoreLabelForPoint(p: TimelinePoint): string {}
 
 export function formatAceOrDf(p: TimelinePoint): string {

[NoCoverage] ConditionalExpression
src/components/scoring/timeline-utils.ts:45:7
 }
 
 export function formatAceOrDf(p: TimelinePoint): string {
-  if (p.type === 'ACE') {
+  if (true) {
     const parts = ['ACE'];
     const rd = p.rallyDetails;

[NoCoverage] BlockStatement
src/components/scoring/timeline-utils.ts:45:25
 }
 
 export function formatAceOrDf(p: TimelinePoint): string {
-  if (p.type === 'ACE') {
-    const parts = ['ACE'];
-    const rd = p.rallyDetails;
-    if (rd?.efeito) {
-      const efeitoMap: Record<string, string> = { topspin: 'TOP', slice: 'SLI', flat: 'FLA' };
-      parts.push(efeitoMap[rd.efeito] ?? rd.efeito.toUpperCase().slice(0, 3));
-    }
-    if (rd?.direcao) {
-      const dirMap: Record<string, string> = { aberto: 'AB', centro: 'CEN', fechado: 'FEC', cruzada: 'CRU', paralela: 'PAR' };
-      parts.push(dirMap[rd.direcao] ?? rd.direcao.toUpperCase().slice(0, 3));
-    }
-    return parts.join('-');
-  }
+  if (p.type === 'ACE') {}
   if (p.type === 'DOUBLE_FAULT' || p.type === 'FAULT_SECOND') {
     const ff = p.firstFault;

[NoCoverage] ArrayDeclaration
src/components/scoring/timeline-utils.ts:46:19
 
 export function formatAceOrDf(p: TimelinePoint): string {
   if (p.type === 'ACE') {
-    const parts = ['ACE'];
+    const parts = [];
     const rd = p.rallyDetails;
     if (rd?.efeito) {

[NoCoverage] OptionalChaining
src/components/scoring/timeline-utils.ts:48:9
   if (p.type === 'ACE') {
     const parts = ['ACE'];
     const rd = p.rallyDetails;
-    if (rd?.efeito) {
+    if (rd.efeito) {
       const efeitoMap: Record<string, string> = { topspin: 'TOP', slice: 'SLI', flat: 'FLA' };
       parts.push(efeitoMap[rd.efeito] ?? rd.efeito.toUpperCase().slice(0, 3));

[NoCoverage] BlockStatement
src/components/scoring/timeline-utils.ts:48:21
   if (p.type === 'ACE') {
     const parts = ['ACE'];
     const rd = p.rallyDetails;
-    if (rd?.efeito) {
-      const efeitoMap: Record<string, string> = { topspin: 'TOP', slice: 'SLI', flat: 'FLA' };
-      parts.push(efeitoMap[rd.efeito] ?? rd.efeito.toUpperCase().slice(0, 3));
-    }
+    if (rd?.efeito) {}
     if (rd?.direcao) {
       const dirMap: Record<string, string> = { aberto: 'AB', centro: 'CEN', fechado: 'FEC', cruzada: 'CRU', paralela: 'PAR' };

[NoCoverage] LogicalOperator
src/components/scoring/timeline-utils.ts:50:18
     const rd = p.rallyDetails;
     if (rd?.efeito) {
       const efeitoMap: Record<string, string> = { topspin: 'TOP', slice: 'SLI', flat: 'FLA' };
-      parts.push(efeitoMap[rd.efeito] ?? rd.efeito.toUpperCase().slice(0, 3));
+      parts.push(efeitoMap[rd.efeito] && rd.efeito.toUpperCase().slice(0, 3));
     }
     if (rd?.direcao) {

[NoCoverage] MethodExpression
src/components/scoring/timeline-utils.ts:50:42
     const rd = p.rallyDetails;
     if (rd?.efeito) {
       const efeitoMap: Record<string, string> = { topspin: 'TOP', slice: 'SLI', flat: 'FLA' };
-      parts.push(efeitoMap[rd.efeito] ?? rd.efeito.toUpperCase().slice(0, 3));
+      parts.push(efeitoMap[rd.efeito] ?? rd.efeito.toLowerCase().slice(0, 3));
     }
     if (rd?.direcao) {

[NoCoverage] BlockStatement
src/components/scoring/timeline-utils.ts:52:22
       const efeitoMap: Record<string, string> = { topspin: 'TOP', slice: 'SLI', flat: 'FLA' };
       parts.push(efeitoMap[rd.efeito] ?? rd.efeito.toUpperCase().slice(0, 3));
     }
-    if (rd?.direcao) {
-      const dirMap: Record<string, string> = { aberto: 'AB', centro: 'CEN', fechado: 'FEC', cruzada: 'CRU', paralela: 'PAR' };
-      parts.push(dirMap[rd.direcao] ?? rd.direcao.toUpperCase().slice(0, 3));
-    }
+    if (rd?.direcao) {}
     return parts.join('-');
   }

[NoCoverage] OptionalChaining
src/components/scoring/timeline-utils.ts:52:9
       const efeitoMap: Record<string, string> = { topspin: 'TOP', slice: 'SLI', flat: 'FLA' };
       parts.push(efeitoMap[rd.efeito] ?? rd.efeito.toUpperCase().slice(0, 3));
     }
-    if (rd?.direcao) {
+    if (rd.direcao) {
       const dirMap: Record<string, string> = { aberto: 'AB', centro: 'CEN', fechado: 'FEC', cruzada: 'CRU', paralela: 'PAR' };
       parts.push(dirMap[rd.direcao] ?? rd.direcao.toUpperCase().slice(0, 3));

[NoCoverage] StringLiteral
src/components/scoring/timeline-utils.ts:53:119
       parts.push(efeitoMap[rd.efeito] ?? rd.efeito.toUpperCase().slice(0, 3));
     }
     if (rd?.direcao) {
-      const dirMap: Record<string, string> = { aberto: 'AB', centro: 'CEN', fechado: 'FEC', cruzada: 'CRU', paralela: 'PAR' };
+      const dirMap: Record<string, string> = { aberto: 'AB', centro: 'CEN', fechado: 'FEC', cruzada: 'CRU', paralela: "" };
       parts.push(dirMap[rd.direcao] ?? rd.direcao.toUpperCase().slice(0, 3));
     }

[NoCoverage] MethodExpression
src/components/scoring/timeline-utils.ts:54:40
     }
     if (rd?.direcao) {
       const dirMap: Record<string, string> = { aberto: 'AB', centro: 'CEN', fechado: 'FEC', cruzada: 'CRU', paralela: 'PAR' };
-      parts.push(dirMap[rd.direcao] ?? rd.direcao.toUpperCase().slice(0, 3));
+      parts.push(dirMap[rd.direcao] ?? rd.direcao.toLowerCase().slice(0, 3));
     }
     return parts.join('-');

[NoCoverage] LogicalOperator
src/components/scoring/timeline-utils.ts:54:18
     }
     if (rd?.direcao) {
       const dirMap: Record<string, string> = { aberto: 'AB', centro: 'CEN', fechado: 'FEC', cruzada: 'CRU', paralela: 'PAR' };
-      parts.push(dirMap[rd.direcao] ?? rd.direcao.toUpperCase().slice(0, 3));
+      parts.push(dirMap[rd.direcao] && rd.direcao.toUpperCase().slice(0, 3));
     }
     return parts.join('-');

[NoCoverage] StringLiteral
src/components/scoring/timeline-utils.ts:56:23
       const dirMap: Record<string, string> = { aberto: 'AB', centro: 'CEN', fechado: 'FEC', cruzada: 'CRU', paralela: 'PAR' };
       parts.push(dirMap[rd.direcao] ?? rd.direcao.toUpperCase().slice(0, 3));
     }
-    return parts.join('-');
+    return parts.join("");
   }
   if (p.type === 'DOUBLE_FAULT' || p.type === 'FAULT_SECOND') {

[NoCoverage] LogicalOperator
src/components/scoring/timeline-utils.ts:58:7
     }
     return parts.join('-');
   }
-  if (p.type === 'DOUBLE_FAULT' || p.type === 'FAULT_SECOND') {
+  if (p.type === 'DOUBLE_FAULT' && p.type === 'FAULT_SECOND') {
     const ff = p.firstFault;
     const firstPart = ff

[NoCoverage] ConditionalExpression
src/components/scoring/timeline-utils.ts:58:36
     }
     return parts.join('-');
   }
-  if (p.type === 'DOUBLE_FAULT' || p.type === 'FAULT_SECOND') {
+  if (p.type === 'DOUBLE_FAULT' || false) {
     const ff = p.firstFault;
     const firstPart = ff

[NoCoverage] MethodExpression
src/components/scoring/timeline-utils.ts:61:47
   if (p.type === 'DOUBLE_FAULT' || p.type === 'FAULT_SECOND') {
     const ff = p.firstFault;
     const firstPart = ff
-      ? `1o.${ff.serveEffect ? `-${capitalize(ff.serveEffect.slice(0, 3))}` : ''}${ff.direction ? `-${capitalize(ff.direction.slice(0, 3))}` : ''}`
+      ? `1o.${ff.serveEffect ? `-${capitalize(ff.serveEffect)}` : ''}${ff.direction ? `-${capitalize(ff.direction.slice(0, 3))}` : ''}`
       : '1o.';
     const rd = p.rallyDetails;

[NoCoverage] MethodExpression
src/components/scoring/timeline-utils.ts:61:114
   if (p.type === 'DOUBLE_FAULT' || p.type === 'FAULT_SECOND') {
     const ff = p.firstFault;
     const firstPart = ff
-      ? `1o.${ff.serveEffect ? `-${capitalize(ff.serveEffect.slice(0, 3))}` : ''}${ff.direction ? `-${capitalize(ff.direction.slice(0, 3))}` : ''}`
+      ? `1o.${ff.serveEffect ? `-${capitalize(ff.serveEffect.slice(0, 3))}` : ''}${ff.direction ? `-${capitalize(ff.direction)}` : ''}`
       : '1o.';
     const rd = p.rallyDetails;

[NoCoverage] MethodExpression
src/components/scoring/timeline-utils.ts:65:42
       : '1o.';
     const rd = p.rallyDetails;
     const secondPart = rd
-      ? `2o.${rd.efeito ? `-${capitalize(rd.efeito.slice(0, 3))}` : ''}${rd.direcao ? `-${capitalize(rd.direcao.slice(0, 3))}` : ''}`
+      ? `2o.${rd.efeito ? `-${capitalize(rd.efeito)}` : ''}${rd.direcao ? `-${capitalize(rd.direcao.slice(0, 3))}` : ''}`
       : '2o.';
     return `DF: ${firstPart} > ${secondPart}`;

[NoCoverage] MethodExpression
src/components/scoring/timeline-utils.ts:65:102
       : '1o.';
     const rd = p.rallyDetails;
     const secondPart = rd
-      ? `2o.${rd.efeito ? `-${capitalize(rd.efeito.slice(0, 3))}` : ''}${rd.direcao ? `-${capitalize(rd.direcao.slice(0, 3))}` : ''}`
+      ? `2o.${rd.efeito ? `-${capitalize(rd.efeito.slice(0, 3))}` : ''}${rd.direcao ? `-${capitalize(rd.direcao)}` : ''}`
       : '2o.';
     return `DF: ${firstPart} > ${secondPart}`;

[NoCoverage] BlockStatement
src/components/scoring/timeline-utils.ts:72:40
   return '–';
 }
 
-function capitalize(s: string): string {
-  return s.charAt(0).toUpperCase() + s.slice(1).toLowerCase();
-}
+function capitalize(s: string): string {}
 
 export function situacaoLabel(s?: string): string {

[NoCoverage] MethodExpression
src/components/scoring/timeline-utils.ts:73:10
 }
 
 function capitalize(s: string): string {
-  return s.charAt(0).toUpperCase() + s.slice(1).toLowerCase();
+  return s.charAt(0).toLowerCase() + s.slice(1).toLowerCase();
 }
 

[NoCoverage] MethodExpression
src/components/scoring/timeline-utils.ts:73:10
 }
 
 function capitalize(s: string): string {
-  return s.charAt(0).toUpperCase() + s.slice(1).toLowerCase();
+  return s.toUpperCase() + s.slice(1).toLowerCase();
 }
 

[NoCoverage] BlockStatement
src/components/scoring/timeline-utils.ts:76:51
   return s.charAt(0).toUpperCase() + s.slice(1).toLowerCase();
 }
 
-export function situacaoLabel(s?: string): string {
-  const map: Record<string, string> = { devolucao: 'Devolução', fundo: 'Fundo', rede: 'Rede', passada: 'Passada', saque: 'Saque' };
-  return s ? (map[s] ?? s) : '–';
-}
+export function situacaoLabel(s?: string): string {}
 
 export function golpeLabel(s?: string): string {

[NoCoverage] StringLiteral
src/components/scoring/timeline-utils.ts:77:104
 }
 
 export function situacaoLabel(s?: string): string {
-  const map: Record<string, string> = { devolucao: 'Devolução', fundo: 'Fundo', rede: 'Rede', passada: 'Passada', saque: 'Saque' };
+  const map: Record<string, string> = { devolucao: 'Devolução', fundo: 'Fundo', rede: 'Rede', passada: "", saque: 'Saque' };
   return s ? (map[s] ?? s) : '–';
 }

[NoCoverage] ObjectLiteral
src/components/scoring/timeline-utils.ts:77:39
 }
 
 export function situacaoLabel(s?: string): string {
-  const map: Record<string, string> = { devolucao: 'Devolução', fundo: 'Fundo', rede: 'Rede', passada: 'Passada', saque: 'Saque' };
+  const map: Record<string, string> = {};
   return s ? (map[s] ?? s) : '–';
 }

[NoCoverage] LogicalOperator
src/components/scoring/timeline-utils.ts:78:15
 
 export function situacaoLabel(s?: string): string {
   const map: Record<string, string> = { devolucao: 'Devolução', fundo: 'Fundo', rede: 'Rede', passada: 'Passada', saque: 'Saque' };
-  return s ? (map[s] ?? s) : '–';
+  return s ? (map[s] && s) : '–';
 }
 

[NoCoverage] BlockStatement
src/components/scoring/timeline-utils.ts:81:48
   return s ? (map[s] ?? s) : '–';
 }
 
-export function golpeLabel(s?: string): string {
-  if (!s) return '–';
-  const map: Record<string, string> = { fh: 'FH', bh: 'BH', vfh: 'VFH', vbh: 'VBH', smash: 'Smash' };
-  return map[s] ?? s;
-}
+export function golpeLabel(s?: string): string {}
 
 export function direcaoLabel(s?: string): string {

[NoCoverage] ConditionalExpression
src/components/scoring/timeline-utils.ts:82:7
 }
 
 export function golpeLabel(s?: string): string {
-  if (!s) return '–';
+  if (true) return '–';
   const map: Record<string, string> = { fh: 'FH', bh: 'BH', vfh: 'VFH', vbh: 'VBH', smash: 'Smash' };
   return map[s] ?? s;

[NoCoverage] ConditionalExpression
src/components/scoring/timeline-utils.ts:82:7
 }
 
 export function golpeLabel(s?: string): string {
-  if (!s) return '–';
+  if (false) return '–';
   const map: Record<string, string> = { fh: 'FH', bh: 'BH', vfh: 'VFH', vbh: 'VBH', smash: 'Smash' };
   return map[s] ?? s;

[NoCoverage] LogicalOperator
src/components/scoring/timeline-utils.ts:84:10
 export function golpeLabel(s?: string): string {
   if (!s) return '–';
   const map: Record<string, string> = { fh: 'FH', bh: 'BH', vfh: 'VFH', vbh: 'VBH', smash: 'Smash' };
-  return map[s] ?? s;
+  return map[s] && s;
 }
 

[NoCoverage] BlockStatement
src/components/scoring/timeline-utils.ts:87:50
   return map[s] ?? s;
 }
 
-export function direcaoLabel(s?: string): string {
-  if (!s) return '–';
-  const map: Record<string, string> = { cruzada: 'cruzada', paralela: 'paralela', centro: 'centro', inside_out: 'Inside-Out', inside_in: 'Inside-In', aberto: 'aberto', fechado: 'fechado' };
-  return map[s] ?? s;
-}
+export function direcaoLabel(s?: string): string {}
 
 export function efeitoLabel(s?: string): string {

[NoCoverage] ConditionalExpression
src/components/scoring/timeline-utils.ts:88:7
 }
 
 export function direcaoLabel(s?: string): string {
-  if (!s) return '–';
+  if (false) return '–';
   const map: Record<string, string> = { cruzada: 'cruzada', paralela: 'paralela', centro: 'centro', inside_out: 'Inside-Out', inside_in: 'Inside-In', aberto: 'aberto', fechado: 'fechado' };
   return map[s] ?? s;

[NoCoverage] ConditionalExpression
src/components/scoring/timeline-utils.ts:88:7
 }
 
 export function direcaoLabel(s?: string): string {
-  if (!s) return '–';
+  if (true) return '–';
   const map: Record<string, string> = { cruzada: 'cruzada', paralela: 'paralela', centro: 'centro', inside_out: 'Inside-Out', inside_in: 'Inside-In', aberto: 'aberto', fechado: 'fechado' };
   return map[s] ?? s;

[NoCoverage] StringLiteral
src/components/scoring/timeline-utils.ts:89:113
 
 export function direcaoLabel(s?: string): string {
   if (!s) return '–';
-  const map: Record<string, string> = { cruzada: 'cruzada', paralela: 'paralela', centro: 'centro', inside_out: 'Inside-Out', inside_in: 'Inside-In', aberto: 'aberto', fechado: 'fechado' };
+  const map: Record<string, string> = { cruzada: 'cruzada', paralela: 'paralela', centro: 'centro', inside_out: "", inside_in: 'Inside-In', aberto: 'aberto', fechado: 'fechado' };
   return map[s] ?? s;
 }

[NoCoverage] StringLiteral
src/components/scoring/timeline-utils.ts:89:91
 
 export function direcaoLabel(s?: string): string {
   if (!s) return '–';
-  const map: Record<string, string> = { cruzada: 'cruzada', paralela: 'paralela', centro: 'centro', inside_out: 'Inside-Out', inside_in: 'Inside-In', aberto: 'aberto', fechado: 'fechado' };
+  const map: Record<string, string> = { cruzada: 'cruzada', paralela: 'paralela', centro: "", inside_out: 'Inside-Out', inside_in: 'Inside-In', aberto: 'aberto', fechado: 'fechado' };
   return map[s] ?? s;
 }

[NoCoverage] LogicalOperator
src/components/scoring/timeline-utils.ts:90:10
 export function direcaoLabel(s?: string): string {
   if (!s) return '–';
   const map: Record<string, string> = { cruzada: 'cruzada', paralela: 'paralela', centro: 'centro', inside_out: 'Inside-Out', inside_in: 'Inside-In', aberto: 'aberto', fechado: 'fechado' };
-  return map[s] ?? s;
+  return map[s] && s;
 }
 

[NoCoverage] BlockStatement
src/components/scoring/timeline-utils.ts:93:49
   return map[s] ?? s;
 }
 
-export function efeitoLabel(s?: string): string {
-  if (!s) return '–';
-  return s;
-}
+export function efeitoLabel(s?: string): string {}
 
 export function golpeEspLabel(s?: string): string {

[NoCoverage] ConditionalExpression
src/components/scoring/timeline-utils.ts:94:7
 }
 
 export function efeitoLabel(s?: string): string {
-  if (!s) return '–';
+  if (false) return '–';
   return s;
 }

[NoCoverage] BooleanLiteral
src/components/scoring/timeline-utils.ts:94:7
 }
 
 export function efeitoLabel(s?: string): string {
-  if (!s) return '–';
+  if (s) return '–';
   return s;
 }

[NoCoverage] BlockStatement
src/components/scoring/timeline-utils.ts:98:51
   return s;
 }
 
-export function golpeEspLabel(s?: string): string {
-  if (!s) return '–';
-  const map: Record<string, string> = { lob: 'lob', drop_shot: 'drop', bate_pronto: 'bate-pronto', swing_volley: 'swingvolley' };
-  return map[s] ?? s;
-}
+export function golpeEspLabel(s?: string): string {}
 
 export function subtipo1Label(s?: string): string {

[NoCoverage] BooleanLiteral
src/components/scoring/timeline-utils.ts:99:7
 }
 
 export function golpeEspLabel(s?: string): string {
-  if (!s) return '–';
+  if (s) return '–';
   const map: Record<string, string> = { lob: 'lob', drop_shot: 'drop', bate_pronto: 'bate-pronto', swing_volley: 'swingvolley' };
   return map[s] ?? s;

[NoCoverage] ConditionalExpression
src/components/scoring/timeline-utils.ts:99:7
 }
 
 export function golpeEspLabel(s?: string): string {
-  if (!s) return '–';
+  if (false) return '–';
   const map: Record<string, string> = { lob: 'lob', drop_shot: 'drop', bate_pronto: 'bate-pronto', swing_volley: 'swingvolley' };
   return map[s] ?? s;

[NoCoverage] StringLiteral
src/components/scoring/timeline-utils.ts:100:114
 
 export function golpeEspLabel(s?: string): string {
   if (!s) return '–';
-  const map: Record<string, string> = { lob: 'lob', drop_shot: 'drop', bate_pronto: 'bate-pronto', swing_volley: 'swingvolley' };
+  const map: Record<string, string> = { lob: 'lob', drop_shot: 'drop', bate_pronto: 'bate-pronto', swing_volley: "" };
   return map[s] ?? s;
 }

[NoCoverage] ObjectLiteral
src/components/scoring/timeline-utils.ts:100:39
 
 export function golpeEspLabel(s?: string): string {
   if (!s) return '–';
-  const map: Record<string, string> = { lob: 'lob', drop_shot: 'drop', bate_pronto: 'bate-pronto', swing_volley: 'swingvolley' };
+  const map: Record<string, string> = {};
   return map[s] ?? s;
 }

[NoCoverage] LogicalOperator
src/components/scoring/timeline-utils.ts:101:10
 export function golpeEspLabel(s?: string): string {
   if (!s) return '–';
   const map: Record<string, string> = { lob: 'lob', drop_shot: 'drop', bate_pronto: 'bate-pronto', swing_volley: 'swingvolley' };
-  return map[s] ?? s;
+  return map[s] && s;
 }
 

[NoCoverage] BlockStatement
src/components/scoring/timeline-utils.ts:104:51
   return map[s] ?? s;
 }
 
-export function subtipo1Label(s?: string): string {
-  if (!s) return '–';
-  const map: Record<string, string> = { passing_shot: 'Passing Shot', devolucao_saque: 'Devolução' };
-  return map[s] ?? s;
-}
+export function subtipo1Label(s?: string): string {}
 
 export function subtipo2Label(s?: string): string {

[NoCoverage] ConditionalExpression
src/components/scoring/timeline-utils.ts:105:7
 }
 
 export function subtipo1Label(s?: string): string {
-  if (!s) return '–';
+  if (true) return '–';
   const map: Record<string, string> = { passing_shot: 'Passing Shot', devolucao_saque: 'Devolução' };
   return map[s] ?? s;

[NoCoverage] BooleanLiteral
src/components/scoring/timeline-utils.ts:105:7
 }
 
 export function subtipo1Label(s?: string): string {
-  if (!s) return '–';
+  if (s) return '–';
   const map: Record<string, string> = { passing_shot: 'Passing Shot', devolucao_saque: 'Devolução' };
   return map[s] ?? s;

[NoCoverage] LogicalOperator
src/components/scoring/timeline-utils.ts:107:10
 export function subtipo1Label(s?: string): string {
   if (!s) return '–';
   const map: Record<string, string> = { passing_shot: 'Passing Shot', devolucao_saque: 'Devolução' };
-  return map[s] ?? s;
+  return map[s] && s;
 }
 

[NoCoverage] BlockStatement
src/components/scoring/timeline-utils.ts:110:51
   return map[s] ?? s;
 }
 
-export function subtipo2Label(s?: string): string {
-  if (!s) return '–';
-  const map: Record<string, string> = { out: 'out', net: 'net' };
-  return map[s] ?? s;
-}
+export function subtipo2Label(s?: string): string {}
 
 export function trocasFaixaLabel(rallyLength?: number): string {

[NoCoverage] BooleanLiteral
src/components/scoring/timeline-utils.ts:111:7
 }
 
 export function subtipo2Label(s?: string): string {
-  if (!s) return '–';
+  if (s) return '–';
   const map: Record<string, string> = { out: 'out', net: 'net' };
   return map[s] ?? s;

[NoCoverage] ConditionalExpression
src/components/scoring/timeline-utils.ts:111:7
 }
 
 export function subtipo2Label(s?: string): string {
-  if (!s) return '–';
+  if (false) return '–';
   const map: Record<string, string> = { out: 'out', net: 'net' };
   return map[s] ?? s;

[NoCoverage] ObjectLiteral
src/components/scoring/timeline-utils.ts:112:39
 
 export function subtipo2Label(s?: string): string {
   if (!s) return '–';
-  const map: Record<string, string> = { out: 'out', net: 'net' };
+  const map: Record<string, string> = {};
   return map[s] ?? s;
 }

[NoCoverage] LogicalOperator
src/components/scoring/timeline-utils.ts:113:10
 export function subtipo2Label(s?: string): string {
   if (!s) return '–';
   const map: Record<string, string> = { out: 'out', net: 'net' };
-  return map[s] ?? s;
+  return map[s] && s;
 }
 

[NoCoverage] BlockStatement
src/components/scoring/timeline-utils.ts:116:64
   return map[s] ?? s;
 }
 
-export function trocasFaixaLabel(rallyLength?: number): string {
-  const n = rallyLength ?? 1;
-  if (n <= 2) return '1-2';
-  if (n <= 6) return '3-6';
-  if (n <= 10) return '7-10';
-  return '11+';
-}
+export function trocasFaixaLabel(rallyLength?: number): string {}
 
 export function tipoLabel(s?: string): string {

[NoCoverage] LogicalOperator
src/components/scoring/timeline-utils.ts:117:13
 }
 
 export function trocasFaixaLabel(rallyLength?: number): string {
-  const n = rallyLength ?? 1;
+  const n = rallyLength && 1;
   if (n <= 2) return '1-2';
   if (n <= 6) return '3-6';

[NoCoverage] EqualityOperator
src/components/scoring/timeline-utils.ts:118:7
 
 export function trocasFaixaLabel(rallyLength?: number): string {
   const n = rallyLength ?? 1;
-  if (n <= 2) return '1-2';
+  if (n < 2) return '1-2';
   if (n <= 6) return '3-6';
   if (n <= 10) return '7-10';

[NoCoverage] ConditionalExpression
src/components/scoring/timeline-utils.ts:118:7
 
 export function trocasFaixaLabel(rallyLength?: number): string {
   const n = rallyLength ?? 1;
-  if (n <= 2) return '1-2';
+  if (false) return '1-2';
   if (n <= 6) return '3-6';
   if (n <= 10) return '7-10';
