[NoCoverage] ConditionalExpression
src/components/scoring/timeline-utils.ts:119:7
 export function trocasFaixaLabel(rallyLength?: number): string {
   const n = rallyLength ?? 1;
   if (n <= 2) return '1-2';
-  if (n <= 6) return '3-6';
+  if (true) return '3-6';
   if (n <= 10) return '7-10';
   return '11+';

[NoCoverage] EqualityOperator
src/components/scoring/timeline-utils.ts:119:7
 export function trocasFaixaLabel(rallyLength?: number): string {
   const n = rallyLength ?? 1;
   if (n <= 2) return '1-2';
-  if (n <= 6) return '3-6';
+  if (n > 6) return '3-6';
   if (n <= 10) return '7-10';
   return '11+';

[NoCoverage] ConditionalExpression
src/components/scoring/timeline-utils.ts:120:7
   const n = rallyLength ?? 1;
   if (n <= 2) return '1-2';
   if (n <= 6) return '3-6';
-  if (n <= 10) return '7-10';
+  if (false) return '7-10';
   return '11+';
 }

[NoCoverage] EqualityOperator
src/components/scoring/timeline-utils.ts:120:7
   const n = rallyLength ?? 1;
   if (n <= 2) return '1-2';
   if (n <= 6) return '3-6';
-  if (n <= 10) return '7-10';
+  if (n < 10) return '7-10';
   return '11+';
 }

[NoCoverage] StringLiteral
src/components/scoring/timeline-utils.ts:121:10
   if (n <= 2) return '1-2';
   if (n <= 6) return '3-6';
   if (n <= 10) return '7-10';
-  return '11+';
+  return "";
 }
 

[NoCoverage] BlockStatement
src/components/scoring/timeline-utils.ts:124:47
   return '11+';
 }
 
-export function tipoLabel(s?: string): string {
-  if (!s) return '–';
-  const map: Record<string, string> = { winner: 'Winner', erro_nao_forcado: 'Erro Não Forçado', erro_forcado: 'Erro Forçado', dupla_falta: 'Dupla Falta' };
-  return map[s] ?? s;
-}
+export function tipoLabel(s?: string): string {}
 
 export function vencedorLabel(s?: string): string {

[NoCoverage] BooleanLiteral
src/components/scoring/timeline-utils.ts:125:7
 }
 
 export function tipoLabel(s?: string): string {
-  if (!s) return '–';
+  if (s) return '–';
   const map: Record<string, string> = { winner: 'Winner', erro_nao_forcado: 'Erro Não Forçado', erro_forcado: 'Erro Forçado', dupla_falta: 'Dupla Falta' };
   return map[s] ?? s;

[NoCoverage] ConditionalExpression
src/components/scoring/timeline-utils.ts:125:7
 }
 
 export function tipoLabel(s?: string): string {
-  if (!s) return '–';
+  if (false) return '–';
   const map: Record<string, string> = { winner: 'Winner', erro_nao_forcado: 'Erro Não Forçado', erro_forcado: 'Erro Forçado', dupla_falta: 'Dupla Falta' };
   return map[s] ?? s;

[NoCoverage] LogicalOperator
src/components/scoring/timeline-utils.ts:127:10
 export function tipoLabel(s?: string): string {
   if (!s) return '–';
   const map: Record<string, string> = { winner: 'Winner', erro_nao_forcado: 'Erro Não Forçado', erro_forcado: 'Erro Forçado', dupla_falta: 'Dupla Falta' };
-  return map[s] ?? s;
+  return map[s] && s;
 }
 

[NoCoverage] BlockStatement
src/components/scoring/timeline-utils.ts:130:51
   return map[s] ?? s;
 }
 
-export function vencedorLabel(s?: string): string {
-  if (!s) return '–';
-  const map: Record<string, string> = { sacador: 'Sacador', devolvedor: 'Devolvedor' };
-  return map[s] ?? s;
-}
+export function vencedorLabel(s?: string): string {}
 
 export interface FormattedPointDetails {

[NoCoverage] ConditionalExpression
src/components/scoring/timeline-utils.ts:131:7
 }
 
 export function vencedorLabel(s?: string): string {
-  if (!s) return '–';
+  if (true) return '–';
   const map: Record<string, string> = { sacador: 'Sacador', devolvedor: 'Devolvedor' };
   return map[s] ?? s;

[NoCoverage] BooleanLiteral
src/components/scoring/timeline-utils.ts:131:7
 }
 
 export function vencedorLabel(s?: string): string {
-  if (!s) return '–';
+  if (s) return '–';
   const map: Record<string, string> = { sacador: 'Sacador', devolvedor: 'Devolvedor' };
   return map[s] ?? s;

[NoCoverage] StringLiteral
src/components/scoring/timeline-utils.ts:132:73
 
 export function vencedorLabel(s?: string): string {
   if (!s) return '–';
-  const map: Record<string, string> = { sacador: 'Sacador', devolvedor: 'Devolvedor' };
+  const map: Record<string, string> = { sacador: 'Sacador', devolvedor: "" };
   return map[s] ?? s;
 }

[NoCoverage] LogicalOperator
src/components/scoring/timeline-utils.ts:133:10
 export function vencedorLabel(s?: string): string {
   if (!s) return '–';
   const map: Record<string, string> = { sacador: 'Sacador', devolvedor: 'Devolvedor' };
-  return map[s] ?? s;
+  return map[s] && s;
 }
 

[NoCoverage] ConditionalExpression
src/components/scoring/timeline-utils.ts:150:7
 }
 
 export function formatPointDetails(rd?: RallyDetails | null): FormattedPointDetails {
-  if (!rd) {
+  if (true) {
     return {
       short: '–',

[NoCoverage] BooleanLiteral
src/components/scoring/timeline-utils.ts:150:7
 }
 
 export function formatPointDetails(rd?: RallyDetails | null): FormattedPointDetails {
-  if (!rd) {
+  if (rd) {
     return {
       short: '–',

[NoCoverage] StringLiteral
src/components/scoring/timeline-utils.ts:153:13
   if (!rd) {
     return {
       short: '–',
-      full: '–',
+      full: "",
       tipo: '–',
       situacao: '–',

[NoCoverage] StringLiteral
src/components/scoring/timeline-utils.ts:156:14
       full: '–',
       tipo: '–',
       situacao: '–',
-      golpe: '–',
+      golpe: "",
       direcao: '–',
       efeito: '–',

[NoCoverage] StringLiteral
src/components/scoring/timeline-utils.ts:157:16
       tipo: '–',
       situacao: '–',
       golpe: '–',
-      direcao: '–',
+      direcao: "",
       efeito: '–',
       golpeEsp: '–',

[NoCoverage] StringLiteral
src/components/scoring/timeline-utils.ts:159:17
       golpe: '–',
       direcao: '–',
       efeito: '–',
-      golpeEsp: '–',
+      golpeEsp: "",
       subtipo1: '–',
       subtipo2: '–',

[NoCoverage] ArrayDeclaration
src/components/scoring/timeline-utils.ts:175:27
   const subtipo2 = subtipo2Label(rd.subtipo2);
   const vencedor = vencedorLabel(rd.vencedor);
 
-  const parts: string[] = [vencedor];
+  const parts: string[] = [];
   parts.push(situacao);
   parts.push(tipo);

[NoCoverage] ConditionalExpression
src/components/scoring/timeline-utils.ts:178:7
   const parts: string[] = [vencedor];
   parts.push(situacao);
   parts.push(tipo);
-  if (rd.golpe) parts.push(golpe);
+  if (true) parts.push(golpe);
   if (rd.subtipo1) parts.push(subtipo1);
   if (rd.subtipo2) parts.push(subtipo2);

[NoCoverage] ConditionalExpression
src/components/scoring/timeline-utils.ts:178:7
   const parts: string[] = [vencedor];
   parts.push(situacao);
   parts.push(tipo);
-  if (rd.golpe) parts.push(golpe);
+  if (false) parts.push(golpe);
   if (rd.subtipo1) parts.push(subtipo1);
   if (rd.subtipo2) parts.push(subtipo2);

[NoCoverage] ConditionalExpression
src/components/scoring/timeline-utils.ts:179:7
   parts.push(situacao);
   parts.push(tipo);
   if (rd.golpe) parts.push(golpe);
-  if (rd.subtipo1) parts.push(subtipo1);
+  if (false) parts.push(subtipo1);
   if (rd.subtipo2) parts.push(subtipo2);
   if (rd.efeito) parts.push(efeito);

[NoCoverage] ConditionalExpression
src/components/scoring/timeline-utils.ts:179:7
   parts.push(situacao);
   parts.push(tipo);
   if (rd.golpe) parts.push(golpe);
-  if (rd.subtipo1) parts.push(subtipo1);
+  if (true) parts.push(subtipo1);
   if (rd.subtipo2) parts.push(subtipo2);
   if (rd.efeito) parts.push(efeito);

[NoCoverage] ConditionalExpression
src/components/scoring/timeline-utils.ts:180:7
   parts.push(tipo);
   if (rd.golpe) parts.push(golpe);
   if (rd.subtipo1) parts.push(subtipo1);
-  if (rd.subtipo2) parts.push(subtipo2);
+  if (true) parts.push(subtipo2);
   if (rd.efeito) parts.push(efeito);
   if (rd.direcao) parts.push(direcao);

[NoCoverage] ConditionalExpression
src/components/scoring/timeline-utils.ts:180:7
   parts.push(tipo);
   if (rd.golpe) parts.push(golpe);
   if (rd.subtipo1) parts.push(subtipo1);
-  if (rd.subtipo2) parts.push(subtipo2);
+  if (false) parts.push(subtipo2);
   if (rd.efeito) parts.push(efeito);
   if (rd.direcao) parts.push(direcao);

[NoCoverage] ConditionalExpression
src/components/scoring/timeline-utils.ts:181:7
   if (rd.golpe) parts.push(golpe);
   if (rd.subtipo1) parts.push(subtipo1);
   if (rd.subtipo2) parts.push(subtipo2);
-  if (rd.efeito) parts.push(efeito);
+  if (false) parts.push(efeito);
   if (rd.direcao) parts.push(direcao);
   if (rd.golpe_esp) parts.push(golpeEsp);

[NoCoverage] ConditionalExpression
src/components/scoring/timeline-utils.ts:181:7
   if (rd.golpe) parts.push(golpe);
   if (rd.subtipo1) parts.push(subtipo1);
   if (rd.subtipo2) parts.push(subtipo2);
-  if (rd.efeito) parts.push(efeito);
+  if (true) parts.push(efeito);
   if (rd.direcao) parts.push(direcao);
   if (rd.golpe_esp) parts.push(golpeEsp);

[NoCoverage] ConditionalExpression
src/components/scoring/timeline-utils.ts:182:7
   if (rd.subtipo1) parts.push(subtipo1);
   if (rd.subtipo2) parts.push(subtipo2);
   if (rd.efeito) parts.push(efeito);
-  if (rd.direcao) parts.push(direcao);
+  if (true) parts.push(direcao);
   if (rd.golpe_esp) parts.push(golpeEsp);
 

[NoCoverage] ConditionalExpression
src/components/scoring/timeline-utils.ts:182:7
   if (rd.subtipo1) parts.push(subtipo1);
   if (rd.subtipo2) parts.push(subtipo2);
   if (rd.efeito) parts.push(efeito);
-  if (rd.direcao) parts.push(direcao);
+  if (false) parts.push(direcao);
   if (rd.golpe_esp) parts.push(golpeEsp);
 

[NoCoverage] ConditionalExpression
src/components/scoring/timeline-utils.ts:183:7
   if (rd.subtipo2) parts.push(subtipo2);
   if (rd.efeito) parts.push(efeito);
   if (rd.direcao) parts.push(direcao);
-  if (rd.golpe_esp) parts.push(golpeEsp);
+  if (true) parts.push(golpeEsp);
 
   return {

[NoCoverage] ConditionalExpression
src/components/scoring/timeline-utils.ts:183:7
   if (rd.subtipo2) parts.push(subtipo2);
   if (rd.efeito) parts.push(efeito);
   if (rd.direcao) parts.push(direcao);
-  if (rd.golpe_esp) parts.push(golpeEsp);
+  if (false) parts.push(golpeEsp);
 
   return {

[NoCoverage] ObjectLiteral
src/components/scoring/timeline-utils.ts:185:10
   if (rd.direcao) parts.push(direcao);
   if (rd.golpe_esp) parts.push(golpeEsp);
 
-  return {
-    short: `${situacao} • ${golpe}`,
-    full: parts.filter(Boolean).join(' • '),
-    tipo,
-    situacao,
-    golpe,
-    direcao,
-    efeito,
-    golpeEsp,
-    subtipo1,
-    subtipo2,
-  };
+  return {};
 }
 

[NoCoverage] StringLiteral
src/components/scoring/timeline-utils.ts:186:12
   if (rd.golpe_esp) parts.push(golpeEsp);
 
   return {
-    short: `${situacao} • ${golpe}`,
+    short: ``,
     full: parts.filter(Boolean).join(' • '),
     tipo,

[NoCoverage] MethodExpression
src/components/scoring/timeline-utils.ts:187:11
 
   return {
     short: `${situacao} • ${golpe}`,
-    full: parts.filter(Boolean).join(' • '),
+    full: parts.join(' • '),
     tipo,
     situacao,

[NoCoverage] BlockStatement
src/components/scoring/timeline-utils.ts:199:75
   };
 }
 
-export function formatPointDetailsShort(rd?: RallyDetails | null): string {
-  return formatPointDetails(rd).short;
-}
+export function formatPointDetailsShort(rd?: RallyDetails | null): string {}
 
 export function formatPointDetailsFull(rd?: RallyDetails | null): string {

[NoCoverage] BlockStatement
src/components/scoring/timeline-utils.ts:203:74
   return formatPointDetails(rd).short;
 }
 
-export function formatPointDetailsFull(rd?: RallyDetails | null): string {
-  return formatPointDetails(rd).full;
-}
+export function formatPointDetailsFull(rd?: RallyDetails | null): string {}
 
 export function getPointDetailSummary(rd?: RallyDetails | null): {

[NoCoverage] BlockStatement
src/components/scoring/timeline-utils.ts:210:3
 export function getPointDetailSummary(rd?: RallyDetails | null): {
   label: string;
   color: 'green' | 'red' | 'amber' | 'gray';
-} {
-  if (!rd) return { label: '–', color: 'gray' };
-
-  if (rd.tipo === 'winner') {
-    return { label: 'Winner', color: 'green' };
-  }
-  if (rd.tipo === 'erro_nao_forcado') {
-    return { label: 'ENF', color: 'red' };
-  }
-  if (rd.tipo === 'erro_forcado') {
-    return { label: 'EF', color: 'amber' };
-  }
-  if (rd.tipo === 'dupla_falta') {
-    return { label: 'DF', color: 'red' };
-  }
-  return { label: tipoLabel(rd.tipo), color: 'gray' };
-}
+} {}
 
 export type ValidationResult<T> =

[NoCoverage] BooleanLiteral
src/components/scoring/timeline-utils.ts:211:7
   label: string;
   color: 'green' | 'red' | 'amber' | 'gray';
 } {
-  if (!rd) return { label: '–', color: 'gray' };
+  if (rd) return { label: '–', color: 'gray' };
 
   if (rd.tipo === 'winner') {

[NoCoverage] ConditionalExpression
src/components/scoring/timeline-utils.ts:211:7
   label: string;
   color: 'green' | 'red' | 'amber' | 'gray';
 } {
-  if (!rd) return { label: '–', color: 'gray' };
+  if (false) return { label: '–', color: 'gray' };
 
   if (rd.tipo === 'winner') {

[NoCoverage] EqualityOperator
src/components/scoring/timeline-utils.ts:213:7
 } {
   if (!rd) return { label: '–', color: 'gray' };
 
-  if (rd.tipo === 'winner') {
+  if (rd.tipo !== 'winner') {
     return { label: 'Winner', color: 'green' };
   }

[NoCoverage] ConditionalExpression
src/components/scoring/timeline-utils.ts:213:7
 } {
   if (!rd) return { label: '–', color: 'gray' };
 
-  if (rd.tipo === 'winner') {
+  if (true) {
     return { label: 'Winner', color: 'green' };
   }

[NoCoverage] StringLiteral
src/components/scoring/timeline-utils.ts:214:38
   if (!rd) return { label: '–', color: 'gray' };
 
   if (rd.tipo === 'winner') {
-    return { label: 'Winner', color: 'green' };
+    return { label: 'Winner', color: "" };
   }
   if (rd.tipo === 'erro_nao_forcado') {

[NoCoverage] EqualityOperator
src/components/scoring/timeline-utils.ts:216:7
   if (rd.tipo === 'winner') {
     return { label: 'Winner', color: 'green' };
   }
-  if (rd.tipo === 'erro_nao_forcado') {
+  if (rd.tipo !== 'erro_nao_forcado') {
     return { label: 'ENF', color: 'red' };
   }

[NoCoverage] ConditionalExpression
src/components/scoring/timeline-utils.ts:216:7
   if (rd.tipo === 'winner') {
     return { label: 'Winner', color: 'green' };
   }
-  if (rd.tipo === 'erro_nao_forcado') {
+  if (false) {
     return { label: 'ENF', color: 'red' };
   }

[NoCoverage] ConditionalExpression
src/components/scoring/timeline-utils.ts:219:7
   if (rd.tipo === 'erro_nao_forcado') {
     return { label: 'ENF', color: 'red' };
   }
-  if (rd.tipo === 'erro_forcado') {
+  if (false) {
     return { label: 'EF', color: 'amber' };
   }

[NoCoverage] EqualityOperator
src/components/scoring/timeline-utils.ts:219:7
   if (rd.tipo === 'erro_nao_forcado') {
     return { label: 'ENF', color: 'red' };
   }
-  if (rd.tipo === 'erro_forcado') {
+  if (rd.tipo !== 'erro_forcado') {
     return { label: 'EF', color: 'amber' };
   }

[NoCoverage] StringLiteral
src/components/scoring/timeline-utils.ts:220:34
     return { label: 'ENF', color: 'red' };
   }
   if (rd.tipo === 'erro_forcado') {
-    return { label: 'EF', color: 'amber' };
+    return { label: 'EF', color: "" };
   }
   if (rd.tipo === 'dupla_falta') {

[NoCoverage] ObjectLiteral
src/components/scoring/timeline-utils.ts:220:12
     return { label: 'ENF', color: 'red' };
   }
   if (rd.tipo === 'erro_forcado') {
-    return { label: 'EF', color: 'amber' };
+    return {};
   }
   if (rd.tipo === 'dupla_falta') {

[NoCoverage] BlockStatement
src/components/scoring/timeline-utils.ts:222:34
   if (rd.tipo === 'erro_forcado') {
     return { label: 'EF', color: 'amber' };
   }
-  if (rd.tipo === 'dupla_falta') {
-    return { label: 'DF', color: 'red' };
-  }
+  if (rd.tipo === 'dupla_falta') {}
   return { label: tipoLabel(rd.tipo), color: 'gray' };
 }

[NoCoverage] ConditionalExpression
src/components/scoring/timeline-utils.ts:222:7
   if (rd.tipo === 'erro_forcado') {
     return { label: 'EF', color: 'amber' };
   }
-  if (rd.tipo === 'dupla_falta') {
+  if (false) {
     return { label: 'DF', color: 'red' };
   }

[NoCoverage] StringLiteral
src/components/scoring/timeline-utils.ts:223:34
     return { label: 'EF', color: 'amber' };
   }
   if (rd.tipo === 'dupla_falta') {
-    return { label: 'DF', color: 'red' };
+    return { label: 'DF', color: "" };
   }
   return { label: tipoLabel(rd.tipo), color: 'gray' };

[NoCoverage] BlockStatement
src/components/scoring/timeline-utils.ts:232:107
   | { success: true; data: T }
   | { success: false; errors: Record<string, string> };
 
-export function validateRallyDetails(data: unknown): ValidationResult<z.infer<typeof RallyDetailsSchema>> {
-  const result = RallyDetailsSchema.safeParse(data);
-  if (result.success) {
-    return { success: true, data: result.data };
-  }
-
-  const errors: Record<string, string> = {};
-  for (const issue of result.error.issues) {
-    const path = issue.path.join('.') || 'root';
-    errors[path] = issue.message;
-  }
-  return { success: false, errors };
-}
+export function validateRallyDetails(data: unknown): ValidationResult<z.infer<typeof RallyDetailsSchema>> {}
 
 export function validateSituacao(value: unknown): ValidationResult<z.infer<typeof RallySituacaoSchema>> {

[NoCoverage] ConditionalExpression
src/components/scoring/timeline-utils.ts:234:7
 
 export function validateRallyDetails(data: unknown): ValidationResult<z.infer<typeof RallyDetailsSchema>> {
   const result = RallyDetailsSchema.safeParse(data);
-  if (result.success) {
+  if (true) {
     return { success: true, data: result.data };
   }

[NoCoverage] ConditionalExpression
src/components/scoring/timeline-utils.ts:234:7
 
 export function validateRallyDetails(data: unknown): ValidationResult<z.infer<typeof RallyDetailsSchema>> {
   const result = RallyDetailsSchema.safeParse(data);
-  if (result.success) {
+  if (false) {
     return { success: true, data: result.data };
   }

[NoCoverage] BooleanLiteral
src/components/scoring/timeline-utils.ts:235:23
 export function validateRallyDetails(data: unknown): ValidationResult<z.infer<typeof RallyDetailsSchema>> {
   const result = RallyDetailsSchema.safeParse(data);
   if (result.success) {
-    return { success: true, data: result.data };
+    return { success: false, data: result.data };
   }
 

[NoCoverage] BlockStatement
src/components/scoring/timeline-utils.ts:239:44
   }
 
   const errors: Record<string, string> = {};
-  for (const issue of result.error.issues) {
-    const path = issue.path.join('.') || 'root';
-    errors[path] = issue.message;
-  }
+  for (const issue of result.error.issues) {}
   return { success: false, errors };
 }

[NoCoverage] ConditionalExpression
src/components/scoring/timeline-utils.ts:240:18
 
   const errors: Record<string, string> = {};
   for (const issue of result.error.issues) {
-    const path = issue.path.join('.') || 'root';
+    const path = true;
     errors[path] = issue.message;
   }

[NoCoverage] LogicalOperator
src/components/scoring/timeline-utils.ts:240:18
 
   const errors: Record<string, string> = {};
   for (const issue of result.error.issues) {
-    const path = issue.path.join('.') || 'root';
+    const path = issue.path.join('.') && 'root';
     errors[path] = issue.message;
   }

[NoCoverage] BooleanLiteral
src/components/scoring/timeline-utils.ts:243:21
     const path = issue.path.join('.') || 'root';
     errors[path] = issue.message;
   }
-  return { success: false, errors };
+  return { success: true, errors };
 }
 

[NoCoverage] ObjectLiteral
src/components/scoring/timeline-utils.ts:243:10
     const path = issue.path.join('.') || 'root';
     errors[path] = issue.message;
   }
-  return { success: false, errors };
+  return {};
 }
 

[NoCoverage] BlockStatement
src/components/scoring/timeline-utils.ts:246:105
   return { success: false, errors };
 }
 
-export function validateSituacao(value: unknown): ValidationResult<z.infer<typeof RallySituacaoSchema>> {
-  return safeEnumValidate(RallySituacaoSchema, value, 'situacao');
-}
+export function validateSituacao(value: unknown): ValidationResult<z.infer<typeof RallySituacaoSchema>> {}
 
 export function validateTipo(value: unknown): ValidationResult<z.infer<typeof RallyTipoSchema>> {

[NoCoverage] BlockStatement
src/components/scoring/timeline-utils.ts:250:97
   return safeEnumValidate(RallySituacaoSchema, value, 'situacao');
 }
 
-export function validateTipo(value: unknown): ValidationResult<z.infer<typeof RallyTipoSchema>> {
-  return safeEnumValidate(RallyTipoSchema, value, 'tipo');
-}
+export function validateTipo(value: unknown): ValidationResult<z.infer<typeof RallyTipoSchema>> {}
 
 export function validateGolpe(value: unknown): ValidationResult<z.infer<typeof RallyGolpeSchema>> {

[NoCoverage] BlockStatement
src/components/scoring/timeline-utils.ts:254:99
   return safeEnumValidate(RallyTipoSchema, value, 'tipo');
 }
 
-export function validateGolpe(value: unknown): ValidationResult<z.infer<typeof RallyGolpeSchema>> {
-  return safeEnumValidate(RallyGolpeSchema, value, 'golpe');
-}
+export function validateGolpe(value: unknown): ValidationResult<z.infer<typeof RallyGolpeSchema>> {}
 
 export function validateEfeito(value: unknown): ValidationResult<z.infer<typeof RallyEfeitoSchema>> {

[NoCoverage] BlockStatement
src/components/scoring/timeline-utils.ts:258:101
   return safeEnumValidate(RallyGolpeSchema, value, 'golpe');
 }
 
-export function validateEfeito(value: unknown): ValidationResult<z.infer<typeof RallyEfeitoSchema>> {
-  return safeEnumValidate(RallyEfeitoSchema, value, 'efeito');
-}
+export function validateEfeito(value: unknown): ValidationResult<z.infer<typeof RallyEfeitoSchema>> {}
 
 export function validateDirecao(value: unknown): ValidationResult<z.infer<typeof RallyDirecaoSchema>> {

[NoCoverage] BlockStatement
src/components/scoring/timeline-utils.ts:262:103
   return safeEnumValidate(RallyEfeitoSchema, value, 'efeito');
 }
 
-export function validateDirecao(value: unknown): ValidationResult<z.infer<typeof RallyDirecaoSchema>> {
-  return safeEnumValidate(RallyDirecaoSchema, value, 'direcao');
-}
+export function validateDirecao(value: unknown): ValidationResult<z.infer<typeof RallyDirecaoSchema>> {}
 
 export function validateGolpeEsp(value: unknown): ValidationResult<z.infer<typeof RallyGolpeEspSchema>> {

[NoCoverage] BlockStatement
src/components/scoring/timeline-utils.ts:266:105
   return safeEnumValidate(RallyDirecaoSchema, value, 'direcao');
 }
 
-export function validateGolpeEsp(value: unknown): ValidationResult<z.infer<typeof RallyGolpeEspSchema>> {
-  return safeEnumValidate(RallyGolpeEspSchema, value, 'golpe_esp');
-}
+export function validateGolpeEsp(value: unknown): ValidationResult<z.infer<typeof RallyGolpeEspSchema>> {}
 
 function safeEnumValidate<T extends z.ZodTypeAny>(

[NoCoverage] BlockStatement
src/components/scoring/timeline-utils.ts:274:33
   schema: T,
   value: unknown,
   fieldName: string,
-): ValidationResult<z.infer<T>> {
-  const result = schema.safeParse(value);
-  if (result.success) {
-    return { success: true, data: result.data };
-  }
-  return { success: false, errors: { [fieldName]: result.error.issues[0]?.message ?? 'Invalid value' } };
-}
+): ValidationResult<z.infer<T>> {}
 
 export function isValidRallyDetails(data: unknown): data is z.infer<typeof RallyDetailsSchema> {

[NoCoverage] BlockStatement
src/components/scoring/timeline-utils.ts:276:23
   fieldName: string,
 ): ValidationResult<z.infer<T>> {
   const result = schema.safeParse(value);
-  if (result.success) {
-    return { success: true, data: result.data };
-  }
+  if (result.success) {}
   return { success: false, errors: { [fieldName]: result.error.issues[0]?.message ?? 'Invalid value' } };
 }

[NoCoverage] ConditionalExpression
src/components/scoring/timeline-utils.ts:276:7
   fieldName: string,
 ): ValidationResult<z.infer<T>> {
   const result = schema.safeParse(value);
-  if (result.success) {
+  if (true) {
     return { success: true, data: result.data };
   }

[NoCoverage] ObjectLiteral
src/components/scoring/timeline-utils.ts:277:12
 ): ValidationResult<z.infer<T>> {
   const result = schema.safeParse(value);
   if (result.success) {
-    return { success: true, data: result.data };
+    return {};
   }
   return { success: false, errors: { [fieldName]: result.error.issues[0]?.message ?? 'Invalid value' } };

[NoCoverage] LogicalOperator
src/components/scoring/timeline-utils.ts:279:51
   if (result.success) {
     return { success: true, data: result.data };
   }
-  return { success: false, errors: { [fieldName]: result.error.issues[0]?.message ?? 'Invalid value' } };
+  return { success: false, errors: { [fieldName]: result.error.issues[0]?.message && 'Invalid value' } };
 }
 

[NoCoverage] BooleanLiteral
src/components/scoring/timeline-utils.ts:279:21
   if (result.success) {
     return { success: true, data: result.data };
   }
-  return { success: false, errors: { [fieldName]: result.error.issues[0]?.message ?? 'Invalid value' } };
+  return { success: true, errors: { [fieldName]: result.error.issues[0]?.message ?? 'Invalid value' } };
 }
 

[NoCoverage] BlockStatement
src/components/scoring/timeline-utils.ts:282:96
   return { success: false, errors: { [fieldName]: result.error.issues[0]?.message ?? 'Invalid value' } };
 }
 
-export function isValidRallyDetails(data: unknown): data is z.infer<typeof RallyDetailsSchema> {
-  return RallyDetailsSchema.safeParse(data).success;
-}
+export function isValidRallyDetails(data: unknown): data is z.infer<typeof RallyDetailsSchema> {}
 
 export interface PointLogAudioMeta {

[NoCoverage] BlockStatement
src/components/scoring/timeline-utils.ts:295:20
 export function enrichTimelineWithAudio(
   points: TimelinePoint[],
   pointLogs: PointLogAudioMeta[],
-): TimelinePoint[] {
-  const audioMap = new Map(pointLogs.map(pl => [pl.pointLogId, pl]));
-  return points.map((p, i) => {
-    const meta = pointLogs[i];
-    if (meta && audioMap.has(meta.pointLogId)) {
-      return {
-        ...p,
-        pointId: meta.pointLogId,
-        hasAudioNote: meta.hasAudioNote,
-        audioNoteDuration: meta.audioNoteDuration ?? undefined,
-      };
-    }
-    return p;
-  });
-}
+): TimelinePoint[] {}
 

[NoCoverage] ArrowFunction
src/components/scoring/timeline-utils.ts:296:42
   points: TimelinePoint[],
   pointLogs: PointLogAudioMeta[],
 ): TimelinePoint[] {
-  const audioMap = new Map(pointLogs.map(pl => [pl.pointLogId, pl]));
+  const audioMap = new Map(pointLogs.map(() => undefined));
   return points.map((p, i) => {
     const meta = pointLogs[i];

[NoCoverage] ArrayDeclaration
src/components/scoring/timeline-utils.ts:296:48
   points: TimelinePoint[],
   pointLogs: PointLogAudioMeta[],
 ): TimelinePoint[] {
-  const audioMap = new Map(pointLogs.map(pl => [pl.pointLogId, pl]));
+  const audioMap = new Map(pointLogs.map(pl => []));
   return points.map((p, i) => {
     const meta = pointLogs[i];

[NoCoverage] BlockStatement
src/components/scoring/timeline-utils.ts:297:31
   pointLogs: PointLogAudioMeta[],
 ): TimelinePoint[] {
   const audioMap = new Map(pointLogs.map(pl => [pl.pointLogId, pl]));
-  return points.map((p, i) => {
-    const meta = pointLogs[i];
-    if (meta && audioMap.has(meta.pointLogId)) {
-      return {
-        ...p,
-        pointId: meta.pointLogId,
-        hasAudioNote: meta.hasAudioNote,
-        audioNoteDuration: meta.audioNoteDuration ?? undefined,
-      };
-    }
-    return p;
-  });
+  return points.map((p, i) => {});
 }
 

[NoCoverage] BlockStatement
src/components/scoring/timeline-utils.ts:299:48
   const audioMap = new Map(pointLogs.map(pl => [pl.pointLogId, pl]));
   return points.map((p, i) => {
     const meta = pointLogs[i];
-    if (meta && audioMap.has(meta.pointLogId)) {
-      return {
-        ...p,
-        pointId: meta.pointLogId,
-        hasAudioNote: meta.hasAudioNote,
-        audioNoteDuration: meta.audioNoteDuration ?? undefined,
-      };
-    }
+    if (meta && audioMap.has(meta.pointLogId)) {}
     return p;
   });

[NoCoverage] ConditionalExpression
src/components/scoring/timeline-utils.ts:299:9
   const audioMap = new Map(pointLogs.map(pl => [pl.pointLogId, pl]));
   return points.map((p, i) => {
     const meta = pointLogs[i];
-    if (meta && audioMap.has(meta.pointLogId)) {
+    if (false) {
       return {
         ...p,

[NoCoverage] ObjectLiteral
src/components/scoring/timeline-utils.ts:300:14
   return points.map((p, i) => {
     const meta = pointLogs[i];
     if (meta && audioMap.has(meta.pointLogId)) {
-      return {
-        ...p,
-        pointId: meta.pointLogId,
-        hasAudioNote: meta.hasAudioNote,
-        audioNoteDuration: meta.audioNoteDuration ?? undefined,
-      };
+      return {};
     }
     return p;

[NoCoverage] LogicalOperator
src/components/scoring/timeline-utils.ts:304:28
         ...p,
         pointId: meta.pointLogId,
         hasAudioNote: meta.hasAudioNote,
-        audioNoteDuration: meta.audioNoteDuration ?? undefined,
+        audioNoteDuration: meta.audioNoteDuration && undefined,
       };
     }
