[NoCoverage] StringLiteral
src/schemas/contracts.ts:3:50
 import { z } from "zod";
 
-export const VencedorSchema = z.enum(["sacador", "devolvedor"]);
+export const VencedorSchema = z.enum(["sacador", ""]);
 export type Vencedor = z.infer<typeof VencedorSchema>;
 

[NoCoverage] ArrayDeclaration
src/schemas/contracts.ts:6:43
 export const VencedorSchema = z.enum(["sacador", "devolvedor"]);
 export type Vencedor = z.infer<typeof VencedorSchema>;
 
-export const RallySituacaoSchema = z.enum([
-  "devolucao",
-  "fundo",
-  "passada",
-  "rede",
-  "saque",
-]);
+export const RallySituacaoSchema = z.enum([]);
 export type RallySituacao = z.infer<typeof RallySituacaoSchema>;
 

[NoCoverage] StringLiteral
src/schemas/contracts.ts:11:3
   "fundo",
   "passada",
   "rede",
-  "saque",
+  "",
 ]);
 export type RallySituacao = z.infer<typeof RallySituacaoSchema>;

[NoCoverage] StringLiteral
src/schemas/contracts.ts:16:3
 export type RallySituacao = z.infer<typeof RallySituacaoSchema>;
 
 export const RallyTipoSchema = z.enum([
-  "erro_nao_forcado",
+  "",
   "erro_forcado",
   "winner",

[NoCoverage] StringLiteral
src/schemas/contracts.ts:17:3
 
 export const RallyTipoSchema = z.enum([
   "erro_nao_forcado",
-  "erro_forcado",
+  "",
   "winner",
   "dupla_falta",

[NoCoverage] StringLiteral
src/schemas/contracts.ts:18:3
 export const RallyTipoSchema = z.enum([
   "erro_nao_forcado",
   "erro_forcado",
-  "winner",
+  "",
   "dupla_falta",
 ]);

[NoCoverage] StringLiteral
src/schemas/contracts.ts:19:3
   "erro_nao_forcado",
   "erro_forcado",
   "winner",
-  "dupla_falta",
+  "",
 ]);
 export type RallyTipo = z.infer<typeof RallyTipoSchema>;

[NoCoverage] StringLiteral
src/schemas/contracts.ts:23:60
 ]);
 export type RallyTipo = z.infer<typeof RallyTipoSchema>;
 
-export const RallyGolpeSchema = z.enum(["fh", "bh", "vfh", "vbh", "smash", "saque"]);
+export const RallyGolpeSchema = z.enum(["fh", "bh", "vfh", "", "smash", "saque"]);
 export type RallyGolpe = z.infer<typeof RallyGolpeSchema>;
 

[NoCoverage] StringLiteral
src/schemas/contracts.ts:23:53
 ]);
 export type RallyTipo = z.infer<typeof RallyTipoSchema>;
 
-export const RallyGolpeSchema = z.enum(["fh", "bh", "vfh", "vbh", "smash", "saque"]);
+export const RallyGolpeSchema = z.enum(["fh", "bh", "", "vbh", "smash", "saque"]);
 export type RallyGolpe = z.infer<typeof RallyGolpeSchema>;
 

[NoCoverage] ArrayDeclaration
src/schemas/contracts.ts:29:43
 export const RallySubtipo1Schema = z.enum(["passing_shot", "devolucao_saque"]);
 export type RallySubtipo1 = z.infer<typeof RallySubtipo1Schema>;
 
-export const RallySubtipo2Schema = z.enum(["out", "net"]);
+export const RallySubtipo2Schema = z.enum([]);
 export type RallySubtipo2 = z.infer<typeof RallySubtipo2Schema>;
 

[NoCoverage] StringLiteral
src/schemas/contracts.ts:29:44
 export const RallySubtipo1Schema = z.enum(["passing_shot", "devolucao_saque"]);
 export type RallySubtipo1 = z.infer<typeof RallySubtipo1Schema>;
 
-export const RallySubtipo2Schema = z.enum(["out", "net"]);
+export const RallySubtipo2Schema = z.enum(["", "net"]);
 export type RallySubtipo2 = z.infer<typeof RallySubtipo2Schema>;
 

[NoCoverage] ArrayDeclaration
src/schemas/contracts.ts:32:41
 export const RallySubtipo2Schema = z.enum(["out", "net"]);
 export type RallySubtipo2 = z.infer<typeof RallySubtipo2Schema>;
 
-export const RallyEfeitoSchema = z.enum(["topspin", "slice", "flat"]);
+export const RallyEfeitoSchema = z.enum([]);
 export type RallyEfeito = z.infer<typeof RallyEfeitoSchema>;
 

[NoCoverage] StringLiteral
src/schemas/contracts.ts:38:3
 export const RallyDirecaoSchema = z.enum([
   "cruzada",
   "paralela",
-  "centro",
+  "",
   "inside_out",
   "inside_in",

[NoCoverage] StringLiteral
src/schemas/contracts.ts:39:3
   "cruzada",
   "paralela",
   "centro",
-  "inside_out",
+  "",
   "inside_in",
   "aberto",

[NoCoverage] StringLiteral
src/schemas/contracts.ts:42:3
   "inside_out",
   "inside_in",
   "aberto",
-  "fechado",
+  "",
 ]);
 export type RallyDirecao = z.infer<typeof RallyDirecaoSchema>;

[NoCoverage] StringLiteral
src/schemas/contracts.ts:47:3
 export type RallyDirecao = z.infer<typeof RallyDirecaoSchema>;
 
 export const RallyGolpeEspSchema = z.enum([
-  "lob",
+  "",
   "drop_shot",
   "bate_pronto",

[NoCoverage] StringLiteral
src/schemas/contracts.ts:54:44
 ]);
 export type RallyGolpeEsp = z.infer<typeof RallyGolpeEspSchema>;
 
-export const RallyDurationSchema = z.enum(["opcao_1", "opcao_2", "opcao_3"]);
+export const RallyDurationSchema = z.enum(["", "opcao_2", "opcao_3"]);
 export type RallyDuration = z.infer<typeof RallyDurationSchema>;
 

[NoCoverage] StringLiteral
src/schemas/contracts.ts:54:55
 ]);
 export type RallyGolpeEsp = z.infer<typeof RallyGolpeEspSchema>;
 
-export const RallyDurationSchema = z.enum(["opcao_1", "opcao_2", "opcao_3"]);
+export const RallyDurationSchema = z.enum(["opcao_1", "", "opcao_3"]);
 export type RallyDuration = z.infer<typeof RallyDurationSchema>;
 

[NoCoverage] MethodExpression
src/schemas/contracts.ts:68:17
   subtipo1: RallySubtipo1Schema.optional(),
   subtipo2: RallySubtipo2Schema.optional(),
   duracao: RallyDurationSchema.optional(),
-  previewBalls: z.number().int().min(0),
+  previewBalls: z.number().int().max(0),
   rallyLength: z.number().int().min(0).optional(),
   note: z.string().max(500).optional(),

[NoCoverage] MethodExpression
src/schemas/contracts.ts:69:16
   subtipo2: RallySubtipo2Schema.optional(),
   duracao: RallyDurationSchema.optional(),
   previewBalls: z.number().int().min(0),
-  rallyLength: z.number().int().min(0).optional(),
+  rallyLength: z.number().int().max(0).optional(),
   note: z.string().max(500).optional(),
 });

[NoCoverage] MethodExpression
src/schemas/contracts.ts:70:9
   duracao: RallyDurationSchema.optional(),
   previewBalls: z.number().int().min(0),
   rallyLength: z.number().int().min(0).optional(),
-  note: z.string().max(500).optional(),
+  note: z.string().min(500).optional(),
 });
 export type RallyDetails = z.infer<typeof RallyDetailsSchema>;

[NoCoverage] StringLiteral
src/schemas/contracts.ts:79:3
   "GESTOR",
   "COACH",
   "ATHLETE",
-  "SPECTATOR",
+  "",
 ]);
 export type Role = z.infer<typeof RoleSchema>;

[NoCoverage] ArrayDeclaration
src/schemas/contracts.ts:83:40
 ]);
 export type Role = z.infer<typeof RoleSchema>;
 
-export const MatchStateSchema = z.enum([
-  "SCHEDULED",
-  "IN_PROGRESS",
-  "FINISHED",
-  "CANCELLED",
-]);
+export const MatchStateSchema = z.enum([]);
 export type MatchState = z.infer<typeof MatchStateSchema>;
 

[NoCoverage] StringLiteral
src/schemas/contracts.ts:84:3
 export type Role = z.infer<typeof RoleSchema>;
 
 export const MatchStateSchema = z.enum([
-  "SCHEDULED",
+  "",
   "IN_PROGRESS",
   "FINISHED",

[NoCoverage] StringLiteral
src/schemas/contracts.ts:87:3
   "SCHEDULED",
   "IN_PROGRESS",
   "FINISHED",
-  "CANCELLED",
+  "",
 ]);
 export type MatchState = z.infer<typeof MatchStateSchema>;

[NoCoverage] StringLiteral
src/schemas/contracts.ts:96:3
   "ABANDONED",
   "WALKOVER",
   "INJURY",
-  "OUTRO",
+  "",
 ]);
 export type MatchFinishReason = z.infer<typeof MatchFinishReasonSchema>;

[NoCoverage] ArrayDeclaration
src/schemas/contracts.ts:100:41
 ]);
 export type MatchFinishReason = z.infer<typeof MatchFinishReasonSchema>;
 
-export const MatchFormatSchema = z.enum([
-  "BEST_OF_3",
-  "BEST_OF_3_MATCH_TB",
-  "BEST_OF_3_NO_AD",
-  "BEST_OF_5",
-  "SHORT_SET_2V2_NO_AD",
-  "MATCH_TB_10",
-  "PRO_SET_8",
-]);
+export const MatchFormatSchema = z.enum([]);
 export type MatchFormat = z.infer<typeof MatchFormatSchema>;
 

[NoCoverage] StringLiteral
src/schemas/contracts.ts:102:3
 
 export const MatchFormatSchema = z.enum([
   "BEST_OF_3",
-  "BEST_OF_3_MATCH_TB",
+  "",
   "BEST_OF_3_NO_AD",
   "BEST_OF_5",

[NoCoverage] StringLiteral
src/schemas/contracts.ts:104:3
   "BEST_OF_3",
   "BEST_OF_3_MATCH_TB",
   "BEST_OF_3_NO_AD",
-  "BEST_OF_5",
+  "",
   "SHORT_SET_2V2_NO_AD",
   "MATCH_TB_10",

[NoCoverage] StringLiteral
src/schemas/contracts.ts:107:3
   "BEST_OF_5",
   "SHORT_SET_2V2_NO_AD",
   "MATCH_TB_10",
-  "PRO_SET_8",
+  "",
 ]);
 export type MatchFormat = z.infer<typeof MatchFormatSchema>;

[NoCoverage] ArrayDeclaration
src/schemas/contracts.ts:111:39
 ]);
 export type MatchFormat = z.infer<typeof MatchFormatSchema>;
 
-export const PointTypeSchema = z.enum([
-  "ACE",
-  "WINNER",
-  "FORCED_ERROR",
-  "UNFORCED_ERROR",
-  "DOUBLE_FAULT",
-  "FAULT_FIRST",
-  "FAULT_SECOND",
-]);
+export const PointTypeSchema = z.enum([]);
 export type PointType = z.infer<typeof PointTypeSchema>;
 

[NoCoverage] StringLiteral
src/schemas/contracts.ts:116:3
   "WINNER",
   "FORCED_ERROR",
   "UNFORCED_ERROR",
-  "DOUBLE_FAULT",
+  "",
   "FAULT_FIRST",
   "FAULT_SECOND",

[NoCoverage] StringLiteral
src/schemas/contracts.ts:117:3
   "FORCED_ERROR",
   "UNFORCED_ERROR",
   "DOUBLE_FAULT",
-  "FAULT_FIRST",
+  "",
   "FAULT_SECOND",
 ]);

[NoCoverage] StringLiteral
src/schemas/contracts.ts:118:3
   "UNFORCED_ERROR",
   "DOUBLE_FAULT",
   "FAULT_FIRST",
-  "FAULT_SECOND",
+  "",
 ]);
 export type PointType = z.infer<typeof PointTypeSchema>;

[NoCoverage] ArrowFunction
src/schemas/contracts.ts:131:5
 const flexibleIdValidator = z
   .string()
   .refine(
-    (id) =>
-      /^[a-z0-9]{24,25}$/.test(id) ||
-      /^[0-9a-f]{8}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{12}$/i.test(
-        id,
-      ) ||
-      /^[a-z0-9]{2,20}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{12}$/i.test(
-        id,
-      ),
+    () => undefined,
     "Must be a valid CUID, UUID or prefixed UUID",
   );

[NoCoverage] LogicalOperator
src/schemas/contracts.ts:132:7
   .string()
   .refine(
     (id) =>
-      /^[a-z0-9]{24,25}$/.test(id) ||
-      /^[0-9a-f]{8}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{12}$/i.test(
-        id,
-      ) ||
+      /^[a-z0-9]{24,25}$/.test(id) && /^[0-9a-f]{8}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{12}$/i.test(id) ||
       /^[a-z0-9]{2,20}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{12}$/i.test(
         id,

[NoCoverage] ConditionalExpression
src/schemas/contracts.ts:132:7
   .string()
   .refine(
     (id) =>
-      /^[a-z0-9]{24,25}$/.test(id) ||
-      /^[0-9a-f]{8}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{12}$/i.test(
-        id,
-      ) ||
-      /^[a-z0-9]{2,20}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{12}$/i.test(
-        id,
-      ),
+      true,
     "Must be a valid CUID, UUID or prefixed UUID",
   );

[NoCoverage] Regex
src/schemas/contracts.ts:133:7
   .refine(
     (id) =>
       /^[a-z0-9]{24,25}$/.test(id) ||
-      /^[0-9a-f]{8}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{12}$/i.test(
+      /^[0-9a-f]{8}-[^0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{12}$/i.test(
         id,
       ) ||

[NoCoverage] Regex
src/schemas/contracts.ts:136:7
       /^[0-9a-f]{8}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{12}$/i.test(
         id,
       ) ||
-      /^[a-z0-9]{2,20}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{12}$/i.test(
+      /^[a-z0-9]{2,20}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{12}/i.test(
         id,
       ),

[NoCoverage] Regex
src/schemas/contracts.ts:136:7
       /^[0-9a-f]{8}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{12}$/i.test(
         id,
       ) ||
-      /^[a-z0-9]{2,20}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{12}$/i.test(
+      /^[a-z0-9]{2,20}-[0-9a-f]-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{12}$/i.test(
         id,
       ),

[NoCoverage] MethodExpression
src/schemas/contracts.ts:144:9
 
 export const PlayerSchema = z.object({
   id: flexibleIdValidator,
-  name: z.string().min(2).max(100),
+  name: z.string().max(2).max(100),
   role: RoleSchema,
 });

[NoCoverage] MethodExpression
src/schemas/contracts.ts:144:9
 
 export const PlayerSchema = z.object({
   id: flexibleIdValidator,
-  name: z.string().min(2).max(100),
+  name: z.string().min(2).min(100),
   role: RoleSchema,
 });

[NoCoverage] ObjectLiteral
src/schemas/contracts.ts:158:13
   isFirstServe: z.boolean().optional(),
   isSecondServe: z.boolean().optional(),
   firstFaultDetail: z
-    .object({
-      errorType: z.string().optional(),
-      serveEffect: z.string().optional(),
-      direction: z.string().optional(),
-    })
+    .object({})
     .optional(),
   rallyDetails: RallyDetailsSchema.optional(),

[NoCoverage] MethodExpression
src/schemas/contracts.ts:170:13
     .object({
       zone: z.string().optional(),
       stroke: z.string().optional(),
-      note: z.string().max(200).optional(),
+      note: z.string().min(200).optional(),
       rallyDetails: RallyDetailsSchema.optional(),
       rallyLength: z.number().int().optional(),

[NoCoverage] ObjectLiteral
src/schemas/contracts.ts:187:41
 });
 export type PointFlowInput = z.infer<typeof PointFlowInputSchema>;
 
-export const GameScoreSchema = z.object({
-  player1: z.number().int().min(0),
-  player2: z.number().int().min(0),
-  isDeuce: z.boolean().optional(),
-  advantage: z.enum(["player1", "player2"]).nullable().optional(),
-  secondServe: z.boolean().optional(),
-});
+export const GameScoreSchema = z.object({});
 
 export const SetScoreSchema = z.object({

[NoCoverage] MethodExpression
src/schemas/contracts.ts:188:12
 export type PointFlowInput = z.infer<typeof PointFlowInputSchema>;
 
 export const GameScoreSchema = z.object({
-  player1: z.number().int().min(0),
+  player1: z.number().int().max(0),
   player2: z.number().int().min(0),
   isDeuce: z.boolean().optional(),

[NoCoverage] MethodExpression
src/schemas/contracts.ts:189:12
 
 export const GameScoreSchema = z.object({
   player1: z.number().int().min(0),
-  player2: z.number().int().min(0),
+  player2: z.number().int().max(0),
   isDeuce: z.boolean().optional(),
   advantage: z.enum(["player1", "player2"]).nullable().optional(),

[NoCoverage] MethodExpression
src/schemas/contracts.ts:196:12
 });
 
 export const SetScoreSchema = z.object({
-  player1: z.number().int().min(0),
+  player1: z.number().int().max(0),
   player2: z.number().int().min(0),
   isTiebreak: z.boolean().optional(),

[NoCoverage] MethodExpression
src/schemas/contracts.ts:200:58
   player2: z.number().int().min(0),
   isTiebreak: z.boolean().optional(),
   tiebreakScore: z
-    .object({ player1: z.number().int().min(0), player2: z.number().int().min(0) })
+    .object({ player1: z.number().int().min(0), player2: z.number().int().max(0) })
     .nullable()
     .optional(),

[NoCoverage] MethodExpression
src/schemas/contracts.ts:200:24
   player2: z.number().int().min(0),
   isTiebreak: z.boolean().optional(),
   tiebreakScore: z
-    .object({ player1: z.number().int().min(0), player2: z.number().int().min(0) })
+    .object({ player1: z.number().int().max(0), player2: z.number().int().min(0) })
     .nullable()
     .optional(),

[NoCoverage] StringLiteral
src/schemas/contracts.ts:208:30
 export const MatchScoreStateSchema = z.object({
   sets: z.array(SetScoreSchema),
   currentGame: GameScoreSchema,
-  server: z.enum(["player1", "player2"]),
+  server: z.enum(["player1", ""]),
   isFinished: z.boolean(),
   winner: z.enum(["player1", "player2"]).nullable(),

[NoCoverage] StringLiteral
src/schemas/contracts.ts:208:19
 export const MatchScoreStateSchema = z.object({
   sets: z.array(SetScoreSchema),
   currentGame: GameScoreSchema,
-  server: z.enum(["player1", "player2"]),
+  server: z.enum(["", "player2"]),
   isFinished: z.boolean(),
   winner: z.enum(["player1", "player2"]).nullable(),

[NoCoverage] StringLiteral
src/schemas/contracts.ts:210:30
   currentGame: GameScoreSchema,
   server: z.enum(["player1", "player2"]),
   isFinished: z.boolean(),
-  winner: z.enum(["player1", "player2"]).nullable(),
+  winner: z.enum(["player1", ""]).nullable(),
   setsWon: z
     .object({

[NoCoverage] ObjectLiteral
src/schemas/contracts.ts:212:13
   isFinished: z.boolean(),
   winner: z.enum(["player1", "player2"]).nullable(),
   setsWon: z
-    .object({
-      player1: z.number().int().min(0),
-      player2: z.number().int().min(0),
-    })
+    .object({})
     .optional(),
   startedAt: z.number().nullable().optional(),

[NoCoverage] MethodExpression
src/schemas/contracts.ts:213:16
   winner: z.enum(["player1", "player2"]).nullable(),
   setsWon: z
     .object({
-      player1: z.number().int().min(0),
+      player1: z.number().int().max(0),
       player2: z.number().int().min(0),
     })

[NoCoverage] ObjectLiteral
src/schemas/contracts.ts:227:16
    */
   history: z
     .array(
-      z.object({
-        stateBefore: z.unknown(),
-        point: z.unknown(),
-      })
+      z.object({})
     )
     .optional(),

[NoCoverage] MethodExpression
src/schemas/contracts.ts:272:9
 export type Match = z.infer<typeof MatchSchema>;
 
 export const CreatePlayerInputSchema = z.object({
-  name: z.string().min(2, 'Nome deve ter pelo menos 2 caracteres'),
+  name: z.string().max(2, 'Nome deve ter pelo menos 2 caracteres'),
   email: z.string().email('Email inválido').optional(),
   gender: z.enum(['MALE', 'FEMALE']).optional(),

[NoCoverage] StringLiteral
src/schemas/contracts.ts:273:27
 
 export const CreatePlayerInputSchema = z.object({
   name: z.string().min(2, 'Nome deve ter pelo menos 2 caracteres'),
-  email: z.string().email('Email inválido').optional(),
+  email: z.string().email("").optional(),
   gender: z.enum(['MALE', 'FEMALE']).optional(),
   age: z.number().min(1).max(120).optional(),

[NoCoverage] StringLiteral
src/schemas/contracts.ts:274:19
 export const CreatePlayerInputSchema = z.object({
   name: z.string().min(2, 'Nome deve ter pelo menos 2 caracteres'),
   email: z.string().email('Email inválido').optional(),
-  gender: z.enum(['MALE', 'FEMALE']).optional(),
+  gender: z.enum(["", 'FEMALE']).optional(),
   age: z.number().min(1).max(120).optional(),
   birthDate: z.coerce.date().optional(),

[NoCoverage] MethodExpression
src/schemas/contracts.ts:275:8
   name: z.string().min(2, 'Nome deve ter pelo menos 2 caracteres'),
   email: z.string().email('Email inválido').optional(),
   gender: z.enum(['MALE', 'FEMALE']).optional(),
-  age: z.number().min(1).max(120).optional(),
+  age: z.number().max(1).max(120).optional(),
   birthDate: z.coerce.date().optional(),
   dominance: z.enum(['LEFT', 'RIGHT']).optional(),

[NoCoverage] MethodExpression
src/schemas/contracts.ts:275:8
   name: z.string().min(2, 'Nome deve ter pelo menos 2 caracteres'),
   email: z.string().email('Email inválido').optional(),
   gender: z.enum(['MALE', 'FEMALE']).optional(),
-  age: z.number().min(1).max(120).optional(),
+  age: z.number().min(1).min(120).optional(),
   birthDate: z.coerce.date().optional(),
   dominance: z.enum(['LEFT', 'RIGHT']).optional(),

[NoCoverage] StringLiteral
src/schemas/contracts.ts:277:22
   gender: z.enum(['MALE', 'FEMALE']).optional(),
   age: z.number().min(1).max(120).optional(),
   birthDate: z.coerce.date().optional(),
-  dominance: z.enum(['LEFT', 'RIGHT']).optional(),
+  dominance: z.enum(["", 'RIGHT']).optional(),
   backhand: z.enum(['ONE_HANDED', 'TWO_HANDED']).optional(),
   rankings: z.record(

[NoCoverage] ArrayDeclaration
src/schemas/contracts.ts:277:21
   gender: z.enum(['MALE', 'FEMALE']).optional(),
   age: z.number().min(1).max(120).optional(),
   birthDate: z.coerce.date().optional(),
-  dominance: z.enum(['LEFT', 'RIGHT']).optional(),
+  dominance: z.enum([]).optional(),
   backhand: z.enum(['ONE_HANDED', 'TWO_HANDED']).optional(),
   rankings: z.record(

[NoCoverage] StringLiteral
src/schemas/contracts.ts:278:35
   age: z.number().min(1).max(120).optional(),
   birthDate: z.coerce.date().optional(),
   dominance: z.enum(['LEFT', 'RIGHT']).optional(),
-  backhand: z.enum(['ONE_HANDED', 'TWO_HANDED']).optional(),
+  backhand: z.enum(['ONE_HANDED', ""]).optional(),
   rankings: z.record(
     z.enum(['ESTADUAL', 'CBT', 'COSAT', 'ITF', 'ITF_Juniors', 'ATP', 'WTA']),

[NoCoverage] StringLiteral
src/schemas/contracts.ts:280:70
   dominance: z.enum(['LEFT', 'RIGHT']).optional(),
   backhand: z.enum(['ONE_HANDED', 'TWO_HANDED']).optional(),
   rankings: z.record(
-    z.enum(['ESTADUAL', 'CBT', 'COSAT', 'ITF', 'ITF_Juniors', 'ATP', 'WTA']),
+    z.enum(['ESTADUAL', 'CBT', 'COSAT', 'ITF', 'ITF_Juniors', 'ATP', ""]),
     z.object({
       position: z.number().min(1),

[NoCoverage] StringLiteral
src/schemas/contracts.ts:280:63
   dominance: z.enum(['LEFT', 'RIGHT']).optional(),
   backhand: z.enum(['ONE_HANDED', 'TWO_HANDED']).optional(),
   rankings: z.record(
-    z.enum(['ESTADUAL', 'CBT', 'COSAT', 'ITF', 'ITF_Juniors', 'ATP', 'WTA']),
+    z.enum(['ESTADUAL', 'CBT', 'COSAT', 'ITF', 'ITF_Juniors', "", 'WTA']),
     z.object({
       position: z.number().min(1),

[NoCoverage] ObjectLiteral
src/schemas/contracts.ts:281:14
   backhand: z.enum(['ONE_HANDED', 'TWO_HANDED']).optional(),
   rankings: z.record(
     z.enum(['ESTADUAL', 'CBT', 'COSAT', 'ITF', 'ITF_Juniors', 'ATP', 'WTA']),
-    z.object({
-      position: z.number().min(1),
-      category: z.string().optional(),
-      class: z.string().optional(),
-      juvenilePosition: z.number().min(1).optional(),
-    })
+    z.object({})
   ).optional(),
   club: z.string().optional(),

[NoCoverage] MethodExpression
src/schemas/contracts.ts:282:17
   rankings: z.record(
     z.enum(['ESTADUAL', 'CBT', 'COSAT', 'ITF', 'ITF_Juniors', 'ATP', 'WTA']),
     z.object({
-      position: z.number().min(1),
+      position: z.number().max(1),
       category: z.string().optional(),
       class: z.string().optional(),

[NoCoverage] MethodExpression
src/schemas/contracts.ts:285:25
       position: z.number().min(1),
       category: z.string().optional(),
       class: z.string().optional(),
-      juvenilePosition: z.number().min(1).optional(),
+      juvenilePosition: z.number().max(1).optional(),
     })
   ).optional(),

[NoCoverage] MethodExpression
src/schemas/contracts.ts:294:9
 export type CreatePlayerInput = z.infer<typeof CreatePlayerInputSchema>;
 
 export const CreateUserInputSchema = z.object({
-  name: z.string().min(2, 'Nome deve ter pelo menos 2 caracteres'),
+  name: z.string().max(2, 'Nome deve ter pelo menos 2 caracteres'),
   email: z.string().email('Email inválido'),
   password: z.string().min(8, 'Senha deve ter pelo menos 8 caracteres'),

[NoCoverage] MethodExpression
src/schemas/contracts.ts:296:13
 export const CreateUserInputSchema = z.object({
   name: z.string().min(2, 'Nome deve ter pelo menos 2 caracteres'),
   email: z.string().email('Email inválido'),
-  password: z.string().min(8, 'Senha deve ter pelo menos 8 caracteres'),
+  password: z.string().max(8, 'Senha deve ter pelo menos 8 caracteres'),
   role: z.enum(['ADMIN', 'GESTOR', 'COACH', 'ATHLETE', 'SPECTATOR']),
   club: z.string().optional(),

[NoCoverage] StringLiteral
src/schemas/contracts.ts:296:31
 export const CreateUserInputSchema = z.object({
   name: z.string().min(2, 'Nome deve ter pelo menos 2 caracteres'),
   email: z.string().email('Email inválido'),
-  password: z.string().min(8, 'Senha deve ter pelo menos 8 caracteres'),
+  password: z.string().min(8, ""),
   role: z.enum(['ADMIN', 'GESTOR', 'COACH', 'ATHLETE', 'SPECTATOR']),
   club: z.string().optional(),

[NoCoverage] MethodExpression
src/schemas/contracts.ts:303:11
 export type CreateUserInput = z.infer<typeof CreateUserInputSchema>;
 
 export const ListPlayersInputSchema = z.object({
-  userId: z.string().min(1, 'userId é obrigatório'),
+  userId: z.string().max(1, 'userId é obrigatório'),
   cursor: z.string().optional(),
   limit: z.coerce.number().int().min(1).max(100).default(20),

[NoCoverage] MethodExpression
src/schemas/contracts.ts:305:10
 export const ListPlayersInputSchema = z.object({
   userId: z.string().min(1, 'userId é obrigatório'),
   cursor: z.string().optional(),
-  limit: z.coerce.number().int().min(1).max(100).default(20),
+  limit: z.coerce.number().int().max(1).max(100).default(20),
 });
 export type ListPlayersInput = z.infer<typeof ListPlayersInputSchema>;

[NoCoverage] MethodExpression
src/schemas/contracts.ts:305:10
 export const ListPlayersInputSchema = z.object({
   userId: z.string().min(1, 'userId é obrigatório'),
   cursor: z.string().optional(),
-  limit: z.coerce.number().int().min(1).max(100).default(20),
+  limit: z.coerce.number().int().min(1).min(100).default(20),
 });
 export type ListPlayersInput = z.infer<typeof ListPlayersInputSchema>;

[NoCoverage] StringLiteral
src/schemas/contracts.ts:312:26
 export const ListUsersInputSchema = z.object({
   cursor: z.string().optional(),
   limit: z.coerce.number().int().min(1).max(100).default(20),
-  role: z.enum(['ADMIN', 'GESTOR', 'COACH', 'ATHLETE', 'SPECTATOR']).optional(),
+  role: z.enum(['ADMIN', "", 'COACH', 'ATHLETE', 'SPECTATOR']).optional(),
 });
 export type ListUsersInput = z.infer<typeof ListUsersInputSchema>;

[NoCoverage] ArrayDeclaration
src/schemas/contracts.ts:312:16
 export const ListUsersInputSchema = z.object({
   cursor: z.string().optional(),
   limit: z.coerce.number().int().min(1).max(100).default(20),
-  role: z.enum(['ADMIN', 'GESTOR', 'COACH', 'ATHLETE', 'SPECTATOR']).optional(),
+  role: z.enum([]).optional(),
 });
 export type ListUsersInput = z.infer<typeof ListUsersInputSchema>;

[NoCoverage] ObjectLiteral
src/schemas/contracts.ts:317:11
 export type ListUsersInput = z.infer<typeof ListUsersInputSchema>;
 
 export const CreateMatchInputSchema = z
-  .object({
-    player1Id: z.string().min(1),
-    player2Id: z.string().min(1),
-    format: MatchFormatSchema,
-    sportType: z.string().nullish(),
-    courtType: z.string().nullish(),
-    nickname: z.string().nullish(),
-    visibility: z.string().nullish(),
-    openForAnnotation: z.boolean().nullish(),
-    scheduledAt: z.coerce.date().nullish(),
-    initialServerId: z.string().min(1).nullish(),
-    tournamentName: z.string().nullish(),
-    category: z.string().nullish(),
-    round: z.string().nullish(),
-    roundName: z.string().nullish(),
-    bracketType: z.string().nullish(),
-    temperature: z.number().nullish(),
-    humidity: z.number().nullish(),
-    force: z.boolean().optional(),
-  })
+  .object({})
   .refine((data) => data.player1Id !== data.player2Id, {
     message: "Jogador 2 deve ser diferente do Jogador 1",

[NoCoverage] MethodExpression
src/schemas/contracts.ts:318:16
 
 export const CreateMatchInputSchema = z
   .object({
-    player1Id: z.string().min(1),
+    player1Id: z.string().max(1),
     player2Id: z.string().min(1),
     format: MatchFormatSchema,

[NoCoverage] MethodExpression
src/schemas/contracts.ts:319:16
 export const CreateMatchInputSchema = z
   .object({
     player1Id: z.string().min(1),
-    player2Id: z.string().min(1),
+    player2Id: z.string().max(1),
     format: MatchFormatSchema,
     sportType: z.string().nullish(),

[NoCoverage] MethodExpression
src/schemas/contracts.ts:327:22
     visibility: z.string().nullish(),
     openForAnnotation: z.boolean().nullish(),
     scheduledAt: z.coerce.date().nullish(),
-    initialServerId: z.string().min(1).nullish(),
+    initialServerId: z.string().max(1).nullish(),
     tournamentName: z.string().nullish(),
     category: z.string().nullish(),

[NoCoverage] ArrowFunction
src/schemas/contracts.ts:337:11
     humidity: z.number().nullish(),
     force: z.boolean().optional(),
   })
-  .refine((data) => data.player1Id !== data.player2Id, {
+  .refine(() => undefined, {
     message: "Jogador 2 deve ser diferente do Jogador 1",
     path: ["player2Id"],

[NoCoverage] ConditionalExpression
src/schemas/contracts.ts:337:21
     humidity: z.number().nullish(),
     force: z.boolean().optional(),
   })
-  .refine((data) => data.player1Id !== data.player2Id, {
+  .refine((data) => true, {
     message: "Jogador 2 deve ser diferente do Jogador 1",
     path: ["player2Id"],

[NoCoverage] StringLiteral
src/schemas/contracts.ts:338:14
     force: z.boolean().optional(),
   })
   .refine((data) => data.player1Id !== data.player2Id, {
-    message: "Jogador 2 deve ser diferente do Jogador 1",
+    message: "",
     path: ["player2Id"],
   });

[NoCoverage] ObjectLiteral
src/schemas/contracts.ts:343:48
   });
 export type CreateMatchInput = z.infer<typeof CreateMatchInputSchema>;
 
-export const DeleteMatchInputSchema = z.object({
-  type: z.enum(['soft', 'hard']),
-  reason: z.string().max(500).optional(),
-});
+export const DeleteMatchInputSchema = z.object({});
 export type DeleteMatchInput = z.infer<typeof DeleteMatchInputSchema>;
 

[NoCoverage] StringLiteral
src/schemas/contracts.ts:344:25
 export type CreateMatchInput = z.infer<typeof CreateMatchInputSchema>;
 
 export const DeleteMatchInputSchema = z.object({
-  type: z.enum(['soft', 'hard']),
+  type: z.enum(['soft', ""]),
   reason: z.string().max(500).optional(),
 });

[NoCoverage] MethodExpression
src/schemas/contracts.ts:345:11
 
 export const DeleteMatchInputSchema = z.object({
   type: z.enum(['soft', 'hard']),
-  reason: z.string().max(500).optional(),
+  reason: z.string().min(500).optional(),
 });
 export type DeleteMatchInput = z.infer<typeof DeleteMatchInputSchema>;

[NoCoverage] ObjectLiteral
src/schemas/contracts.ts:349:48
 });
 export type DeleteMatchInput = z.infer<typeof DeleteMatchInputSchema>;
 
-export const FinishMatchInputSchema = z.object({
-  reason: MatchFinishReasonSchema,
-  note: z.string().max(500).optional(),
-  scoreState: MatchScoreStateSchema.optional(),
-});
+export const FinishMatchInputSchema = z.object({});
 export type FinishMatchInput = z.infer<typeof FinishMatchInputSchema>;
 

[NoCoverage] MethodExpression
src/schemas/contracts.ts:351:9
 
 export const FinishMatchInputSchema = z.object({
   reason: MatchFinishReasonSchema,
-  note: z.string().max(500).optional(),
+  note: z.string().min(500).optional(),
   scoreState: MatchScoreStateSchema.optional(),
 });
