[NoCoverage] ObjectLiteral
src/schemas/contracts.ts:357:11
 export type FinishMatchInput = z.infer<typeof FinishMatchInputSchema>;
 
 export const MatchStateInputSchema = z
-  .object({
-    state: MatchStateSchema,
-    initialServerId: z.string().min(1).optional(),
-    scoreState: z
-      .union([MatchScoreStateEnvelopeSchema, MatchScoreStateSchema])
-      .optional(),
-    version: z.number().int().optional(),
-    allowScoreEdit: z.boolean().optional(),
-    /**
-     * true somente quando a mudança de placar vem do fluxo "Editar Placar"
-     * (retomada de partida interrompida). Diferente de um `undo` comum,
-     * este flag instrui o backend a preservar o `scoreState` anterior
-     * (com seu `history` completo) em `MatchScoreEdit` antes de
-     * sobrescrevê-lo, para que a timeline do /report não perca o trecho
-     * já anotado antes da correção manual.
-     */
-    isManualScoreEdit: z.boolean().optional(),
-  })
+  .object({})
   .refine((data) => data.state !== "SCHEDULED", {
     message: "Não é possível voltar para SCHEDULED via API",

[NoCoverage] MethodExpression
src/schemas/contracts.ts:359:22
 export const MatchStateInputSchema = z
   .object({
     state: MatchStateSchema,
-    initialServerId: z.string().min(1).optional(),
+    initialServerId: z.string().max(1).optional(),
     scoreState: z
       .union([MatchScoreStateEnvelopeSchema, MatchScoreStateSchema])

[NoCoverage] EqualityOperator
src/schemas/contracts.ts:375:21
      */
     isManualScoreEdit: z.boolean().optional(),
   })
-  .refine((data) => data.state !== "SCHEDULED", {
+  .refine((data) => data.state === "SCHEDULED", {
     message: "Não é possível voltar para SCHEDULED via API",
   });

[NoCoverage] ArrowFunction
src/schemas/contracts.ts:375:11
      */
     isManualScoreEdit: z.boolean().optional(),
   })
-  .refine((data) => data.state !== "SCHEDULED", {
+  .refine(() => undefined, {
     message: "Não é possível voltar para SCHEDULED via API",
   });

[NoCoverage] ObjectLiteral
src/schemas/contracts.ts:380:44
   });
 export type MatchStateInput = z.infer<typeof MatchStateInputSchema>;
 
-export const LoginPayloadSchema = z.object({
-  email: z.string().email(),
-  password: z.string().min(8),
-});
+export const LoginPayloadSchema = z.object({});
 export type LoginPayload = z.infer<typeof LoginPayloadSchema>;
 

[NoCoverage] MethodExpression
src/schemas/contracts.ts:382:13
 
 export const LoginPayloadSchema = z.object({
   email: z.string().email(),
-  password: z.string().min(8),
+  password: z.string().max(8),
 });
 export type LoginPayload = z.infer<typeof LoginPayloadSchema>;

[NoCoverage] MethodExpression
src/schemas/contracts.ts:392:12
   type: z.literal("POINT"),
   payload: PointFlowInputSchema,
   timestamp: z.number(),
-  retries: z.number().int().min(0).default(0),
+  retries: z.number().int().max(0).default(0),
   status: z.enum(["PENDING", "SYNCING", "FAILED"]),
 });

[NoCoverage] StringLiteral
src/schemas/contracts.ts:393:19
   payload: PointFlowInputSchema,
   timestamp: z.number(),
   retries: z.number().int().min(0).default(0),
-  status: z.enum(["PENDING", "SYNCING", "FAILED"]),
+  status: z.enum(["", "SYNCING", "FAILED"]),
 });
 export type QueuedAction = z.infer<typeof QueuedActionSchema>;

[NoCoverage] StringLiteral
src/schemas/contracts.ts:393:30
   payload: PointFlowInputSchema,
   timestamp: z.number(),
   retries: z.number().int().min(0).default(0),
-  status: z.enum(["PENDING", "SYNCING", "FAILED"]),
+  status: z.enum(["PENDING", "", "FAILED"]),
 });
 export type QueuedAction = z.infer<typeof QueuedActionSchema>;

[NoCoverage] StringLiteral
src/schemas/contracts.ts:400:3
 export const AnnotationSessionStatusSchema = z.enum([
   "IN_PROGRESS",
   "COMPLETED",
-  "ABANDONED",
+  "",
 ]);
 export type AnnotationSessionStatus = z.infer<

[NoCoverage] ObjectLiteral
src/schemas/contracts.ts:412:13
   endorsedByUserId: flexibleIdValidator,
   endorsedAt: z.coerce.date(),
   endorsedBy: z
-    .object({
-      id: flexibleIdValidator,
-      name: z.string(),
-      email: z.string().email(),
-    })
+    .object({})
     .optional(),
 });

[NoCoverage] ObjectLiteral
src/schemas/contracts.ts:443:47
 });
 export type AnnotationSession = z.infer<typeof AnnotationSessionSchema>;
 
-export const EndSessionInputSchema = z.object({
-  status: AnnotationSessionStatusSchema.optional(),
-  finalState: z.unknown().optional(),
-});
+export const EndSessionInputSchema = z.object({});
 export type EndSessionInput = z.infer<typeof EndSessionInputSchema>;
 

[NoCoverage] ObjectLiteral
src/schemas/contracts.ts:456:44
   typeof MarkSessionAbandonedInputSchema
 >;
 
-export const RankingEntrySchema = z.object({
-  category: z.string().optional(),
-  class: z.string().optional(),
-  position: z.number().int().min(1),
-  juvenilePosition: z.number().int().min(1).optional(),
-});
+export const RankingEntrySchema = z.object({});
 export type RankingEntry = z.infer<typeof RankingEntrySchema>;
 

[NoCoverage] MethodExpression
src/schemas/contracts.ts:459:13
 export const RankingEntrySchema = z.object({
   category: z.string().optional(),
   class: z.string().optional(),
-  position: z.number().int().min(1),
+  position: z.number().int().max(1),
   juvenilePosition: z.number().int().min(1).optional(),
 });

[NoCoverage] MethodExpression
src/schemas/contracts.ts:460:21
   category: z.string().optional(),
   class: z.string().optional(),
   position: z.number().int().min(1),
-  juvenilePosition: z.number().int().min(1).optional(),
+  juvenilePosition: z.number().int().max(1).optional(),
 });
 export type RankingEntry = z.infer<typeof RankingEntrySchema>;

[NoCoverage] ArrayDeclaration
src/schemas/contracts.ts:465:10
 export type RankingEntry = z.infer<typeof RankingEntrySchema>;
 
 export const RankingsSchema = z.record(
-  z.enum(['ESTADUAL', 'CBT', 'COSAT', 'ITF', 'ITF_Juniors', 'ATP', 'WTA']),
+  z.enum([]),
   RankingEntrySchema,
 );
